{
  "14177315-86ab-4da0-b2b6-d3cbcd4a83f4": {
    "status": "completed",
    "result": {
      "dates": {
        "agreement_date": {
          "value": "April 18, 2017",
          "page_number": 1
        },
        "effective_date": {
          "value": "\"Effective Date\" (as defined in the Settlement Approval Order)",
          "page_number": 23
        },
        "maturity_date": {
          "value": null,
          "page_number": 0
        },
        "end_date_of_respective_facility": {
          "value": null,
          "page_number": 0
        },
        "start_date_of_facility_availability_period_facility_a": {
          "value": null,
          "page_number": 0
        },
        "end_date_of_facility_availability_period_facility_a": {
          "value": null,
          "page_number": 0
        },
        "start_date_of_facility_availability_period_facility_b": {
          "value": null,
          "page_number": 0
        },
        "end_date_of_facility_availability_period_facility_b": {
          "value": null,
          "page_number": 0
        }
      },
      "general": {
        "borrower": {
          "value": "ALVAREZ & MARSAL CANADA INC., solely in its capacity as Court Appointed Receiver and Manager and Construction Lien Trustee of URBANCORP (LESLIEVILLE) DEVELOPMENTS INC., URBANCORP (RIVERDALE) DEVELOPMENTS INC. and URBANCORP (THE BEACH) DEVELOPMENTS INC. and not in its personal or corporate capacity (the “Construction Receiver”)",
          "page_number": 4
        },
        "agent": {
          "value": "CANADIAN IMPERIAL BANK OF COMMERCE, in its capacity as administrative agent for the Lenders (the “Administrative Agent”)",
          "page_number": 4
        },
        "security_agent": {
          "value": "Administrative Agent",
          "page_number": 32
        },
        "sponsor_name": {
          "value": "Terra Firma Capital Corporation",
          "page_number": 17
        },
        "majority_lenders": {
          "value": "Required Lenders means (i) if no Loans are outstanding under this Agreement, the Lenders holding at least 66 2/3% of the aggregate amount of Commitments, (ii) if any Loans are outstanding under this Agreement, the Lenders to which an amount in aggregate equal to at least 66 2/3% of such Loans is owed, and (iii) where there are only two Lenders, both such Lenders.",
          "page_number": 16
        }
      },
      "definitions": {
        "lma_defined_term": {
          "value": "The attached model credit agreement provisions, which have been revised under the direction of the Canadian Bankers' Association Secondary Loan Market Specialist Group from provisions prepared by The Loan Syndications and Trading Association, Inc., form part of this Agreement, except for the footnotes to the model credit agreement provisions and subject to the following variations",
          "page_number": 52
        },
        "reference_bank_definition": {
          "value": null,
          "page_number": 0
        },
        "base_currency": {
          "value": "Canadian Dollars and Cdn. $ mean the lawful money of Canada.",
          "page_number": 5
        },
        "optional_currencies": {
          "value": null,
          "page_number": 0
        },
        "disqualified_lender_definition": {
          "value": null,
          "page_number": 0
        }
      },
      "credit_facilities": {
        "stated_term_of_facility": {
          "value": null,
          "page_number": 0
        },
        "facility_name": {
          "value": "Credit Facility",
          "page_number": 17
        },
        "facility_type": {
          "value": "non-revolving, term credit facility",
          "page_number": 20
        },
        "facility_size_term": {
          "value": null,
          "page_number": 0
        },
        "facility_size_revolver": {
          "value": null,
          "page_number": 0
        },
        "total_facility_size": {
          "value": "$4,500,000.00",
          "page_number": 7
        },
        "total_commitments": {
          "value": "Credit Facility Commitment means (a) $4,500,000.00, plus (b) if and for so long as the ITC Condition exists, an amount up to the ITC Increase.",
          "page_number": 7
        },
        "loan_commitments": {
          "value": null,
          "page_number": 0
        },
        "term_loan_commitments": {
          "value": null,
          "page_number": 0
        },
        "revolving_loan_commitments": {
          "value": null,
          "page_number": 0
        },
        "repayment_provision": {
          "value": "ARTICLE 5 REPAYMENT",
          "page_number": 26
        },
        "repayment_type": {
          "value": null,
          "page_number": 0
        },
        "mandatory_repayment": {
          "value": "5.01 Mandatory Repayment (1) The Loans and all other Obligations shall shall become due by the Construction Receiver upon the occurrence of an Event of Default hereunder which has been accelerated by the Lenders in accordance with Section 9.02, and subject to compliance with any conditions to such acceleration set forth therein. (2) Notwithstanding any other section of this Agreement, including without limitation, anything to the contrary in Sections 4.01 or 5.01(1) (but subject to Sections 5.01(4) and 5.01(5)), the Construction Receiver shall only be required to pay interest accrued on the Loans (including default interest pursuant to Section 2.08), the Deferred Commitment Fee, the principal amount of the Loans outstanding under the Credit Facility (whether before or after an Event of Default or acceleration) and all other Obligations from time to time only out of and from (i) receipts of Gross Sale Proceeds from the sale of Units or other income from the Units or the realization thereof, and (ii) receipts of sales proceeds, rental (including occupation rent) or other income from, or the realization of, the Beach Remaining Lands, the Leslieville Project (other than the Units) and any and all other property, assets and undertaking of UC Leslieville, UC Beach and UC Riverdale (collectively the amounts in clauses (i) and (ii) being herein called “Proceeds for Distribution”), in each case, as and when such Proceeds for Distribution become available for distribution by the Construction Receiver to the Lenders in the UC Receivership Proceedings; provided that nothing hereinbefore provided shall limit any right or remedy which the Administrative Agent or the Lenders may have under Article 9, subject to compliance with the Settlement Approval Order and any other applicable order of the Court in the UC Receivership Proceedings.",
          "page_number": 26
        },
        "mandatory_prepayment_due_to_change_of_control": {
          "value": null,
          "page_number": 0
        },
        "voluntary_prepayment": {
          "value": null,
          "page_number": 0
        },
        "call_protection_prepayment_clause": {
          "value": null,
          "page_number": 0
        },
        "facility_extension_options": {
          "value": null,
          "page_number": 0
        },
        "facility_extension_option_how_many_years": {
          "value": null,
          "page_number": 0
        },
        "amend_to_extend_clause": {
          "value": null,
          "page_number": 0
        },
        "number_of_extension_options": {
          "value": null,
          "page_number": 0
        },
        "lender_discretion": {
          "value": "If the first advance under the Credit Facility does not occur on or before the First Advance Date, the Required Lenders may, in their sole and absolute discretion, cancel the Credit Facility, in which event, the Lenders will have no further obligation to make Drawdowns available to the Construction Receiver under the Credit Facility. In addition, at any time after that date which is 30 days after (a) the earlier of Total Completion of the Work and completion of the Development Services and (b) the Outside Date (or such later date as may be agreed in writing by the Required Lenders), the Required Lenders may, in their sole and absolute discretion, cancel all or any unutilized portion of the Commitment.",
          "page_number": 21
        },
        "calculation_of_interest": {
          "value": "Unless otherwise stated, wherever in this Agreement reference is made to a rate of interest “per annum” or a similar expression is used, such interest will be calculated on the basis of a calendar year of 365 days, and using the nominal rate method of calculation and not the effective rate method of calculation or on any other basis that gives effect to the principle of deemed reinvestment of interest. Interest will continue to accrue after maturity and default and/or judgment, if any, until payment thereof, and interest will accrue and be compounded monthly on overdue interest, if any.",
          "page_number": 16
        },
        "initial_margin_text": {
          "value": "Prime Rate Margin means 5% per annum.",
          "page_number": 15
        },
        "initial_margin_tables": {
          "value": null,
          "page_number": 0
        },
        "interest_rate_convention": {
          "value": "calculated on the basis of a calendar year of 365 days, and using the nominal rate method of calculation and not the effective rate method of calculation or on any other basis that gives effect to the principle of deemed reinvestment of interest.",
          "page_number": 16
        },
        "interest_rate_floor": {
          "value": null,
          "page_number": 0
        },
        "libor_definition": {
          "value": "Section 3.5 Inability to Determine Rates Etc. If the Required Lenders determine that for any reason a market for bankers' acceptances does not exist at any time or the Lenders cannot for other reasons, after reasonable efforts, readily sell bankers' acceptances or perform their other obligations under this Agreement with respect to bankers' acceptances, the Administrative Agent will promptly so notify the Borrower and each Lender. Thereafter, the Borrower's right to request the acceptance of bankers' acceptances shall be and remain suspended until the Required Lenders determine and the Agent notifies the Borrower and each Lender that the condition causing such determination no longer exists. If the Required Lenders determine that for any reason adequate and reasonable means do not exist for determining the LIBO Rate for any requested Interest Period with respect to a proposed LIBO Rate Loan, or that the LIBO Rate for any requested Interest Period with respect to a proposed LIBO Rate Loan does not adequately and fairly reflect the cost to such Lenders of funding such Loan, the Administrative Agent will promptly so notify the Borrower and each Lender. Thereafter, the obligation of the Lenders to make or maintain LIBO Rate Loans shall be suspended until the Administrative Agent (upon the instruction of the Required Lenders) revokes such notice. Upon receipt of such notice, the Borrower may revoke any pending request for a borrowing, conversion or continuation of LIBO Rate Loans or, failing that, will be deemed to have converted such request into a request for a borrowing of Base Rate Loans in the amount specified therein.",
          "page_number": 60
        },
        "arrangement_fees": {
          "value": null,
          "page_number": 0
        },
        "agency_fees": {
          "value": null,
          "page_number": 0
        }
      },
      "representations_and_warranties": {
        "use_of_proceeds": {
          "value": "Loans made under the Credit Facility will only be used by the Construction Receiver for the following purposes: (1) with respect to the FP Tranche, to finance the Fixed Price payable to Craft under the Craft Construction Contract; and (2) with respect to the Development Tranche, to finance the payment of the Budgeted Development Costs set out in the Initial Development Budget agreed pursuant to the Craft Development Contract.",
          "page_number": 21
        },
        "material_adverse_change_clause": {
          "value": null,
          "page_number": 0
        }
      },
      "covenants": {
        "interest_coverage_covenant": {
          "value": null,
          "page_number": 0
        },
        "interest_coverage_text": {
          "value": null,
          "page_number": 0
        },
        "interest_coverage_tables": {
          "value": null,
          "page_number": 0
        },
        "total_leverage_covenant": {
          "value": null,
          "page_number": 0
        },
        "total_leverage_text": {
          "value": null,
          "page_number": 0
        },
        "total_leverage_tables": {
          "value": null,
          "page_number": 0
        },
        "restricted_asset_sales_permitted_transfers": {
          "value": "No Sale of Project Dispose of or Lease any of the Leslieville Project or the Beach Remaining Lands other than: (a) (i) sales of Units to Opt-In Leslieville Purchasers made pursuant to the terms of the Standard Form Sales Agreement relating thereto and at the prices agreed in or pursuant to the Settlement Approval Order and (ii) interim occupancy of such Units by the Opt-In Leslieville Purchasers; (b) (i) sales of Units to New Curzon Purchasers made pursuant to the terms of the Standard Form Sales Agreement for purchase prices at no less than Proforma Sales Prices as agreed pursuant to the Marketing Plan under the Craft Development Contract as approved by the Required Lenders (as such Proforma Sales Prices may be amended from time to time with the approval of the Required Lenders to the extent contemplated under the Craft Development Contract), (ii) interim occupancy of such Units by the New Curzon Purchasers; (c) sales of unallocated parking spaces and extra storage spaces at the Leslieville Project pursuant to a sales process, and for prices no less than the minimum prices as agreed pursuant to the Marketing Plan under the Craft Development Contract as approved by the Required Lenders (as such minimum prices may be amended from time to time with the approval of the Required Lenders to the extent contemplated under the Craft Development Contract); (d) sales of all or a portion of the Beach Remaining Lands pursuant to a sales process acceptable to the Required Lenders and approved by the Court in the UC Receivership Proceedings and only for a price acceptable to the Required Lenders or as may be directed by the Court; or (e) with the prior written consent of the Required Lenders;",
          "page_number": 33
        },
        "permitted_acquisitions_clause_text": {
          "value": null,
          "page_number": 0
        },
        "permitted_indebtedness_basket": {
          "value": "Permitted Debt means: (a) the Debt under this Agreement; (b) the Craft Loan up to a maximum principal amount of $2,000,000, except as such maximum principal amount may be increased as contemplated under the Settlement Approval Order in order to cover additional principal advances to be made by Craft in connection with (i) the Geo-Thermal Costs, and (ii) without duplication of clause (g) below, the funding of TF Defaulted Cost Overruns under and in accordance with the provisions of the TF Cost Overrun Guarantee; (c) liabilities due and payable to Craft from time to time under the terms of the Craft C&D Contracts; (d) the Existing Syndicate Debt; (e) the Debt of UC Leslieville owing under the Travelers Agreements and Travelers Mortgage; (f) the Debt of UC Leslieville, UC Riverdale and UC Beach owing to Terra Firma on or prior to the date hereof and secured under the mortgage granted by UC Leslie in favour of Terra Firma registered against the Leslieville Project Lands on July 22, 2015; (g) additional debt incurred by the Construction Receiver to cover TF Defaulted Cost Overruns or Defaulted Cost Overruns under and in accordance with the provisions of the TF Cost Overrun Guarantee; (h) any other Debt owed by the Construction Receiver to the Lenders; (i) any liabilities secured by the Receiver’s Expense Reimbursement Charge; (j) any liabilities secured by the Receiver’s Borrowings Charge and the Construction Lien Trustee’s Borrowing Charge (as each term is set forth in Section 22 of the Receivership Order), including as Section 22 may be varied by order of the Court in the UC Receivership Proceedings; (k) any additional Craft Loans to fund Geo-Thermal Costs, to the extent permitted under and made pursuant to the terms of the Settlement Approval Order; and (l) any other Debt which is approved by the Court in the UC Receivership Proceedings.",
          "page_number": 14
        },
        "permitted_financial_indebtedness_text": {
          "value": "Permitted Debt",
          "page_number": 14
        },
        "prepayment_from_asset_sales_proceeds_clause": {
          "value": null,
          "page_number": 0
        },
        "percent_of_net_cash_proceeds": {
          "value": null,
          "page_number": 0
        },
        "permitted_reinvestment_period": {
          "value": null,
          "page_number": 0
        },
        "equity_cure_provision": {
          "value": null,
          "page_number": 0
        },
        "number_of_equity_cures": {
          "value": null,
          "page_number": 0
        },
        "subsidiary_guarantees": {
          "value": null,
          "page_number": 0
        },
        "transfer_provisions": {
          "value": "Section 10 Successors and Assigns",
          "page_number": 68
        },
        "amendment_clause": {
          "value": "No amendment to this Agreement will be valid or binding unless set forth in writing and duly executed by the Construction Receiver and the Administrative Agent for and on behalf of the Lenders or the Required Lenders, as the case may be.",
          "page_number": 41
        },
        "snooze_lose_clause": {
          "value": null,
          "page_number": 0
        },
        "disqualified_lender_list": {
          "value": null,
          "page_number": 0
        }
      },
      "defaults": {
        "events_of_default": {
          "value": "9.01 Events of Default",
          "page_number": 32
        },
        "payment_default_provision": {
          "value": "if the Construction Receiver fails to pay any Obligation when due",
          "page_number": 32
        },
        "insolvency_default": {
          "value": "none of Craft, the Builder or Terra Firma shall be Insolvent",
          "page_number": 23
        },
        "misrepresentation_default": {
          "value": null,
          "page_number": 0
        },
        "market_disruption_clause": {
          "value": null,
          "page_number": 0
        },
        "cross_default": {
          "value": null,
          "page_number": 0
        },
        "cross_acceleration": {
          "value": null,
          "page_number": 0
        },
        "no_set_off": {
          "value": null,
          "page_number": 0
        },
        "set_off_prohibited_for_borrower": {
          "value": null,
          "page_number": 0
        }
      },
      "miscellaneous": {
        "bilateral_or_syndicated": {
          "value": "THE FINANCIAL INSTITUTIONS from time to time party to this Agreement and designated as Lenders on the signatures pages hereto (each, a “Lender” and collectively, the “Lenders”)",
          "page_number": 4
        },
        "business_days_convention_calendar": {
          "value": "Business Day means a day of the year, other than a Saturday, Sunday or statutory holiday, on which the Administrative Agent is open for business at its executive offices in Toronto, Ontario.",
          "page_number": 5
        },
        "business_days_payments_non_business_day_rule": {
          "value": "All payments of principal, interest, fees and other amounts to be made by the Construction Receiver to the Administrative Agent and the Lenders pursuant to this Agreement will be made in the currency in which the Loans are outstanding for value on the day such amount(s) are distributed by the Construction Receiver in accordance with the Settlement Approval Order or, if such day is not a Business Day, on the Business Day next following with interest, by deposit or transfer thereof to the account of the Administrative Agent maintained at the Administrative Agent’s Office in Toronto or at such other place as the Construction Receiver and the Administrative Agent may from time to time agree.",
          "page_number": 28
        },
        "business_days_rate_setting_quotation_day": {
          "value": null,
          "page_number": 0
        },
        "governing_law": {
          "value": "Ontario is the Province for the purposes of Sections 11(a) and (b) of Schedule A. This Agreement shall be governed by, and construed in accordance with, the laws of the Province specified elsewhere in this Agreement and the laws of Canada applicable in that Province.",
          "page_number": 40
        },
        "confidentiality_clause": {
          "value": "Section 14 Treatment of Certain Information: Confidentiality",
          "page_number": 71
        },
        "language_for_client_communication": {
          "value": null,
          "page_number": 0
        }
      }
    },
    "filename": "2-syndicate_construction_loan_agreement_0.pdf",
    "pages": {
      "1": "EXECUTION VERSION \nCREDIT AGREEMENT \nBETWEEN \nALVAREZ & MARSAL CANADA INC., solely in its capacity as  \nCourt Appointed Receiver and Manager and Construction Lien Trustee of  \nURBANCORP (LESLIEVILLE) DEVELOPMENTS INC.,  \nURBANCORP (RIVERDALE) DEVELOPMENTS INC. and  \nURBANCORP (THE BEACH) DEVELOPMENTS INC. \nand not in its personal or corporate capacity \nas Construction Receiver \nAND \nCANADIAN IMPERIAL BANK OF COMMERCE \nas Administrative Agent \nAND \nTHE FINANCIAL INSTITUTIONS \nfrom time to time parties hereto \nas Lenders \nMADE AS OF \nApril 18, 2017 \nGowling WLG (Canada) LLP \n",
      "2": "TABLE OF CONTENTS \nARTICLE 1 INTERPRETATION .................................................................................................................. 1\n1.01 \nDefinitions ........................................................................................................................ 1\n1.02 \nExtended Meanings ....................................................................................................... 15\n1.03 \nInterest Calculations and Payments .............................................................................. 16\n1.04 \nPermitted Encumbrances .............................................................................................. 16\n1.05 \nTime of the Essence ...................................................................................................... 16\n1.06 \nCurrency ........................................................................................................................ 16\n1.07 \nConflicts ......................................................................................................................... 16\n1.08 \nNature of Lenders’ Obligations ...................................................................................... 16\n1.09 \nLimitation of Recourse against Construction Receiver ................................................. 17\n1.10 \nSchedules ...................................................................................................................... 17\nARTICLE 2 THE CREDIT FACILITY ......................................................................................................... 17\n2.01 \nCredit Facility ................................................................................................................. 17\n2.02 \nPurpose of Credit Facility .............................................................................................. 18\n2.03 \nDrawdowns .................................................................................................................... 18\n2.04 \nAdministrative Agent’s Obligations with Respect to Loans ........................................... 19\n2.05 \nLenders’ and Administrative Agent’s Obligations with Respect to Loans ..................... 19\n2.06 \nIrrevocability .................................................................................................................. 19\n2.07 \nAccount of Record ......................................................................................................... 19\n2.08 \nInterest on Excess Loans, Unpaid Costs and Expenses .............................................. 19\nARTICLE 3 DISBURSEMENT CONDITIONS ........................................................................................... 20\n3.01 \nConditions Precedent to First Drawdown ...................................................................... 20\n3.02 \nConditions Precedent to all Subsequent Drawdowns – Leslieville Facilities ................ 23\n3.03 \nProvisos ......................................................................................................................... 25\n3.04 \nWaiver ........................................................................................................................... 25\n3.05 \nCondition to Construction Receiver’s Execution ........................................................... 25\nARTICLE 4 PAYMENTS OF INTEREST AND COMMITMENT FEES ..................................................... 25\n4.01 \nInterest on Prime Rate Loans ........................................................................................ 25\n4.02 \nDeferred Commitment Fee ............................................................................................ 26\n4.03 \nMaximum Rate of Interest ............................................................................................. 26\nARTICLE 5 REPAYMENT ......................................................................................................................... 26\n5.01 \nMandatory Repayment .................................................................................................. 26\nARTICLE 6 PLACE AND APPLICATION OF PAYMENTS ...................................................................... 28\n6.01 \nPlace of Payment of Principal, Interest and Fees ......................................................... 28\nARTICLE 7 COVENANTS ......................................................................................................................... 28\n7.01 \nPositive Covenants ........................................................................................................ 28\n7.02 \nNegative Covenants ...................................................................................................... 30\nARTICLE 8 SECURITY 32\n8.01 \nSecurity .......................................................................................................................... 32\nARTICLE 9 DEFAULT 32\n9.01 \nEvents of Default ........................................................................................................... 32\n",
      "3": "- ii - \n9.02 \nAcceleration and Enforcement ...................................................................................... 33\n9.03 \nRemedies Cumulative ................................................................................................... 34\n9.04 \nPerform Obligations ....................................................................................................... 34\n9.05 \nThird Parties .................................................................................................................. 35\n9.06 \nApplication of Payments ................................................................................................ 35\nARTICLE 10 THE ADMINISTRATIVE AGENT AND THE LENDERS...................................................... 35\n10.01 \nPayments by the Construction Receiver ....................................................................... 35\n10.02 \nPayments by Administrative Agent ................................................................................ 36\n10.03 \nAdministration of the Credit Facility ............................................................................... 36\n10.04 \nRights of Administrative Agent ...................................................................................... 39\n10.05 \nRepresentations, Acknowledgements and Covenants of Lenders ............................... 39\n10.06 \nProvisions Operative Between Lenders and Administrative Agent Only ...................... 39\n10.07 \nMaintenance of Security ................................................................................................ 39\n10.08 \nApplication of Proceeds for Distribution ........................................................................ 40\n10.09 \nNo Partnership ............................................................................................................... 40\n10.10 \nSharing of Information ................................................................................................... 40\nARTICLE 11 GENERAL ............................................................................................................................ 40\n11.01 \nAddresses, Etc. for Notices ........................................................................................... 40\n11.02 \nGoverning Law and Submission to Jurisdiction ............................................................ 40\n11.03 \nEffect of Assignment...................................................................................................... 41\n11.04 \nSurvival .......................................................................................................................... 41\n11.05 \nSeverability .................................................................................................................... 41\n11.06 \nFurther Assurances ....................................................................................................... 41\n11.07 \nAmendments and Waivers ............................................................................................ 41\n11.08 \nReasonableness ............................................................................................................ 41\n11.09 \nTime of the Essence ...................................................................................................... 42\nSCHEDULE A MODEL CREDIT AGREEMENT PROVISIONS .................................................................. 1\nSCHEDULE B LENDERS AND COMMITMENTS ...................................................................................... 1\nSCHEDULE C LEGAL DESCRIPTION OF PROJECT LANDS ................................................................. 1\nSCHEDULE D LEGAL DESCRIPTION OF BEACH REMAINING LANDS ................................................ 1\nSCHEDULE 1.01(A) DRAWDOWN NOTICE .............................................................................................. 1\nSCHEDULE 1.01(B) INITIAL DEVELOPMENT BUDGET .......................................................................... 1\nSCHEDULE 1.01(1)(C)  PROJECT STATUS CERTIFICATE .................................................................... 1\nSCHEDULE 1.01(1)(D)  INDEPENDENT COST CONSULTANT’S CERTIFICATE ................................... 1\n",
      "4": "CREDIT AGREEMENT \nTHIS AGREEMENT is made as of April 18, 2017 \nBETW EEN: \nALVAREZ & MARSAL CANADA INC., solely in its capacity as Court \nAppointed Receiver and Manager and Construction Lien Trustee of \nURBANCORP (LESLIEVILLE) DEVELOPMENTS INC., URBANCORP \n(RIVERDALE) DEVELOPMENTS INC. and URBANCORP (THE BEACH) \nDEVELOPMENTS INC. and not in its personal or corporate capacity (the \n“Construction Receiver”), \n- and - \nCANADIAN IMPERIAL BANK OF COMMERCE,\nin its capacity as administrative agent for the Lenders \n(the “Administrative Agent”), \n- and - \nTHE FINANCIAL INSTITUTIONS from time to time party to this Agreement and \ndesignated as Lenders on the signatures pages hereto (each, a “Lender” and \ncollectively, the “Lenders”), \nWHEREAS the Construction Receiver has requested the Credit Facility to finance \ncertain costs associated with the development and completion of construction of the Leslieville \nProject, and the Lenders have agreed to provide the Credit Facility to the Construction Receiver \nupon and subject to the terms and conditions set out in this Agreement; \nAND WHEREAS Canadian Imperial Bank of Commerce will be the Administrative Agent \nas contemplated by Section 7.1 of Schedule A hereto, namely pursuant to the CBA Model \nCredit Agreement Provisions as set out therein, as modified in accordance with that schedule; \nAND WHEREAS it is a condition of the provision of the Credit Facility that Terra Firma \nagrees to provide the TF Cost Overrun Guarantee and Terra Firma has agreed to do so; \nNOW THEREFORE, in consideration of the covenants and agreements herein \ncontained, the parties agree as follows: \nARTICLE 1 \nINTERPRETATION \n1.01 \nDefinitions \nIn this Agreement, unless something in the subject matter or context is inconsistent \ntherewith: \n",
      "5": "- 2 - \n“Administrative Agent’s Office” means the branch of the Administrative Agent located at 595 \nBay Street, Toronto, Ontario, M5G 2C2, or such other office in Canada that the Administrative \nAgent may from time to time designate by notice to the Construction Receiver and the Lenders. \n“Agreement” means this credit agreement, including its recitals and schedules. \n“Applicable Law” has the meaning set out in Schedule A. \n“Applicable Percentage” has the meaning set out in Schedule A. \n“Architect” means such architect as may be retained by or on behalf of Craft in connection with \nthe Construction of the Leslieville Project, which architect if other than the architect for the \nLeslieville Project retained by UC Leslieville prior to the commencement of the UC Receivership \nProceedings, shall be subject to the prior approval the Administrative Agent.  \n“Architect Contract” means any contract or agreement between the Architect and Craft relating \nto the Leslieville Project, as such agreement may be amended, restated or supplemented as \npermitted hereunder. \n“Architect’s Costs” means the costs incurred by Craft for the services of the Architect in \nconnection with the Work. \n“Beach Remaining Lands” means the remaining lands and premises owned by UC Leslieville \nand/or UC Beach located at 42 Edgewood Avenue, Toronto, Ontario and more particularly \ndescribed in Schedule D hereto under the heading “Beach Remaining Lands”. \n“Beach Sale Process Order” means the sale process order to be granted in the UC \nReceivership Proceedings which will approve, among other things, a sale process for the Beach \nRemaining Lands, as it may be amended, restated or supplemented from time to time, in each \ncase in form and substance satisfactory to the Construction Receiver, Terra Firma, Craft and \nthe Lenders. \n“Builder” has the meaning given to such term in the Craft Construction Contract, which Builder \nif other than Urban Renaissance Inc. shall be subject to the prior approval the Administrative \nAgent. \n“Budgeted Development Costs” means (i) all budgeted costs described as a line item in the \nInitial Development Budget or any subsequent Development Budget, including any Contingency \nAmount of budgeted costs, and (ii) HST. \n“Business Day” means a day of the year, other than a Saturday, Sunday or statutory holiday, \non which the Administrative Agent is open for business at its executive offices in Toronto, \nOntario. \n“Canadian Dollars” and “Cdn. $” mean the lawful money of Canada. \n“Change Funder” has the meaning given thereto in the Craft Construction Contract. \n“Change Orders” has the meaning given thereto in the Craft Construction Contract. \n“City” means City of Toronto. \n",
      "6": "- 3 - \n“CO Work” has the meaning set forth in the TF Cost Overrun Guarantee. \n“Commitment” means, for each Lender with respect to the Credit Facility, the amount specified \nwith respect to such Lender in Schedule B (which will be amended and distributed to all parties \nby the Administrative Agent from time to time following the allocation of the Credit Facility \nbetween the Tranches and as other Persons become Lenders), being the maximum aggregate \namount of Loans that such Lender is obliged to make hereunder, as such amount may be \nreduced from time to time by such Lender’s Applicable Percentage of the amount of any \npermanent repayments, reductions or prepayments required or made hereunder. \n“Condominium Act” means the Condominium Act, R.S.O. 1998, c.19, as amended or \nreplaced from time to time. \n“Condominium Documents” means the Declaration, condominium corporation by-laws (or \nagreements relating thereto), shared facility agreements (if any), insurance trust agreement (if \nany) or other documents relating to the creation and operation of the Leslieville Project. \n“Construction” means the completion of construction of the Leslieville Project in accordance \nwith the Plans and Specifications. \n“Construction Completion” means the date on which: \n(a) \nTotal Performance of the Work has occurred;  \n(b) \nthe Construction Receiver has received all relevant occupancy permits and passed \ninspections required by Governmental Authorities (other than those inspections required \nto be made in respect of work undertaken by purchasers under any New APS) with \nrespect to the Leslieville Project and has satisfied the conditions under all applicable \ndevelopment and planning approvals; \n(c) \nthe Declaration has been registered; and \n(d) \nthe purchase and sale transactions under all New APS have closed. \n“Construction Receiver” means Alvarez & Marsal Canada Inc., in its capacity as Court \nappointed receiver and manager and construction lien trustee of UC Leslieville, UC Beach and \nUC Riverdale. \n“Construction Receiver’s Counsel” means Blake, Cassels & Graydon LLP and Miller \nThomson LLP (in respect of real estate matters) or such other firm of legal counsel as \nConstruction Receiver may from time to time designate and that is acceptable to the Lenders. \n“Construction Receiver’s Reserve” shall have the meaning given to it in the Settlement \nApproval Order. \n“Construction Schedule” means the construction schedule in respect of the Leslieville Project \nprovided to and approved by the Lenders. \n“Consultant Contract” means any contract entered into (i) by or on behalf of Craft, and (ii) a \nConsultant relating to the Leslieville Project.\n",
      "7": "- 4 - \n“Consultants” means, as applicable, the Architect and the Engineers for the Leslieville Project, \nand such other consultants as the Lenders may approve, including as may be identified in \nconnection with any Development Budget. \n“Contingency Amount” means, with respect to any Development Budget, the amount, if any, \nof any contingency provided in such Development Budget in respect of the calculation of the \nDevelopment Costs.\n“Costs” means with respect to any work performed or services to be performed under the Craft \nC&D Contracts, the cost (including HST) of such work or service as agreed between Craft and \nUC Leslieville by the Construction Receiver, including, for greater certainty, the cost of all CO \nWork. \n“Cost Overruns” means all “Cost Overruns” as defined in the TF Cost Overrun Guarantee.  \n“Cost to Complete” means, at any given date and in respect of the Leslieville Project, that \namount established by the Construction Receiver and confirmed by the Independent Cost \nConsultant, which is the aggregate of (without duplication): \n(a) \nthe remaining unpaid portion of the Fixed Price under the Craft Construction Contract;  \n(b) \nall Costs of the CO Work not then incurred; \n(c) \nto the extent Geo-thermal System Costs are being funded by a Craft Loan, all Geo-\nthermal System Costs not then incurred; \n(d) \nthe amount of all Costs of the CO Work incurred, to the extent not paid or prepaid in full \nfrom funds provided to the Construction Receiver by Terra Firma, Craft or the Lenders \nunder or in accordance with the TF Cost Overrun Guarantee; \n(e) \nto the extent Geo-thermal System Costs are being funded by a Craft Loan, the amount \nof all Geo-thermal System Costs incurred, to the extent not paid or prepaid in full from \nCraft Loans advanced to the Construction Receiver to fund Geo-thermal System Costs; \n(f) \nall Holdbacks, as of such date; \n(g) \nthe Development Costs for the remaining Development Services not then incurred;  \n(h) \nthe amount of all Development Costs incurred, to the extent not then paid (i) in the case \nof Cost Overruns, from funds provided to the Construction Receiver by Terra Firma, \nCraft or the Lenders under or in accordance with the TF Cost Overrun Guarantee, and \n(ii) in the case of all other Development Costs incurred, to the extent not then paid, \nexcluding such other Development Costs to be paid from a requested Drawdown which \notherwise fulfils the Drawdown conditions set forth in this Agreement. \n“Court” means the Ontario Superior Court of Justice (Commercial List) supervising the UC \nReceivership Proceedings. \n“CP Outside Date” means July 31, 2017 or such later date as may be agreed among the \nConstruction Receiver, Craft, the Administrative Agent and Terra Firma. \n",
      "8": "- 5 - \n“Craft” means C.R.A.F.T. Development Corporation, a corporation incorporated under the laws \nof the Province of Ontario.  \n“Craft C&D Contracts” means, collectively, the Craft Construction Contract and the Craft \nDevelopment Contract. \n“Craft Cash Collateral” means the cash collateral in the amount of $535,000 provided by Craft \npursuant to the Craft Construction Contract, which cash collateral is to be deposited in an \naccount in the name of the Construction Receiver and maintained with the Administrative Agent. \n“Craft Construction Contract” means the fixed price construction contract dated on or about \nthe date hereof and made between UC Leslieville by the Construction Receiver and Craft for the \nConstruction of the Leslieville Project. \n“Craft Development Contract” means the development contract dated on or about the date \nhereof and made between UC Leslieville by the Construction Receiver and Craft for the \nprovision by Craft of the Development Services with respect to the Leslieville Project. \n“Craft Loan Agreement” means the loan agreement (which shall be in form and substance \nacceptable to the Lenders) dated on or about the date hereof and entered into between Craft \n(as lender) and the Construction Receiver (as borrower) for a loan in the initial principal amount \nof $2,000,000, which loan shall be secured against the Leslieville Project in the priority set out in \nthe Waterfall. \n“Craft Loans” means, at any time, the loans outstanding under the Craft Loan Agreement at \nsuch time, including loans that are deemed to have been advanced under this Agreement \npursuant to the terms of either of the Craft C&D Contracts or the TF Cost Overrun Guarantee. \n“Craft Security” means the Court ordered Encumbrance against the Leslieville Project granted \npursuant to the Settlement Approval Order. \n“Credit Facility” means the credit facility described in Section 2.01 and includes both the FP \nTranche and the Development Tranche, and the ITC Tranche, if otherwise made available in \naccordance herewith. \n“Credit Facility Commitment” means (a) $4,500,000.00, plus (b) if and for so long as the ITC \nCondition exists, an amount up to the ITC Increase.  The Credit Facility Commitment will be \nallocated between the FP Tranche and the Development Tranche, and if made available by the \nLenders, the ITC Tranche, on the date of the first Drawdown under the Credit Facility by \nagreement between the Construction Receiver and the Administrative Agent with the advice of \nthe Independent Cost Consultant, provided that such initial allocation may be subsequently \nreadjusted or reallocated by further agreement between the Construction Receiver and the \nAdministrative Agent with the advice of the Independent Cost Consultant.  \n“Curzon Purchasers” means, collectively, the Opt-In Leslieville Purchasers and the New \nCurzon Purchasers. \n“Debt” means, with respect to any Person, all obligations that, in accordance with GAAP, would \nthen be classified as a liability of such Person, and, without duplication, includes, with respect to \nsuch Person, an obligation in respect of borrowed money or for the deferred purchase price of \n",
      "9": "- 6 - \nProperty or services or an obligation that is evidenced by a note, bond, debenture or any other \nsimilar instrument. \n“Declaration” means the declaration or declarations which, together with the description, shall \nbe registered under the Condominium Act and will subject the Leslieville Project or portion(s) \nthereof to the provisions of the Condominium Act, and all amendments to such declaration or \ndeclarations. \n“Default” has the meaning set out in Schedule A. \n“Defaulted Cost Overruns” has the meaning given thereto in the TF Cost Overrun Guarantee. \n“Deferred Commitment Fee” means the commitment fee payable to the Lenders pursuant to \nSection 4.02 of this Agreement. \n“Development Approvals” has the meaning set forth in the Craft Construction Contract. \n“Development Budget” means, at any time, the then current budget of all Development Costs \nwhich has a line by line itemization of Development Costs including Contingency Amounts, as \nprepared by Craft and agreed by (a) the Construction Receiver, (b) if required hereunder, the \nLenders, (c) the Independent Cost Consultant and (d) if there have been Development Cost \nOverruns from the Initial Development Budget, the Change Funder, including as the context \npermits or requires, the Initial Development Budget; and “current Development Budget” \nmeans the then current Development Budget (if any) prepared and approved as aforesaid which \nreplaces a prior Development Budget.  \n“Development Cost Overruns” has the meaning set forth in the Craft Development Contract. \n“Development Costs” means the actual Costs of the Development Services. \n“Development Services” has the meaning set forth in the Craft Development Contract. \n“Development Tranche” means that portion of the Credit Facility Commitment allocated to fund \nthe Development Costs. \n“Disposition” means, with respect to a Person, any sale, assignment, transfer, conveyance, \nlease, licence or other disposition of any nature or kind whatsoever of any Property or of any \nright, title or interest in or to any Property, and the verb “Dispose” has a corresponding \nmeaning. \n“Drawdown” means the advance of a Prime Rate Loan, and the term “advance” (whether used \nhereunder, and whether used as a verb or noun) means an advance or the advancing of a \nPrime Rate Loan pursuant to a Drawdown. \n“Drawdown Date” means the date on which a Drawdown is made by the Construction \nReceiver pursuant to the provisions hereof. \n“Drawdown Notice” means a notice, substantially in the form set out in Schedule 1.01(A), to \nbe given to the Administrative Agent by the Construction Receiver pursuant to Section 2.03. \n",
      "10": "- 7 - \n“Encumbrance” means, with respect to any Person, any mortgage, debenture, pledge, \nhypothec, lien, charge, assignment by way of security, hypothecation or security interest \ngranted or permitted by such Person or arising by operation of law, in respect of any of such \nPerson’s Property, or any consignment by way of security or capital lease of Property by such \nPerson as consignee or lessee, as the case may be, or any other security agreement, trust or \narrangement having the effect of security for the payment of any debt, liability or other \nobligation, and “Encumbrances”, “Encumbrancer”, “Encumber” and “Encumbered” have \ncorresponding meanings. \n“Engineers” means the structural, mechanical & electrical, geotechnical and environmental, \nand such other engineers as may be retained by or behalf of Craft in connection with the \nConstruction of the Leslieville Project, which engineers if other than the engineers for the \nLeslieville Project retained by UC Leslieville prior to the commencement of the UC Receivership \nProceedings, shall be subject to the prior approval the Administrative Agent. \n“Engineering Contracts” means, collectively, the agreements entered into by or on behalf of \nCraft and the Engineers, as such agreements may be amended, restated or supplemented as \npermitted hereunder.\n“Environmental Law” means any Applicable Law relating to the environment, including those \npertaining to: \n(a) \nreporting, licensing, permitting, investigating, remediating and cleaning up in connection \nwith any presence or Release, or the threat of the same, of Hazardous Substances, and \n(b) \nthe manufacture, processing, distribution, use, treatment, storage, disposal, transport, \nhandling and the like of Hazardous Substances, including those pertaining to \noccupational health and safety. \n“Event of Default” has the meaning set out in Section 9.01. \n“Existing Curzon Purchasers” has the meaning set forth in the Craft Development Contract. \n“Existing Purchaser Deposits” means, with respect to any Opt-In Leslieville Purchaser in \nconnection with a Unit, the deposit(s) actually paid to UC Leslieville (or in the case of such Opt-\nIn Leslieville Purchaser being an assignee of a purchaser under an agreement of purchase and \nsale with UC Leslieville for such Unit, actually paid to the assignor) under its original agreement \nof purchase and sale with UC Leslieville for such Unit. \n“Existing Syndicate Credit Agreement” means the credit agreement made as of July 13, 2012 \nbetween UC Leslieville (as borrower), Alan Saskin, Urbancorp Toronto Management Inc., UC \nRiverdale and UC Beach (as guarantors), Canadian Imperial Bank of Commerce (as \nadministrative agent and a lender), Laurentian Bank of Canada (as a lender) and Canadian \nWestern Bank (as a lender), as amended and supplemented from time to time. \n“Existing Syndicate Debt” means all debts and liabilities owing by UC Leslieville, UC Riverdale \nand/or UC Beach to the Lenders pursuant to the Existing Syndicate Credit Agreement. \n“Existing Syndicate Security” means all Encumbrances granted by UC Leslieville, UC \nRiverdale, UC Beach or any other Person as security for the Existing Syndicate Debt. \n",
      "11": "- 8 - \n“First Advance Date” means that date which is 150 days after the first advance of the Craft \nLoans or such later date as may be agreed in writing by the Required Lenders. \n“Fixed Price” means the sum of $5,350,000 plus HST being the fixed price agreed by Craft to \nperform the work and services under the Craft Construction Contract other than the CO Work. \n“Force Majeure” has the meaning set forth in the Development Contract. \n“FP Tranche” means that portion of the Credit Facility Commitment allocated to fund the Fixed \nPrice under the Craft Construction Contract. \n“GAAP” means those accounting principles that are from time to time approved by the \nCanadian Institute of Chartered Accountants, or any successor institute. \n“Geo-thermal System Costs” has the meaning set forth in the Craft Construction Contract. \n“Geo-thermal System” has the meaning set forth in the Craft Construction Contract. \n“Governmental Authority” has the meaning set out in Schedule A. \n“Gross Sale Proceeds” means, with respect to a New APS, (a) the gross sale price (inclusive \nof net HST payable in respect of such New APS) set out in such New APS less (b) in the case \nof an Opt-In Leslieville Purchaser, the amount of credit for its Existing Purchaser Deposit set out \nin such New APS. \n“Hazardous Substance” means any substance or material that is prohibited, controlled or \nregulated by any Governmental Authority pursuant to Environmental Law, including pollutants, \ncontaminants, dangerous goods or substances, toxic or hazardous substances or materials, \nwastes (including solid non-hazardous wastes and subject wastes), petroleum and its \nderivatives and by-products and other hydrocarbons, all as defined in or pursuant to any \nEnvironmental Law. \n“Holdback” means any amount required to be retained by or on behalf of UC Leslieville by the \nConstruction Receiver, in respect of the value of work, services and materials actually done, \nperformed, placed or furnished on or in the Leslieville Project in accordance with the \nConstruction Lien Act (Ontario). \n“HST” means the harmonized sales tax under the Excise Tax Act (Canada). \n“Independent Cost Consultant” means Altus Group Limited, or such other replacement \nconsultant appointed by the Construction Receiver. \n“Independent Cost Consultant’s Certificate” means the certificate attached as Schedule \n1.01(1)(D) hereto. \n “Initial Development Budget” means the Development Budget agreed between Craft, the \nConstruction Receiver, the Required Lenders, the Independent Cost Consultant and Terra \nFirma as the Initial Development Budget under the Craft Development Contact, a copy of which \nis attached hereto as Schedule 1.01(B). \n",
      "12": "- 9 - \n“Insolvent” means, with respect to any Person, that such Person (a) has committed an “act of \nbankruptcy”, has admitted in writing that it is unable to pay its debts as they become due, or has \nbecome insolvent, (b) has made any assignment in bankruptcy or made any other assignment \nfor the benefit of creditors, has made any proposal under the Bankruptcy and Insolvency Act\n(Canada) or any comparable law, (c) has sought relief under the Bankruptcy and Insolvency Act\n(Canada), the Companies’ Creditors Arrangement Act (Canada), the United States Bankruptcy \nCode, the Winding-up and Restructuring Act (Canada) or any other bankruptcy, insolvency or \nanalogous law, (d) has been adjudged bankrupt, has filed a petition or proposal to take \nadvantage of any act of insolvency, has consented to or acquiesced in the appointment of a \ntrustee, receiver, receiver and manager, interim receiver, custodian, sequestrator or other \nPerson with similar powers of itself or of all or any substantial portion of its assets, or has filed a \npetition or otherwise commenced any proceeding seeking any reorganization, arrangement, \ncomposition or readjustment under any applicable bankruptcy, insolvency, moratorium, \nreorganization or other similar law affecting creditors’ rights or has consented to, or acquiesced \nin, the filing of such a petition or proposal.\n“Interbank Reference Rate” means the interest rate expressed as a percentage per annum\nthat is customarily used by the Administrative Agent when calculating interest due by it or owing \nto it arising from adjustments between the Administrative Agent and other Canadian chartered \nbanks. \n“ITC Condition” means the continuance in effect on the date hereof or from time to time after \nthe date hereof of any prior exercise of rights of set-off (or similar rights) by the Canada \nRevenue Agency against any one or more of UC Riverdale, UC Leslieville or UC Beach in \nrespect of accumulated input tax credits (i) otherwise due to or standing to the credit of UC \nRiverdale, UC Leslieville or UC Beach and (ii) which have been claimed or are claimable by the \nConstruction Receiver, including in the context of the UC Receivership Proceedings, which has \nnot been reversed or waived by the Canada Revenue Agency thereby permitting the application \nof such input tax credits to reduce tax otherwise payable by UC Riverdale, UC Leslieville or UC \nBeach and/or the Construction Receiver. \n“ITC Increase” means $0.00 (Nil). \n“ITC Tranche” means that portion of the Credit Facility Commitment available to the \nConstruction Receiver hereunder and designated as the ITC Tranche by the Lenders; provided \nthat the ITC Condition exists on the date hereof, but only if and for so long as the ITC Condition \ncontinues. \n“Latent Defect” has the meaning ascribed thereto in the Craft Construction Contract. \n“Lenders” means the Persons from time to time party to this Agreement and identified as a \nLender, in Schedule B, and “Lender” means any one of the Lenders. \n“Lenders’ Counsel” means the firm of Gowling WLG (Canada) LLP or such other firm of legal \ncounsel as the Administrative Agent may from time to time designate. \n“Lending Office” means, with respect to a particular Lender, the branch or office specified in \nSchedule B from which such Lender makes advances and to which the Administrative Agent \ndisburses payments received for the benefit of such Lender. \n“Leslieville Project” means the “Project” as defined under the Craft Construction Contract. \n",
      "13": "- 10 - \n“Leslieville Project Lands” means the lands and premises comprising the Leslieville Project \nsite located at 50 Curzon Street, Toronto, Ontario and more particularly described in Schedule \nC hereto under the heading “Leslieville Project Lands”. \n“List Price” has the meaning set forth in the Craft Development Contract. \n“Loan” has the meaning set out in Schedule A, but also includes all advances deemed to be \nmade hereunder by the Lenders to fund Cost Overruns under the TF Cost Overrun Guarantee. \n“Loan Disbursement Account” has the meaning set forth in the Craft Development Contract. \n“Loan Documents” means (a) this Agreement, (b) the Security, and (c) all present and future \nagreements, documents, certificates and instruments delivered by the Construction Receiver to \nthe Administrative Agent or the Lenders pursuant to or in respect of this Agreement or the \nSecurity, in each case as the same may from time to time be amended, and “Loan Document”\nmeans any one of the Loan Documents. \n“Marketing Plan” has the meaning set forth in the Craft Development Contract. \n“Material Project Agreements” means: \n(a) \nthe Craft C&D Contracts; \n(b) \nthe TF Cost Overrun Guarantee; \n(c) \nany Architect Contract and any Engineering Contracts and all other Consultant Contracts \nthat provide for aggregate payments thereunder in excess of $250,000; \n(d) \nall subcontracts that provide for aggregate payments in excess of $250,000, including \nany subcontract between Craft and the Builder; \n(e) \nthe Plans and Specifications and all planning approvals, permits, licences, development \nagreements, and other material contracts with respect to the Leslieville Project \ndesignated as Material Project Agreements by the Administrative Agent from time to \ntime, provided that the Administrative Agent has notified the Construction Receiver of \nsuch designation, \n“New APS” means each purchase and sale agreement for a Unit entered into and outstanding \nbetween UC Leslieville by the Construction Receiver and a Curzon Purchaser substantially in \nthe form of a Standard Form Sales Agreement. \n“New Curzon Purchasers” means, collectively, the Persons that are purchasers of Units in the \nLeslieville Project after the date hereof, other than the Opt-In Leslieville Purchasers. \n“Obligations” means all obligations of the Construction Receiver to the Administrative Agent, \nthe Lenders, or any of them, under or in connection with this Agreement or the other Loan \nDocuments, including all debts and liabilities, present or future, direct or indirect, absolute or \ncontingent, matured or not, at any time owing by the Construction Receiver to the Administrative \nAgent or the Lenders, or any of them, in any currency or remaining unpaid by the Construction \nReceiver to the Administrative Agent or the Lenders, or any of them, under or in connection with \nthis Agreement or the other Loan Documents whether arising from dealings between the \n",
      "14": "- 11 - \nAdministrative Agent or the Lenders, or any of them, and the Construction Receiver, or from any \nother dealings or proceedings by which the Administrative Agent or the Lenders, or any of them, \nmay be or become in any manner whatsoever a creditor or obligee of the Construction Receiver \npursuant to this Agreement or the other Loan Documents, and wherever incurred, and whether \nincurred by the Construction Receiver alone or with another or others and whether as principal \nor surety, and all interest, fees, legal and other costs, charges and expenses relating thereto. \n“Operating Budget” means an “Approved Operating Budget” as defined in the Craft \nDevelopment Contract; provided that the initial Operating Budget shall be subject to the review \nand approval of the Required Lenders and any amendments thereto shall be subject to the \napproval of the Required Lenders to the extent required hereunder. \n“Operating Manager” means First Service Residential or such other residential condominium \nproperty manager as may be approved by the Administrative Agent.  \n“Operating Phase” means the period commencing on the interim occupancy of any of the Units \nto closing of the purchase and sale of the last of the Units. \n“Opt-In Leslieville Purchasers” has the meaning set out in the Settlement Approval Order as \nof the date it was granted. \n“Outside Date” has the meaning given thereto in the Craft Construction Contract, as such date \nmay be extended from time to time in accordance with the Craft Construction Contract.  \n“Permitted Debt” means: \n(a) \nthe Debt under this Agreement; \n(b) \nthe Craft Loan up to a maximum principal amount of $2,000,000, except as such \nmaximum principal amount may be increased as contemplated under the Settlement \nApproval Order in order to cover additional principal advances to be made by Craft in \nconnection with (i) the Geo-Thermal Costs, and (ii) without duplication of clause (g) \nbelow, the funding of TF Defaulted Cost Overruns under and in accordance with the \nprovisions of the TF Cost Overrun Guarantee; \n(c) \nliabilities due and payable to Craft from time to time under the terms of the Craft C&D \nContracts; \n(d) \nthe Existing Syndicate Debt;  \n(e) \nthe Debt of UC Leslieville owing under the Travelers Agreements and Travelers \nMortgage;  \n(f) \nthe Debt of UC Leslieville, UC Riverdale and UC Beach owing to Terra Firma on or prior \nto the date hereof and secured under the mortgage granted by UC Leslie in favour of \nTerra Firma registered against the Leslieville Project Lands on July 22, 2015; \n(g) \nadditional debt incurred by the Construction Receiver to cover TF Defaulted Cost \nOverruns or Defaulted Cost Overruns under and in accordance with the provisions of the \nTF Cost Overrun Guarantee;  \n",
      "15": "- 12 - \n(h) \nany other Debt owed by the Construction Receiver to the Lenders; \n(i) \nany liabilities secured by the Receiver’s Expense Reimbursement Charge; \n(j) \nany liabilities secured by the Receiver’s Borrowings Charge and the Construction Lien \nTrustee’s Borrowing Charge (as each term is set forth in Section 22 of the Receivership \nOrder), including as Section 22 may be varied by order of the Court in the UC \nReceivership Proceedings; \n(k) \nany additional Craft Loans to fund Geo-Thermal Costs, to the extent permitted under and \nmade pursuant to the terms of the Settlement Approval Order; and   \n(l) \nany other Debt which is approved by the Court in the UC Receivership Proceedings. \n“Permitted Encumbrances” means, with respect to the Leslieville Project Lands, the following: \n(a) \nall Encumbrances existing as of the date of the Receivership Order, including the \nExisting Syndicate Security; \n(b) \nall Court ordered charges granted under the Receivership Order; \n(c) \nall Court ordered charges granted under the Settlement Approval Order including the \nSecurity and the Craft Security; and \n(d) \nsuch other Encumbrances which are approved by the Court in the UC Receivership \nProceedings. \n“Person” has the meaning set out in Schedule A. \n“Plans and Specifications” means the plans and specifications pertaining to the development \nand construction of the Leslieville Project as listed in Schedule “A” to the Craft Construction \nContract as of the date hereof. \n“Prime Rate” means the variable per annum reference rate of interest announced and adjusted \nby the Administrative Agent from time to time for Canadian Dollar loans in Canada.\n“Prime Rate Loan” means a Loan in Canadian Dollars made by the Lenders to the \nConstruction Receiver with respect to which interest is calculated by reference to the Prime \nRate. \n“Prime Rate Margin” means 5% per annum. \n“Proceeds for Distribution” has the meaning set forth in Section 5.01(2).\n“Proforma Sale Price” means, in respect of any Unit that is not subject to an Opt-In Purchase \nAgreement, the Minimum Unit Price for such Unit as defined in the Craft Development Contract \nwhich has been approved by the Required Lenders. \n“Project Status Certificate” means the certificate attached as Schedule 1.01(1)(C) hereto.\n“Property” means, with respect to any Person, all or any portion of that Person’s undertaking \nand property, both real and personal. \n",
      "16": "- 13 - \n“Purchaser Deposits” means, collectively: \n(a) \nthe additional deposits paid by each of the Opt-In Leslieville Purchasers pursuant to its \nNew APS; \n(b) \nthe deposits paid by each New Curzon Purchaser pursuant to its New APS, \nbut for greater certainty does not include Existing Purchaser Deposits. \n“Purchaser Information Package” has the meaning given to it in the Purchaser Package \nApproval Order. \n“Purchaser Package Approval Order” means the order to be granted in the UC Receivership \nProceedings which will approve, among other things, form(s) of purchase and sale agreement \nfor sale of Units by UC Leslieville by the Construction Receiver and the disclosure statement \nrequired under the Condominium Act to be provided by the Construction Receiver to all Existing \nCurzon Purchasers, as such order may be varied from time to time with the prior written consent \nof the Construction Receiver and the Syndicate Lenders under the Syndicate Credit Agreement. \n“Receivership Administration Order” means the receivership administration order to be \ngranted in the UC Receivership Proceedings which will approve, among other things, an \nincrease of borrowings by the Construction Receiver required in connection with the \narrangements among UC Leslieville, the Construction Receiver, Craft, the Lenders, Terra Firma \nand the Existing Curzon Purchasers represented by Dickinson Wright LLP to be approved by \nthe Settlement Approval Order, as it may be amended, restated or supplemented from time to \ntime, in each case in form and substance satisfactory to the Construction Receiver and the \nSyndicate; \n“Receivership Order” means the order of the Honourable Mr. Justice Newbould granted on \nMay 31, 2016 in the UC Receivership Proceedings which, among other things, appointed \nAlvarez & Marsal Canada Inc. as the receiver and manager and construction lien trustee of all of \nthe property, assets and undertakings of each of UC Leslieville, UC Riverdale and UC Beach \nacquired for, or used in relation to, their respective businesses, as the same may be amended, \nrestated or supplemented from time to time. \n“Receiver’s Expense Reimbursement Charge” means the “Construction Receiver’s Charge” \nas defined in Section 19 of the Receivership Order. \n“Release” means any release or discharge of any Hazardous Substance including any \ndischarge, spray, injection, inoculation, abandonment, deposit, spillage, leakage, seepage, \npouring, emission, emptying, throwing, dumping, placing, exhausting, escape, leach, migration, \ndispersal, dispensing or disposal. \n“Required Lenders” means (i) if no Loans are outstanding under this Agreement, the Lenders \nholding at least 66 2/3% of the aggregate amount of Commitments, (ii) if any Loans are \noutstanding under this Agreement, the Lenders to which an amount in aggregate equal to at \nleast 66 2/3% of such Loans is owed, and (iii) where there are only two Lenders, both such \nLenders. \n“Security” means, collectively: \n",
      "17": "- 14 - \n(a) \nthe Encumbrances created in favour of the Lenders pursuant to the Settlement Approval \nOrder as security for the Obligations; and \n(b) \nthe documents creating any Encumbrance in favour of, or any collateral held from time \nto time by, the Lenders or on behalf of the Lenders by the Administrative Agent, in each \ncase as security for the Obligations. \nincluding all security described in Article 8. \n“Settlement Approval Order” means the order to be granted by the Ontario Court of Justice \n(Commercial List) in the UC Receivership Proceedings which will approve the arrangements \namong UC Leslieville, the Construction Receiver, Craft, the Lenders, Terra Firma and the \nExisting Curzon Purchasers represented by Dickinson Wright LLP with respect to the Leslieville \nProject, as it may be amended, restated or supplemented from time to time, in each case in \nform and substance satisfactory to those parties. \n“sole and absolute discretion” means in the sole, absolute and subjective discretion of the \nrelevant Person, which discretion may be exercised unreasonably. \n“Standard Form Sales Agreement” means the standard form agreements of purchase and \nsale to be utilized in respect of the sale of the Units to the Opt-In Leslieville Purchasers and \nNew Curzon Purchasers, respectively, in each case as approved pursuant to the Purchaser \nPackage Approval Order and/or the Settlement Approval Order, respectively. \n“Substantial Performance of the Work” has the meaning set forth in the Craft Construction \nContract. \n“Tarion” means Tarion Warranty Corporation, its successors and assigns. \n“Tarion Home Warranty Program” means the applicable warranty program operated by Tarion \nrelating to purchasers of the Units. \n“Tarion/Travelers Settlement Acknowledgements” means the acknowledgements and/or \nagreements provided by each of Tarion and Travelers with respect to warranty and deposit \ninsurance coverage for the Existing Curzon Purchasers and New Curzon Purchasers, in form \nand substance satisfactory to the Construction Receiver, Craft, the Lenders, Terra Firma and \nthe Existing Curzon Purchasers represented by Dickinson Wright LLP. \n“Taxes” has the meaning set out in Schedule A. \n“Terra Firma” means Terra Firma Capital Corporation, a corporation incorporated under the \nlaws of the Province of Ontario.  \n“TF Cost Overrun Guarantee” means the cost overrun and completion guarantee dated on or \nabout the date hereof and provided by Terra Firma to the Construction Receiver, the \nAdministrative Agent on behalf of the Lenders and Craft. \n“TF Defaulted Cost Overruns” has the meaning given thereto in the TF Cost Overrun \nGuarantee. \n“Total Performance of the Work” has the meaning set forth in the Craft Construction Contract. \n",
      "18": "- 15 - \n“Tranches” means, collectively, the FP Tranche and the Development Tranche, and if made \navailable by the Lenders, the ITC Tranche, and “Tranche” shall mean either one of them. \n“Travelers” means Travelers Guarantee Company of Canada, or its successors or assigns as \nthe surety for bonds and/or excess deposit insurance issued to Tarion Warranty Corporation \nand/or Existing Curzon Purchasers pursuant an agreement of purchase and sale in respect of \nthe Leslieville Project for the deposits made by such purchasers thereunder. \n“Travelers Agreements” mean the agreements entered into between Travelers and UC \nLeslieville in respect of, inter alia, the Existing Purchaser Deposits for the Leslieville Project, \nbonds issued in respect thereof and/or excess deposit insurance.\n“Travelers Mortgage” means the subordinate mortgage granted by UC Leslieville in favour of \nthe Travelers as collateral security for the obligations of UC Leslieville to Travelers pursuant to \nthe Travelers Agreements (such mortgage constituting an Encumbrance ranking behind the \nExisting Syndicate Security on the Leslieville Project Lands and a first priority Encumbrance on \nExisting Purchaser Deposits).\n“UC Beach” means Urbancorp (The Beach) Developments Inc. \n“UC Leslieville” means Urbancorp (Leslieville) Developments Inc. \n“UC Receivership Proceedings” means the receivership proceedings commenced in the \nOntario Superior Court of Justice [Commercial List] under Court File No. CV-16-11409-00CL \npursuant to which Alvarez & Marsal Canada Inc. was appointed as receiver and manager and \nas construction lien trustee of all of the assets, undertakings, and property acquired for, or used \nin relation to the business of UC Leslieville, UC Riverdale and UC Beach. \n“UC Riverdale” means Urbancorp (Riverdale) Developments Inc. \n“Unit” means either (i) a “unit” (as defined in the Condominium Act) comprising part of the \nLeslieville Project for use as a residence or (ii) any freehold portion of the Beach Remaining \nLands or the Leslieville Project (whether severed or intended to be severed) to be sold to a \npurchaser for use as a residence, together with the common and exclusive use interests \nappurtenant thereto, as applicable.  \n“Upgrades” means, with respect to any New Curzon Purchaser, any upgrades, betterments or \nsupplements to the standard finishes for such Curzon Purchaser’s Unit beyond those standard \nfinishes which are described in or otherwise contemplated under the terms of such Curzon \nPurchaser’s New APS. \n“Waterfall” means the scheme of distribution and allocation of proceeds from the sale of Units \nand other property of UC Leslieville and UC Beach as set out in the Settlement Approval Order. \n1.02 \nExtended Meanings \nIn this Agreement words importing the singular number include the plural and vice versa, \nand words importing any gender include all genders. The term “including” means “including \nwithout limiting the generality of the foregoing” and the term “third party” means any Person \nother than a Person who is a party to this Agreement.  Any definition of or reference to any \nagreement, instrument, order or other document herein (including this Agreement) shall be \n",
      "19": "- 16 - \nconstrued as referring to such agreement, instrument, order or other document as from time to \ntime amended, supplemented, restated or otherwise modified (subject to any restrictions on \nsuch amendments, supplements, restatements or modifications set forth herein).  \n1.03 \nInterest Calculations and Payments \nUnless otherwise stated, wherever in this Agreement reference is made to a rate of \ninterest “per annum” or a similar expression is used, such interest will be calculated on the basis \nof a calendar year of 365 days, and using the nominal rate method of calculation and not the \neffective rate method of calculation or on any other basis that gives effect to the principle of \ndeemed reinvestment of interest. Interest will continue to accrue after maturity and default \nand/or judgment, if any, until payment thereof, and interest will accrue and be compounded \nmonthly on overdue interest, if any. \n1.04 \nPermitted Encumbrances \nThe inclusion of reference to Permitted Encumbrances in any Loan Document is not \nintended to subordinate and will not subordinate, any Encumbrance created by any of the \nSecurity to any Permitted Encumbrance. \n1.05 \nTime of the Essence \nTime shall be of the essence of this Agreement \n1.06 \nCurrency \nUnless otherwise specified in this Agreement, all references to currency (without further \ndescription) are to lawful money of Canada. \n1.07 \nConflicts \nIn the event of a conflict between the provisions of this Agreement and the provisions of \nany other Loan Document, then, unless such Loan Document or an acknowledgement from the \nConstruction Receiver and the Administrative Agent relative to such Loan Document expressly \nstates that this Section 1.07 is not applicable to such Loan Document, notwithstanding anything \nelse contained in such other Loan Document, the provisions of this Agreement will prevail and \nthe provisions of such other Loan Document will be deemed to be amended to the extent \nnecessary to eliminate such conflict. \n1.08 \nNature of Lenders’ Obligations \n(1) \nThe obligations of each Lender and the Administrative Agent under this \nAgreement are several. The failure of any Lender to carry out its obligations \nhereunder shall not relieve the other Lenders, the Administrative Agent or the \nConstruction Receiver of any of their respective obligations hereunder. \n(2) \nNeither the Administrative Agent nor any Lender shall be responsible for the \nobligations of any other Lender hereunder. \n",
      "20": "- 17 - \n1.09 \nLimitation of Recourse against Construction Receiver \nNotwithstanding any other provision of this Credit Agreement or any other agreement by \nor among the Construction Receiver and the Administrative Agent and the Lenders, Alvarez & \nMarsal Canada Inc. shall have no personal or corporate liability under this Agreement or any of \nthe other Loan Documents. All obligations of the Construction Receiver, whether on behalf of \nUC Leslieville or its own behalf,  under or in connection with the Credit Facility established \nunder this Agreement and the other Loan Documents are undertaken by Alvarez & Marsal \nCanada Inc. solely in its capacity as the Court Appointed Receiver and Manager and \nConstruction Lien Trustee of UC Leslieville, UC Beach and UC Riverdale, and save and except \nin the case of the gross negligence or willful misconduct of Alvarez & Marsal Canada Inc., as \ndetermined by a court of competent jurisdiction, the sole recourse of the Lender against UC \nLeslieville, UC Beach, UC Riverdale or the Construction Receiver in connection with such \nobligations shall be limited solely to a claim against the proceeds of the property and assets of \nUC Leslieville, UC Beach and/or UC Riverdale.\n1.10 \nSchedules \nThe following are the Schedules attached hereto and incorporated by reference and \ndeemed to be part hereof: \nSchedule A \n- \nModel Credit Agreement Provisions \nSchedule B \n- \nLenders and Commitments \nSchedule C \n- \nLegal Description of Project Lands  \nSchedule 1.01(A) \n- \nDrawdown Notice \nSchedule 1.01(B) \n- \nInitial Development Budget \n0 \n- \nProject Status Certificate \n0 \n- \nIndependent Cost Consultant’s Certificate \nARTICLE 2 \nTHE CREDIT FACILITY \n2.01 \nCredit Facility \n(1) \nSubject to the terms and conditions of this Agreement, the Lenders establish in \nfavour of the Construction Receiver a non-revolving, term credit facility (the \n“Credit Facility”) in an amount up to the Credit Facility Commitment which is \navailable to the Construction Receiver by way of Prime Rate Loans.  Each \nLender’s obligation under the Credit Facility is several and limited to the amount \nof its Commitment. \n(2) \nThe Credit Facility shall be divided into the FP Tranche and the Development \nTranche, and if made available by the Lenders, the ITC Tranche, and the Credit \nFacility Commitment shall be allocated between the Tranches by agreement \nbetween the Construction Receiver and the Administrative Agent, based on the \nadvice of the Independent Cost Consultant as of the date of the first Drawdown \nunder the Credit Facility; provided that such initial allocation between the \n",
      "21": "- 18 - \nTranches may be subsequently readjusted or reallocated by further agreement \nbetween the Construction Receiver and the Administrative Agent upon further \nadvice of the Independent Cost Consultant. The Administrative Agent shall \nprovide written confirmation to the Construction Receiver and each of the \nLenders as soon as practicable following such agreed allocation, adjustment or \nreallocation.  \n(3) \nIf the first advance under the Credit Facility does not occur on or before the First \nAdvance Date, the Required Lenders may, in their sole and absolute discretion, \ncancel the Credit Facility, in which event, the Lenders will have no further \nobligation to make Drawdowns available to the Construction Receiver under the \nCredit Facility.  In addition, at any time after that date which is 30 days after (a) \nthe earlier of Total Completion of the Work and completion of the Development \nServices and (b) the Outside Date (or such later date as may be agreed in writing \nby the Required Lenders), the Required Lenders may, in their sole and absolute \ndiscretion, cancel all or any unutilized portion of the Commitment. \n2.02 \nPurpose of Credit Facility \nLoans made under the Credit Facility will only be used by the Construction Receiver for \nthe following purposes: \n(1) \nwith respect to the FP Tranche, to finance the Fixed Price payable to Craft under \nthe Craft Construction Contract; and \n(2) \nwith respect to the Development Tranche, to finance the payment of the \nBudgeted Development Costs set out in the Initial Development Budget agreed \npursuant to the Craft Development Contract. \n2.03 \nDrawdowns \n(1) \nSubject to the provisions of this Agreement, including without limitation Sections \n3.01 and 3.02, the Construction Receiver may make Drawdowns hereunder by \ngiving the Administrative Agent a Drawdown Notice at least three Business Days \nprior to the proposed Drawdown Date. A Drawdown Date must be a Business \nDay. \n(2) \nEach Drawdown Notice must be delivered to the Administrative Agent by the \nConstruction Receiver on or prior to 11:00 a.m. (Toronto time) on a Business \nDay. \n(3) \nEach Drawdown must be in a minimum principal amount of Cdn. $100,000 and \nincrements of Cdn. $50,000. \n(4) \nUnless otherwise agreed to by the Lenders, the Construction Receiver will not be \nentitled to make Drawdowns more than once each calendar month. \n(5) \nNo Drawdown under the ITC Tranche may be made after the ITC Condition has \nceased. \n",
      "22": "- 19 - \n2.04 \nAdministrative Agent’s Obligations with Respect to Loans \nUpon receipt of a Drawdown Notice, the Administrative Agent will forthwith notify the \nLenders of the proposed Drawdown Date, of each Lender’s Applicable Percentage of such Loan \nand, if applicable, the account of the Administrative Agent to which each Lender’s Applicable \nPercentage is to be credited. \n2.05 \nLenders’ and Administrative Agent’s Obligations with Respect to Loans \nEach Lender will, prior to 11:00 a.m. (Toronto time) on the Drawdown Date specified by \nthe Construction Receiver in a Drawdown Notice credit the Administrative Agent’s account \nspecified in the Administrative Agent’s notice given under Section 2.04 with such Lender’s \nApplicable Percentage of any Loan to be advanced thereunder and by 11:00 a.m. (Toronto \ntime) on the same date the Administrative Agent will advance to the Construction Receiver the \nfull amount of the amounts so credited.  \n2.06 \nIrrevocability \nEach Drawdown Notice given by the Construction Receiver hereunder is irrevocable and \nwill oblige the Construction Receiver to make the Drawdown contemplated on the date specified \ntherein. \n2.07 \nAccount of Record \nThe Administrative Agent will open and maintain books of account evidencing all Loans \nand all other amounts owing by the Construction Receiver to the Lenders hereunder. The \nAdministrative Agent will enter in the foregoing books of account details of all amounts from time \nto time owing, paid or repaid by the Construction Receiver hereunder. The information entered \nin the foregoing books of accounts will, in the absence of manifest error, constitute prima facie \nevidence of the obligations of the Construction Receiver to the Lenders hereunder with respect \nto all Loans and all other amounts owing by the Construction Receiver to the Lenders \nhereunder. After a request by the Construction Receiver, the Administrative Agent will promptly \nadvise the Construction Receiver of such entries made in the Administrative Agent’s books of \naccount. \n2.08 \nInterest on Excess Loans, Unpaid Costs and Expenses \nUnless the payment of interest is otherwise specifically provided for herein, where the \nConstruction Receiver fails to pay any amount required to be paid by it hereunder when due, \nafter having received notice that such amount is due (including, without limitation, the portion of \nany Loan made under a Credit Facility hereunder that exceeds the applicable Credit Facility \nCommitment), the Construction Receiver shall pay interest on such unpaid amount from the \ntime such amount is due until paid at an annual rate equal to the Prime Rate plus 7.0% per \nannum in accordance withy Section 5.01. \n",
      "23": "- 20 - \nARTICLE 3 \nDISBURSEMENT CONDITIONS \n3.01 \nConditions Precedent to First Drawdown \nThe obligations of each Lender under this Agreement (including to make the first \nadvance under the Credit Facility) are subject to and conditional upon the prior satisfaction of \nthe following conditions precedent: \n(1) \neach of the Craft C&D Contracts shall have been executed and delivered to the \nConstruction Receiver in form and substance satisfactory to the Lenders and be \nin full force and effect; \n(2) \nthe schedule of values for progress payments and the construction schedule \nunder the Craft Construction Contract shall have been approved by the \nIndependent Cost Consultant and the Lenders; \n(3) \n(i) Craft shall have delivered the Craft Cash Collateral to the Construction \nReceiver as required under the Craft Development Contract and the same shall \nhave been deposited in the name of the Construction Receiver in an account \nmaintained with the Administrative Agent, and (ii) the Loan Disbursement \nAccount shall have been established; \n(4) \nthe TF Cost Overrun Guarantee shall have been executed and delivered to the \nConstruction Receiver, Craft and the Administrative Agent on behalf of the \nLenders in form and substance satisfactory to the Lenders and be in full force \nand effect;  \n(5) \nthe Craft Loan Agreement shall have been executed and delivered to the \nConstruction Receiver in form and substance satisfactory to the Lenders and be \nin full force and effect, and the Craft Loan shall have been fully advanced to the \nConstruction Receiver; \n(6) \nthe Craft Loan shall have been fully disbursed by the Construction Receiver to \nfund progress draws or payments under the Craft C&D Contracts; \n(7) \neach of the Purchaser Package Approval Order, the Settlement Approval Order, \nthe Beach Sales Process Order and the Receivership Administration Order shall \nhave been granted, the “Effective Date” (as defined in the Settlement Approval \nOrder) shall have occurred and each of such orders shall be final and non-\nappealable and if any such orders are appealed, such appeal is withdrawn or \ndetermined in favour of the Construction Receiver; \n(8) \nnone of the Receivership Order, the Purchaser Package Approval Order, the \nSettlement Approval Order, the Beach Sales Process Order or the Receivership \nAdministration Order or any provision of any of them shall have been stayed, \nvaried or vacated without the prior written consent of the Lenders and the \nConstruction Receiver and there shall not be any pending motion to do so; \n",
      "24": "- 21 - \n(9) \nTarion \nand \nTravelers \nshall \nhave \nprovided \nthe \nTarion/Travelers \nAcknowledgements, or the Court shall have made an Order of like effect, in \neither case, in form and substance satisfactory to the Lenders;  \n(10) \nthe Standard Form Sales Agreement to be entered into with each Curzon \nPurchaser and the disclosure statement required to be delivered to each Curzon \nPurchaser under the Condominium Act shall have been approved by the Court \npursuant to the Purchaser Package Approval Order and the Settlement Approval \nOrder, as applicable, and the Court shall have confirmed the last date upon \nwhich an Opt-In Leslieville Purchaser may rescind its New APS to purchase a \nUnit in the Leslieville Project pursuant to Section 73(2) of the Condominium Act; \n(11) \nthe Independent Cost Consultant shall have been appointed to act on behalf of \nthe Construction Receiver throughout the duration of the Leslieville Project; \nprovided that the Construction Receiver acknowledges and agrees that Altus \nGroup Limited will also be acting as the Independent Cost Consultant under this \nAgreement for the Lenders notwithstanding any actual or potential conflict \noccasioned thereby; \n(12) \nthe Initial Development Budget shall have been approved by the Independent \nCost Consultant, the Lenders and Terra Firma; \n(13) \nTerra Firma shall have funded to the Construction Receiver the (a) cost of all \nLatent Defects discovered by Craft, the Construction Receiver or any other \nPerson relating to the Leslieville Project as of the date the other conditions \nprecedent under this Section 3.01 have been satisfied, (b) amount of all \n“Development Cost Overruns” (as defined in the Craft Development Contract) \nrequested by Craft as of the date the other conditions precedent under this \nSection 3.01 have been satisfied, in each case as required under the TF Cost \nOverrun Guarantee, and for certainty, inclusive of HST;  \n(14) \n(i) no Major Event of Default (as defined under each of the Craft C&D Contracts) \nor any material breach under any of the other Material Project Agreements shall \nhave occurred (and no event of default shall have occurred thereunder), and \nshall in any case, be continuing on the Drawdown Date, and (ii) neither of the \nCraft C&D Contracts shall have been terminated by either party thereto, including \nas a result of any breach, default or event of default thereunder; \n(15) \nnone of Craft, the Builder or Terra Firma shall be Insolvent; \n(16) \nno Cost Overrun discovered after the date of this Agreement shall be existing \nwhich has not been funded by Terra Firma, Craft or the Lenders under the TF \nCost Overrun Guarantee; \n(17) \nthe Administrative Agent will have received a Drawdown Notice in accordance \nwith Section 2.03(1) and (2); \n(18) \nno Default or Event of Default will have occurred and be continuing on the \nDrawdown Date, or would result from making the requested advance; \n",
      "25": "- 22 - \n(19) \nall conditions precedent to the progress draw or payment under the applicable \nCraft C&D Contract proposed to be funded from the Drawdown shall have been \nsatisfied and that Craft is entitled to such progress draw or payment under such \nCraft C&D Contract; \n(20) \nall Geo-thermal System Costs incurred by Craft have been paid when due and \npayable; \n(21) \nafter giving effect to the Drawdown: \n(a) \nin the case of a Drawdown under the FP Tranche, the Cost to Complete \nshall not exceed (i) the undrawn Credit Facility Commitment allocated to \nthe FP Tranche, (ii) the funding previously received and then currently \nheld by the Construction Receiver for Cost Overruns under the Craft \nConstruction Contract provided by Terra Firma, Craft or the Lenders \nunder the TF Cost Overrun Guarantee; and (iii) if the Geo-thermal System \nCosts are being funded through a Craft Loan, the amount of Craft Loans \nreceived and then currently held by the Construction Receiver to fund \nGeo-thermal System Costs; \n(b) \nin the case of a Drawdown under the Development Tranche, (i) the Costs \nof Craft to be paid with the proceeds of such Drawdown are within the \ncurrent Development Budget, and (ii) the remaining Budgeted \nDevelopment Costs shall not exceed (A) the undrawn Credit Facility \nCommitment allocated to the Development Tranche (ii) the funding \npreviously received and then currently held by the Construction Receiver \nfor Cost Overruns under the Craft Development Contract provided by \nTerra Firma, Craft or the Lenders under the TF Cost Overrun Guarantee; \nand \n(c) \nin the case of a Drawdown under the ITC Tranche, the ITC Condition has \nnot ceased. \n(22) \nthe Administrative Agent shall have received in respect of the Leslieville Project: \n(a) \na Project Status Certificate;\n(b) \na Independent Cost Consultant’s Certificate signed by the Independent \nCost Consultant;  \n(c) \na copy of the related Craft request for payment under the applicable Craft \nC&D Contract, a copy of the Independent Cost Consultant’s \nrecommendation or payment verification certificate required under the \napplicable Craft C&D Contract, together with, in the case of a Drawdown \nunder the Craft Development Contract, copies of any and all invoices as \nmay be requested by the Administrative Agent. \n(23) \nthe Administrative Agent shall have received all other reports and deliveries \nrequired hereunder or otherwise reasonably requested by it with respect to the \nLeslieville Project for the period prior to such Drawdown Date; \n",
      "26": "- 23 - \n(24) \nthe Administrative Agent shall have received a subsearch from Lenders’ Counsel \nconfirming that no Encumbrances have been registered on title to the Leslieville \nProject Lands other than Permitted Encumbrances;  \n(25) \nsuch first advance must have occurred no later than the First Advance Date; and \n(26) \neach of UC Leslieville, UC Beach and UC Riverdale shall have been adjudged \nbankrupt under the Bankruptcy and Insolvency Act (Canada), \nprovided that all documents delivered pursuant to this Section 3.01 must continue to be in full \nforce and effect, and in form and substance satisfactory to the Lenders, acting reasonably. \nIf the conditions set forth in Sections 3.01(1) to (5), (7) to (13), (15) and (26) and Section 3.05 \nare not satisfied (or waived by the parties) on or before the CP Outside Date, then this \nAgreement shall be automatically terminated and of no force and effect.  \n3.02 \nConditions Precedent to all Subsequent Drawdowns – Leslieville Facilities \nThe obligation of each Lender to make any subsequent advance hereunder by way of a \nLoan under the Credit Facility is subject to and conditional upon the prior satisfaction of the \nfollowing conditions precedent: \n(1) \nthe Administrative Agent will have received a Drawdown Notice in accordance \nwith Sections 2.03(1) and (2); \n(2) \n(i) no Major Event of Default (as defined under each of the Craft C&D Contracts) \nor any material breach under any of the other Material Project Agreements shall \nhave occurred (and no event of default shall have occurred thereunder), and \nshall in any case, be continuing on the Drawdown Date, and (ii) neither of the \nCraft C&D Contracts shall have been terminated by either party thereto, including \nas a result of any breach, default or event of default thereunder;  \n(3) \nnone of Craft, the Builder or Terra Firma shall be Insolvent; \n(4) \nno Cost Overrun shall be existing which has not been funded by Terra Firma,  \nCraft or the Lenders under the TF Cost Overrun Guarantee; \n(5) \nall conditions precedent to the progress draw or payment under the applicable \nCraft C&D Contract proposed to be funded from the Drawdown shall have been \nsatisfied or waived and Craft is entitled to such progress draw or payment under \nsuch Craft C&D Contract; \n(6) \nnone of the Receivership Order, the Purchaser Package Approval Order, the \nSettlement Approval Order, the Beach Sales Process Order or the Receivership \nAdministration Order or any provision of any of them shall have been stayed, \nvaried or vacated without the prior written consent of the Lenders and the \nConstruction Receiver; \n(7) \nnone of the Tarion/Travelers Acknowledgements nor any provision thereof shall \nhave been varied or withdrawn, or the Court Order so declaring varied or stayed, \nwithout the prior written consent of the Required Lenders; \n",
      "27": "- 24 - \n(8) \nno Default or Event of Default will have occurred and be continuing on the \nDrawdown Date, or would result from making the requested advance; \n(9) \nthe Construction Receiver shall have delivered to the Administrative Agent all \navailable reporting required under this Agreement and newly available since the \nprevious Drawdown; \n(10) \na subsearch shall confirm that no Encumbrances have been registered on title to \nthe Leslieville Project Lands since the date of the prior Drawdown under the \nCredit Facility other than Permitted Encumbrances; \n(11) \nthe Administrative Agent shall have received copies of all New APS entered into \nsince the previous Drawdown; \n(12) \nthe Administrative Agent shall have received in respect of the Leslieville Project: \n(a) \na Project Status Certificate;\n(b) \na Independent Cost Consultant’s Certificate signed by the Independent \nCost Consultant;  \n(c) \na copy of the related Craft request for payment under the applicable Craft \nC&D Contract, a copy of the Independent Cost Consultant’s \nrecommendation or payment verification certificate required under the \napplicable Craft C&D Contract, together with, in the case of a Drawdown \nunder the Craft Development Contract, copies of any and all invoices as \nmay be requested by the Administrative Agent. \n(13) \nall Geo-thermal System Costs incurred by Craft have been paid when due and \npayable; \n(14) \nafter giving effect to the Drawdown: \n(a) \nin the case of a Drawdown under the FP Tranche, the Cost to Complete \nshall not exceed (i) the undrawn Credit Facility Commitment allocated to \nthe FP Tranche, (ii) the funding previously received and then currently \nheld by the Construction Receiver for Cost Overruns under the Craft \nConstruction Contract provided by Terra Firma, Craft or the Lenders \nunder the TF Cost Overrun Guarantee; and (iii) if the Geo-thermal System \nCosts are being funded through a Craft Loan, the amount of Craft Loans \nreceived and then currently held by the Construction Receiver to fund \nGeo-thermal System Costs. \n(b) \nin the case of a Drawdown under the Development Tranche, (i) the Costs \nof Craft to be paid with the proceeds of such Drawdown are within the \ncurrent Development Budget, and (ii) the remaining Budgeted \nDevelopment Costs shall not exceed (A) the undrawn Credit Facility \nCommitment allocated to the Development Tranche (ii) the funding \npreviously received and then currently held by the Construction Receiver \nfor Cost Overruns under the Craft Development Contract provided by \n",
      "28": "- 25 - \nTerra Firma, Craft or the Lenders under the TF Cost Overrun Guarantee; \nand \n(15) \nall other terms and conditions of this Agreement upon which the Construction \nReceiver may obtain a Loan that have not been waived will have been fulfilled. \n3.03 \nProvisos \nNotwithstanding anything in Section 3.02 to the contrary, if some or all of the conditions \nprecedent in Section 3.02 are not or cannot be satisfied (except for the condition precedent in \n3.02(10) which must be satisfied), the Construction Receiver shall nevertheless be entitled to a \nDrawdown under the FP Tranche and/or the Development Tranche, as applicable, to pay (A) \namounts payable to Craft pursuant to either or both of the Craft C&D Contracts upon termination \nof either or both of the Craft C&D Contracts by the Construction Receiver (or UC Leslieville by \nthe Construction Receiver) in accordance with the terms thereof (which, for certainty, excludes \nany compensation payable to Craft pursuant to Section 5.2 of the Development Contract); and \n(B) amounts of Holdback which become payable to Craft under the Craft C&D Contracts or as \nordered by the Court in the UC Receivership Proceedings.\n3.04 \nWaiver \nThe conditions set forth in Sections 3.01 and 3.02 are inserted for the sole benefit of the \nLenders and may be waived by the Required Lenders, in whole or in part (with or without terms \nor conditions), in respect of any Drawdown without prejudicing the right of the Lenders at any \ntime to assert such conditions in respect of any subsequent Drawdown. \n3.05 \nCondition to Construction Receiver’s Execution   \nNotwithstanding anything to the contrary in this Agreement, the execution and delivery of \nthis Agreement by the Construction Receiver and its obligations hereunder are subject to and \nconditional upon the granting of the Settlement Approval Order, the “Effective Date” (as defined \ntherein) having occurred and such order becoming final and non-appealable and if such order is \nappealed, such appeal is withdrawn or determined in favour of the Construction Receiver. \n. \nARTICLE 4 \nPAYMENTS OF INTEREST \nAND COMMITMENT FEES \n4.01 \nInterest on Prime Rate Loans \nThe Construction Receiver will pay interest in Canadian Dollars on each Prime Rate \nLoan from the date of advance to the date of repayment (both before and after default, \nacceleration and judgment) at a rate per annum equal to the sum of (a) the Prime Rate in effect \nfrom time to time plus (b) the Prime Rate Margin. Interest on the Loans will become due and \npayable in accordance with Section 5.01. \nEach determination by the Administrative Agent of the Prime Rate applicable from time \nto time will, in the absence of manifest error, be binding upon the Construction Receiver.  Such \ninterest will accrue from day to day, be payable in arrears and will be calculated on the principal \n",
      "29": "- 26 - \namount of the Prime Rate Loan outstanding from time to time and on the basis of the actual \nnumber of days elapsed in a year of 365 days.  Changes in the Prime Rate will cause an \nimmediate adjustment of the interest rate applicable to such Loan without the necessity of any \nnotice to the Construction Receiver. \n4.02 \nDeferred Commitment Fee \nIn consideration of the Lenders providing the Credit Facility, the Construction Receiver \nshall pay to the Administrative Agent, for the account of the Lenders, a fee of $200,000 which is \nfully earned on the date when the Settlement Approval Order is final and any appeal period has \nexpired or any appeal therefrom has been dismissed and is due and payable in accordance with \nSection 5.01. \n4.03 \nMaximum Rate of Interest \nNotwithstanding anything contained herein to the contrary, the Construction Receiver will \nnot be obliged to make any payment of interest or other amounts payable to the Lenders \nhereunder in excess of the amount or rate that would be permitted by Applicable Law or would \nresult in the receipt by the Lenders of interest at a criminal rate (as such terms are construed \nunder the Criminal Code (Canada)). If the making of any payment by the Construction Receiver \nwould result in a payment being made that is in excess of such amount or rate, the particular \nLender will determine the payment or payments that are to be reduced or refunded, as the case \nmay be, so that such result does not occur. \nARTICLE 5 \nREPAYMENT \n5.01 \nMandatory Repayment \n(1) \nThe Loans and all other Obligations shall shall become due by the Construction \nReceiver upon the occurrence of an Event of Default hereunder which has been \naccelerated by the Lenders in accordance with Section 9.02, and subject to \ncompliance with any conditions to such acceleration set forth therein. \n(2) \nNotwithstanding any other section of this Agreement, including without limitation, \nanything to the contrary in Sections 4.01 or 5.01(1) (but subject to Sections \n5.01(4) and 5.01(5)), the Construction Receiver shall only be required to pay \ninterest accrued on the Loans (including default interest pursuant to Section \n2.08), the Deferred Commitment Fee, the principal amount of the Loans \noutstanding under the Credit Facility (whether before or after an Event of Default \nor acceleration) and all other Obligations from time to time only out of and from (i) \nreceipts of Gross Sale Proceeds from the sale of Units or other income from the \nUnits or the realization thereof, and (ii) receipts of sales proceeds, rental \n(including occupation rent) or other income from, or the realization of, the Beach \nRemaining Lands, the Leslieville Project (other than the Units) and any and all \nother property, assets and undertaking of UC Leslieville, UC Beach and UC \nRiverdale (collectively the amounts in clauses (i) and (ii) being herein called \n“Proceeds for Distribution”), in each case, as and when such Proceeds for \nDistribution become available for distribution by the Construction Receiver to the \nLenders in the UC Receivership Proceedings; provided that nothing hereinbefore \nprovided shall limit any right or remedy which the Administrative Agent or the \n",
      "30": "- 27 - \nLenders may have under Article 9, subject to compliance with the Settlement \nApproval Order and any other applicable order of the Court in the UC \nReceivership Proceedings.  \n(3) \nAll Proceeds for Distribution (net of the Construction Receiver’s Reserve as \ncontemplated by the Settlement Approval Order) shall be distributed by the \nConstruction Receiver in accordance with and subject to the Waterfall approved \nunder the Settlement Approval Order, unless otherwise ordered by the Court in \nthe UC Receivership Proceedings. The Lenders may apply any Proceeds for \nDistribution received from the Construction Receiver in payment of Obligations \nunder this Agreement to such of the Obligations then outstanding as the Lenders \nmay determine in their discretion.  Any principal portion of the Loans repaid by \nthe Construction Receiver shall permanently reduce the Credit Facility \nCommitment available under the applicable Tranche (as determined by the \nLenders in their sole discretion) by an equivalent amount and no such principal \namount so repaid may thereafter be re-advanced. \n(4) \nThe Lenders acknowledge and agree that during the Operating Phase, and \nprovided no Event of Default has occurred and remains outstanding, the \noperating costs of the Leslieville Project (including the reimbursement of Craft for \nsuch operating costs) (collectively, “Operating Phase Costs”) shall be paid from \nthe interim occupancy revenues collected by the Construction Receiver or the \nOperating Manager from such Curzon Purchasers. To facilitate the payment of \nsuch Operating Phase Costs, the Operating Manager shall be authorized and \nrequired by the Construction Receiver (i) to collect such revenues, (ii) to pay \nOperating Phase Costs from the revenues so collected (so long as such \nOperating Phase Costs are at or below the amounts budgeted therefor in the \nOperating Budget), and (iii) to remit the positive balance (if any) remaining \nthereafter to the Construction Receiver (collectively, “Remitted Amounts”). To \nthe extent so remitted, the Construction Receiver (i) shall not be required to treat \nany Remitted Amounts as Proceeds for Distribution pursuant to Section 5.01(2), \nand (ii) may use any Remitted Amounts so retained for subsequent application in \npayment of any of its costs and expenses, provided that any such amounts that \nare not so used shall be distributed as Proceeds for Distribution and eventually \ndistributed by the Construction Receiver at such time as may be determined by it. \n(5) \nAmounts outstanding under the ITC Tranche shall be repaid by the Construction \nReceiver within five Business Days of the Construction Receiver’s receipt from \nthe Canada Revenue Agency of an amount or amounts on account of amounts \npreviously set-off by the Canada Revenue Agency against input tax credits \nclaimed by the Construction Receiver and assessed against any of UC \nRiverdale, UC Leslieville or UC Beach by Canada Revenue Agency.  For greater \ncertainty, (i) the Construction Receiver’s obligation under this Section 5.01(5) \nshall be limited to only the amount or amounts actually received by the \nConstruction Receiver from the Canada Revenue Agency, and (ii) any other \namounts remaining unpaid under the ITC Tranche shall be repaid as provided \nunder Section 5.01(2). \n",
      "31": "- 28 - \nARTICLE 6 \nPLACE AND APPLICATION OF PAYMENTS \n6.01 \nPlace of Payment of Principal, Interest and Fees \nAll payments of principal, interest, fees and other amounts to be made by the \nConstruction Receiver to the Administrative Agent and the Lenders pursuant to this Agreement \nwill be made in the currency in which the Loans are outstanding for value on the day such \namount(s) are distributed by the Construction Receiver in accordance with the Settlement \nApproval Order or, if such day is not a Business Day, on the Business Day next following with \ninterest, by deposit or transfer thereof to the account of the Administrative Agent maintained at \nthe Administrative Agent’s Office in Toronto or at such other place as the Construction Receiver \nand the Administrative Agent may from time to time agree. \nARTICLE 7 \nCOVENANTS \n7.01 \nPositive Covenants \nSo long as this Agreement is in force and except as otherwise permitted by the prior \nwritten consent of the Required Lenders, the Construction Receiver will: \n(1) \nTimely payment  Make due and timely payment of the Obligations required to be \npaid by it hereunder in accordance with Section 5.01; \n(2) \nInformation  Promptly provide such information with respect to the Leslieville \nProject, the status of each of the Craft C&D Contracts and the work and services \nprovided thereunder, the sale of Units and all other matters relating to the \nconstruction, development and sale of the Leslieville Project and the sale of the \nBeach Remaining Lands as may be reasonably requested by the Administrative \nAgent or any of the Lenders from time to time and to the extent that the same is \navailable to the Construction Receiver, whether directly or indirectly from Craft or \nthe Independent Cost Consultant; \n(3) \nFurther Assurances Use reasonable efforts to provide the Administrative Agent \nand \nthe \nLenders \nwith \nsuch \nother \ndocuments, \nopinions, \nconsents, \nacknowledgments and agreements as are reasonably necessary to implement \nthis Agreement and the other Loan Documents from time to time; \n(4) \nUse of Credit Facility Use the proceeds of the Credit Facility only for the \npurposes specified in Section 2.02; \n(5) \nOther Notices Promptly notify the Administrative Agent on becoming aware of the \noccurrence of any of the following and provide the additional information noted \nbelow: \n(a) \nif at any time a Latent Defect is discovered by Craft or the Builder, a \ndescription of the Latent Defect, together with such details with respect \nthereto (including the estimated cost of repair) that are available to the \nConstruction Receiver; \n",
      "32": "- 29 - \n(b) \nif at any time the Development Costs are expected to exceed the Initial \nDevelopment Budget, such details with respect thereto as are available to \nthe Construction Receiver; \n(c) \nthe occurrence of an event of Force Majeure, describing in reasonable \ndetail the effects of such event on the Construction of the Leslieville \nProject, the action which Craft intends to take during the pendency of \nsuch event to minimize the effects of such event (if any) and the \nestimated date when the event of Force Majeure is likely to cease to \nimpair Construction or operation of the Leslieville Project; \n(d) \nany breach in any material respect of either of the Craft C&D Contracts or \nof any default or event of default that shall have occurred thereunder; \n(e) \nany default by Terra Firma under the TF Cost Overrun Guarantee; \n(f) \nany damage to or destruction of any Property that forms part of the \nLeslieville Project, which might give rise to an insurance claim, if the cost \nof any repairs to or replacement of such Property exceeds $250,000; \n(g) \nany construction lien (or claim therefor) of which the Construction \nReceiver has notice or which is registered against title to the Leslieville \nProject, in either case, after the date hereof, and provide the \nAdministrative Agent with a true copy of such claim of lien or registered \ninstrument; \n(h) \nany written notice of expropriation with respect to any portion of the \nLeslieville Project Lands with the exception of the park dedication \nrequired by the site plan agreement for the Project, and provide a copy of \nsuch notice to the Administrative Agent forthwith upon receipt of such \nnotice, and the Construction Receiver hereby covenants and agrees that \nno such claim shall be compromised or settled without the prior written \nconsent of the Lenders or order of the Court; \n(i) \nany circumstance whereby the date of Construction Completion of the \nLeslieville Project is expected by the Construction Receiver or the \nIndependent Cost Consultant to be delayed by three or more months from \nthe initial Construction Schedule, whether in an individual instance or in \naggregate after taking into account all past delays and reasonably \nanticipated delays; or \n(j) \nany written notice of non-compliance in any material respect with any \nEnvironmental Law relating to the Leslieville Project Lands, and of any \nwritten notice of any investigation or non-routine inspection by any \nGovernmental Authority, or any written material inquiry by any \nGovernmental Authority, in connection with any Environmental Law \nrelating to the Leslieville Project; \n(6) \n onstruction Lien Act (Ontario) Comply with the provisions of the Construction \nLien Act (Ontario), including, without limitation, retaining the Holdbacks as \nrequired thereby;  \n",
      "33": "- 30 - \n(7) \nPurchaser Deposit Account  Maintain or instruct Construction Receiver’s Counsel \nto maintain a separate trust account for Purchaser Deposits in respect of the \nLeslieville Project with the Administrative Agent during the term of this \nAgreement and cause all Purchaser Deposits in respect of the Leslieville Project \nto be deposited to and all releases of Purchaser Deposits in respect of the \nLeslieville Project to be paid from such trust account; and \n(8) \nOperating Budget Prior to permitting any interim occupancy of the Leslieville \nProject, (a) provide or cause the Operating Manager to provide a draft Operating \nBudget to the Administrative Agent for the Lenders’ approval and obtain the \nLenders approval thereof, and (b) appoint the Operating Manager to undertake \nmanagement (insofar as interim occupancy issues are concerned) of the \nLeslieville Project during the Operating Phase. \n7.02 \nNegative Covenants \nSo long as this Agreement is in force and the Obligations remain outstanding and except \nas otherwise permitted by the prior written consent of the Required Lenders, the Construction \nReceiver will not: \n(1) \nNo Sale of Project  Dispose of or Lease any of the Leslieville Project or the \nBeach Remaining Lands other than: \n(a) \n(i) sales of Units to Opt-In Leslieville Purchasers made pursuant to the \nterms of the Standard Form Sales Agreement relating thereto and at the \nprices agreed in or pursuant to the Settlement Approval Order and (ii) \ninterim occupancy of such Units by the Opt-In Leslieville Purchasers; \n(b) \n(i) sales of Units to New Curzon Purchasers made pursuant to the terms \nof the Standard Form Sales Agreement for purchase prices at no less \nthan Proforma Sales Prices as agreed pursuant to the Marketing Plan \nunder the Craft Development Contract as approved by the Required \nLenders (as such Proforma Sales Prices may be amended from time to \ntime with the approval of the Required Lenders to the extent \ncontemplated under the Craft Development Contract), (ii) interim \noccupancy of such Units by the New Curzon Purchasers; \n(c) \nsales of unallocated parking spaces and extra storage spaces at the \nLeslieville Project pursuant to a sales process, and for prices no less than \nthe minimum prices as agreed pursuant to the Marketing Plan under the \nCraft Development Contract as approved by the Required Lenders (as \nsuch minimum prices may be amended from time to time with the \napproval of the Required Lenders to the extent contemplated under the \nCraft Development Contract); \n(d) \nsales of all or a portion of the Beach Remaining Lands pursuant to a \nsales process acceptable to the Required Lenders and approved by the \nCourt in the UC Receivership Proceedings and only for a price acceptable \nto the Required Lenders or as may be directed by the Court; or \n(e) \nwith the prior written consent of the Required Lenders; \n",
      "34": "- 31 - \n(2) \nNo Encumbrances Create, incur, assume or permit to exist any Encumbrance \nupon the Leslieville Project Lands, Beach Remaining Lands or any other property \nand assets of UC Leslieville, UC Beach or UC Riverdale except Permitted \nEncumbrances; \n(3) \nNew Debt  Incur any Debt other than Permitted Debt; \n(4) \nAmendments to Craft C&D Contracts  Amend, vary or alter in any material way, \nconsent to any assignment or transfer of, or waive or surrender any of its material \nrights or material entitlements under, any of the Craft C&D Contracts; \n(5) \nAmendment of Initial Development Budget or any subsequent Development \nBudget or any Operating Budget  (i) Make cumulative changes to the Initial \nDevelopment Budget or any subsequent Development Budget, including, for \ngreater certainty, cumulative changes to individual line items within such \nDevelopment Budget, which result in an individual or aggregate increase to such \nDevelopment Budget unless: \n(a) \nsuch increase has been approved or recommended by the Independent \nCost Consultant pursuant to the terms of the Craft Development Contract; \nand  \n(b) \nsuch increase has been pre-funded or funded by Terra Firma or Craft to \nthe Construction Receiver under and in accordance with TF Cost Overrun \nGuarantee or the Craft Development Contract, as the case may be; \nor (ii) make any change to the Operating Budget which results in the Operating \nPhase Costs being greater than the interim occupancy revenues derived from \ninterim occupancy of the Units during the Operating Phase; \n(6) \nCraft Construction Contract; No Change Orders  (i) Agree to any Change Orders, \nor (ii) the performance of any work or services by Craft outside of the FP Scope \nof Work unless, in either case, (A) the Change Order and/or Cost of such work or \nservices has been recommended by the Independent Cost Consultant as \ncontemplated under the Craft Construction Contract, and (B) the Cost of such \nChange Order or work has been pre-funded or funded by Terra Firma or Craft to \nthe Construction Receiver under and in accordance with the TF Cost Overrun \nGuarantee or the Craft Construction Contract, as the case may be; \n(7) \nAmendment of Construction Schedule (i) Permit or agree to a revision to the \nConstruction Schedule which, directly or indirectly, permits or results in \nSubstantial Performance of the Work (as defined in the Craft Construction \nContract) occurring beyond the Outside Date; or (ii) permit or agree to a revision \nof the Construction Schedule or a delay or extension of the Substantial \nPerformance of the Work which, in either case, would permit or result in an \nincrease in the Costs of Construction, unless such increase has been (A) \nrecommended by the Independent Cost Consultant as contemplated under the \nCraft Construction Contract, and (B) pre-funded or funded by Terra Firma or \nCraft to the Construction Receiver under and in accordance with TF Cost \nOverrun Guarantee or the Craft Construction Contract, as the case may be; \n",
      "35": "- 32 - \nprovided that upon any revision of the Construction Schedule, the Construction \nReceiver will forthwith provide a copy thereof to the Administrative Agent;  \n(8) \nAmendment of Plans and Specifications Revise the Plans and Specifications in \nany material respect, except as may be required to comply with Applicable Law \nor any Development Approvals or except with the consent of the Required \nLenders, such consent not to be unreasonably withheld, provided that upon \nrevision of the Plans and Specifications, the Construction Receiver will forthwith \nprovide a copy thereof to the Administrative Agent; \n(9) \nMarketing Plan and Sales  Agree to any of the following: \n(a) \nthe initial Marketing Plan and thereafter, any material amendment to the \nMarketing Plan; or \n(b) \nany reductions in ProForma Sales Price for any Unit or the sale of any \nUnit for a price below its then current ProForma Sales Price; or \nwithout the prior written approval of the Required Lenders.   \n(10) \nNo Upgrades   Offer to or agree with any New Curzon Purchaser to make or \nprovide any Upgrades, or permit Craft or the Builder to do so.  \nARTICLE 8 \nSECURITY \n8.01 \nSecurity \nAs general and continuing security for the payment and performance of the Obligations, \nthe Administrative Agent on behalf of the Lenders shall be granted a fixed and specific Court \nordered charge of all of the Beach Remaining Lands, the Leslieville Project, each New APS, the \nCraft C&D Contracts, the Craft Cash Collateral, the TF Cost Overrun Guarantee, the Craft Loan \nand all other property, assets and undertaking of each of UC Leslieville, UC Beach and UC \nRiverdale, which Court ordered charge shall confer priority in favour of the Lenders in terms of \nthe order of payment and the ranking of security in the manner contemplated in the Waterfall \nand the Settlement Approval Order. \nARTICLE 9 \nDEFAULT \n9.01 \nEvents of Default \nThe occurrence of any one or more of the following events will constitute an event of \ndefault (“Event of Default”) under this Agreement: \n(1) \nif the Construction Receiver fails to pay any Obligation when due; \n(2) \nif the Construction Receiver breaches any covenant in Section 7.02 and has \nreceived written notice thereof from the Administrative Agent;\n",
      "36": "- 33 - \n(3) \nif the Construction Receiver neglects to observe or perform, in any material \nrespect, any covenant or obligation contained in this Agreement or any other \nLoan Document on its part to be observed or performed (other than a covenant \nor condition whose breach or default in performance is specifically dealt with \nelsewhere in this Section 9.01 or in such Loan Document) and the Construction \nReceiver fails to remedy such default within 30 days from the date the \nAdministrative Agent delivers written notice of the default to the Construction \nReceiver, or where the Required Lenders (having regard to the subject matter of \nthe default) have agreed, acting reasonably, that such default cannot be cured \nwithin such 30 days, such longer period as is required so long as the \nConstruction Receiver is diligently proceeding at all times to cure such default \nand provided that, in any event, such cure period shall not extend longer than \nfour months without the consent of the Required Lenders in their sole and \nabsolute discretion; or \n(4) \nif any Catastrophic Event (as defined in the Craft Construction Contract) occurs; \nor  \n(5) \nthe existence or occurrence of any event or circumstance described in Section \n3.01 or 3.02 which would effectively disentitle the Construction Receiver from \nobtaining a Drawdown under the Credit Facility. \n9.02 \nAcceleration and Enforcement \n(1) \nIf any Event of Default occurs: \n(a) \nthe Lenders will have no further obligation to make Loans available to the \nConstruction Receiver hereunder, and may, at the option of the \nAdministrative Agent or at the request of the Required Lenders and in any \nevent on delivery of written notice to the Construction Receiver, demand \nrepayment of the outstanding principal amount of the Loans and all other \nObligations, whereupon such principal amount and such other Obligations \nshall become immediately due and payable with interest thereon, at the \nrate or rates determined as herein provided to the date of actual payment \nthereof, all without further notice, presentment, protest, demand, notice of \ndishonour or any other demand or notice whatsoever, all of which are \nhereby expressly waived by the Construction Receiver; provided however \nthat repayment of the Obligations shall only be made in accordance with \nthe Settlement Approval Order to the extent of and from Proceeds for \nDistribution in the priority and order of payment set out in the Settlement \nApproval Order; and \n(b) \nthe Lenders, or the Administrative Agent on their behalf, may, in their sole \nand absolute discretion (but subject to the further order of the Court, if \nrequired under the Receivership Order (including Section 11 thereof, if \napplicable) and/or under the Settlement Approval Order), exercise any \nright or recourse and proceed by any action, suit, remedy or proceeding \nunder the Security or Applicable Law, including any right, recourse, \naction, suit, remedy or proceeding authorized or permitted in the UC \nReceivership Proceedings or under the Settlement Approval Order, for \nthe recovery of all the Obligations to the Lenders and whether or not the \n",
      "37": "- 34 - \nLenders or the Administrative Agent have exercised any of their \nrespective rights under the foregoing clause (a); provided however that \nrepayment of the Obligations shall only be made in accordance with the \nSettlement Approval Order to the extent of and from Proceeds for \nDistribution in the priority and order of payment set out in the Settlement \nApproval Order. \n(2) \nThe Administrative Agent and Lenders are not under any obligation to the \nConstruction Receiver or any other Person to realize upon any collateral or \nenforce the Security or any part thereof or to allow any of the collateral to be \ndealt with or Disposed of. Neither the Administrative Agent nor the Lenders are \nresponsible or liable to the Construction Receiver or any other Person for any \nloss or damage arising from such realization or enforcement or the failure to do \nso or for any act or omission on their respective parts or on the part of any \ndirector, officer, employee, agent or adviser of any of them in connection with any \nof the foregoing. \n(3) \nEach of the Lenders acknowledges that the Administrative Agent holds the \nSecurity to secure all of the Obligations and, upon the occurrence of an Event of \nDefault, the Administrative Agent will act on the written instructions of the \nRequired Lenders as provided in this Agreement and will distribute the Proceeds \nfor Distribution received by the Administrative Agent in accordance with the \nSettlement Approval Order to the Lenders in accordance with their Applicable \nPercentage of the Obligations and in accordance with Section 9.06. \n9.03 \nRemedies Cumulative \nFor greater certainty, it is expressly understood that the respective rights and remedies \nof the Lenders and the Administrative Agent as against the estate of UC Leslieville hereunder or \nunder any other Loan Document or instrument executed pursuant to this Agreement are \ncumulative and are in addition to and not in substitution for any rights or remedies provided by \nlaw or by equity. Any single or partial exercise by the Lenders or by the Administrative Agent of \nany right or remedy for a default or breach of any term, covenant, condition or agreement \ncontained in this Agreement or any other Loan Document will not be deemed to be a waiver of \nor to alter, affect or prejudice any other right or remedy or other rights or remedies to which any \none or more of the Lenders and the Administrative Agent may be lawfully entitled in connection \nwith such default or breach. \n9.04 \nPerform Obligations \nIf an Event of Default has occurred and is continuing and if the Construction Receiver \nhas failed to perform any of its covenants or agreements in the Loan Documents, the Required \nLenders, may, but will be under no obligation to, instruct the Administrative Agent on behalf of \nthe Lenders to perform any such covenants or agreements in any manner deemed fit by the \nRequired Lenders without thereby waiving any rights to enforce the Loan Documents. The \nreasonable expenses (including any legal costs) paid by the Administrative Agent and the \nLenders in respect of the foregoing will be an Obligation and will be secured by the Security. \nWithout limiting the generality of the forgoing, in the event that a construction lien is registered \nagainst the Leslieville Project Lands or any portion thereof and is not discharged within fifteen \n(15) Business Days thereafter, the Administrative Agent (on behalf of the Lenders) shall be \nentitled, in its sole discretion, on behalf of the Construction Receiver or otherwise, to pay into \n",
      "38": "- 35 - \ncourt the amount required to effect removal of such lien and the amount so paid shall be \ndeemed to have been advanced by the Lenders to the Construction Receiver and shall, \ntogether with all interest accruing thereon, be deemed to form a part of the indebtedness and \nliability of the Construction Receiver to the Lenders hereunder. \n9.05 \nThird Parties \nIt is not necessary for any Person dealing with the Lenders, the Administrative Agent or \nany other agent of the Lenders to inquire whether the Security has become enforceable, or \nwhether the powers that the Lenders or the Administrative Agent are purporting to exercise may \nbe exercised, or whether any Obligations remain outstanding upon the security thereof, or as to \nthe necessity or expediency of the stipulations and conditions subject to which any sale is to be \nmade, or otherwise as to the propriety or regularity of any Disposition or any other dealing with \nthe collateral charged by such Security or any part thereof. \n9.06 \nApplication of Payments \nFrom and after the occurrence of an Event of Default which is continuing, all payments \nmade by the Construction Receiver hereunder or received from Proceeds for Distribution will be \napplied to amounts due under the Obligations, all as determined by the Administrative Agent \nand based on Applicable Percentage of Obligations, but subject to and otherwise in accordance \nwith the Settlement Approval Order. \nARTICLE 10 \nTHE ADMINISTRATIVE AGENT AND THE LENDERS \n10.01 Payments by the Construction Receiver \n(1) \nAll payments made by or on behalf of the Construction Receiver pursuant to this \nAgreement will be made to and received by the Administrative Agent on behalf of \nthe Lenders and will be distributed by the Administrative Agent to the Lenders as \nsoon as possible upon receipt by the Administrative Agent.  All payments made \nby the Construction Receiver hereunder (whether made before or after the \noccurrence of an Event of Default) or received from Proceeds for Distribution will \nbe applied to amounts due under the Obligations, all as determined by the \nAdministrative Agent and based on Applicable Percentage of Obligations but \nsubject to and in accordance with the Settlement Approval Order. \n(2) \nSubject to Section 10.02, if the Administrative Agent does not distribute a \nLender’s Applicable Percentage of a payment made by the Construction \nReceiver to or for the benefit of a Lender for value on the day that payment is \nmade to the Administrative Agent, provided that such payment is received by the \nAdministrative Agent no later than 1:00 p.m. (Toronto time) on such day, the \nAdministrative Agent will pay to such Lender on demand an amount equal to the \nproduct of (a) the Interbank Reference Rate per annum and (b) the amount \nreceived by the Administrative Agent from the Construction Receiver and not so \ndistributed to such Lender, with the result thereof multiplied by (c) a fraction, the \nnumerator of which is the number of days that have elapsed from and including \nthe date of receipt of the payment by the Administrative Agent to but excluding \nthe date on which the payment is made by the Administrative Agent to such \nLender, and the denominator of which is 365 or 366, as the case may be. \n",
      "39": "- 36 - \n10.02 Payments by Administrative Agent \nFor greater certainty, the following provisions will apply to all payments made by the \nAdministrative Agent to the Lenders hereunder: \n(a) \nthe Administrative Agent will be under no obligation to make any payment \n(whether in respect of principal, interest, fees or otherwise) to any Lender \nuntil an amount in respect of such payment has been received by the \nAdministrative Agent from the Construction Receiver; \n(b) \nif the Administrative Agent receives less than the full amount of any \npayment of principal, interest, fees or other amount owing by the \nConstruction Receiver under this Agreement, then, the Administrative \nAgent will have no obligation to remit to each Lender any amount other \nthan such Lender’s Applicable Percentage of the amount actually \nreceived by the Administrative Agent; \n(c) \nif any Lender advances more or less than its Applicable Percentage of the \nLoan, such Lender’s entitlement to such payment will be increased or \nreduced, as the case may be, in proportion to the amount actually \nadvanced by such Lender; \n(d) \nthe Administrative Agent acting reasonably and in good faith will, after \nconsultation with the Lenders in the case of any dispute, determine in all \ncases the amount of all payments to which each Lender is entitled and \nsuch determination will, in the absence of manifest error, be binding and \nconclusive; \n(e) \nupon request, the Administrative Agent will deliver a statement detailing \nany of the payments to the Lenders referred to herein; and \n(f) \nall payments by the Administrative Agent to a Lender hereunder will be \nmade to such Lender at its address set forth on the signature pages on \nthis Agreement or on the applicable Assignment and Assumption unless \nnotice to the contrary is received by the Administrative Agent from such \nLender. \n10.03 Administration of the Credit Facility \n(1) \nUnless otherwise specified herein, the Administrative Agent will perform the \nfollowing duties under this Agreement: \n(a) \nprior to an advance to the Construction Receiver hereunder, ensure that \nall conditions precedent have been fulfilled in accordance with the terms \nof this Agreement; \n(b) \ntake delivery of each Lender’s Applicable Percentage of a Loan and make \nall Loans hereunder in accordance with the provisions set forth herein; \n(c) \nuse reasonable efforts to collect promptly all sums due and payable by \nthe Construction Receiver pursuant to this Agreement; \n",
      "40": "- 37 - \n(d) \nmake all payments to the Lenders in accordance with the provisions \nhereof; \n(e) \nhold all legal documents relating to the Credit Facility, maintain complete \nand accurate records showing all Loans made by the Lenders, all \nremittances and payments made by the Construction Receiver to the \nAdministrative Agent, all remittances and payments made by the \nAdministrative Agent to the Lenders and all fees or any other sums \nreceived by the Administrative Agent and allow each Lender and their \nrespective advisors to examine such accounts, records and documents at \ntheir own expense, and provide any Lender, upon reasonable notice, with \nsuch copies thereof as such Lender may reasonably require from time to \ntime at its expense; \n(f) \nexcept as otherwise specifically provided for in this Agreement, promptly \nadvise each Lender upon receipt of each notice and deliver to each \nLender, promptly upon receipt, all other written communications furnished \nby the Construction Receiver to the Administrative Agent pursuant to this \nAgreement, including copies of financial reports and certificates which are \nto be furnished to the Administrative Agent; \n(g) \nforward to each of the Lenders, one copy each of this Agreement and \nother Loan Documents; \n(h) \npromptly forward to each Lender, upon request, an up-to-date loan status \nreport and any other information respecting the Construction Receiver \nreasonably requested by such Lender; and \n(i) \nupon learning of same, promptly advise each Lender in writing of the \noccurrence of a Default or of any material adverse information relative to \nthe Construction Receiver. \n(2) \nThe Administrative Agent may take the following actions only with the prior \nconsent of the Required Lenders, unless otherwise specified in this Agreement: \n(a) \nsubject to Section 10.03(3), exercise any and all rights of approval \nconferred upon the Lenders by this Agreement; \n(b) \namend, modify or waive any of the terms of this Agreement (including \nwaiver of a Default or an Event of Default) if such amendment, \nmodification or waiver would not have a material adverse effect on the \nrights of the Lenders thereunder and if such action is not otherwise \nprovided for in Section 10.03(3); \n(c) \nengage professionals, experts and agents as permitted by Section \n10.04(1); and \n(d) \ndeclare an Event of Default, take action to enforce performance of the \nObligations and realize on collateral subject to the Security and pursue \nany other legal remedy necessary or advisable to protect the interests of \nthe Lenders hereunder. \n",
      "41": "- 38 - \n(3) \nThe Administrative Agent may take the following actions only with the prior \nunanimous consent of the Lenders, unless otherwise specified herein: \n(a) \namend, modify, discharge, terminate or waive any of the terms of this \nAgreement if such amendment, modification, discharge, termination or \nwaiver would increase the amount of the Credit Facility, reduce the \ninterest rate applicable to either of the Credit Facility, reduce the fees \npayable with respect to the Credit Facility, extend any date fixed for \npayment of principal or interest relating to the Credit Facility; \n(b) \namend, modify, discharge, terminate or waive any terms of the Security \notherwise than pursuant to the terms hereof or thereof; \n(c) \namend this Section 10.03(3); \n(d) \namend any provision of Article 5; \n(e) \namend Section 7.01(1) or Section 7.02; \n(f) \namend Section 9.06 or Section 10.01; \n(g) \namend any provision of Schedule A; \n(h) \namend the definition of “Required Lenders”; or \n(i) \nwhere the Independent Cost Consultant identifies a Cost Overrun which \nthe Administrative Agent proposes to finance other than by way of funding \nprovided by Craft or Terra Firma under and in accordance with the TF \nCost Overrun Guarantee. \n(4) \nAs between the Construction Receiver, on the one hand, and the Administrative \nAgent and the Lenders, on the other hand: \n(a) \nall statements, certificates, consents and other documents which the \nAdministrative Agent purports to deliver on behalf of the Lenders or the \nRequired Lenders will be binding on each of the Lenders, and the \nConstruction Receiver will not be required to ascertain or confirm the \nauthority of the Administrative Agent in delivering such documents; \n(b) \nall certificates, statements, notices and other documents which are \ndelivered by the Construction Receiver to the Administrative Agent in \naccordance with this Agreement will be deemed to have been delivered to \neach of the Lenders; and \n(c) \nall payments which are made by the Construction Receiver to the \nAdministrative Agent in accordance with this Agreement will be deemed \nto have been duly made to each of the Lenders. \n",
      "42": "- 39 - \n10.04 Rights of Administrative Agent \n(1) \nIn administering the Credit Facility, the Administrative Agent may retain, at the \nexpense of the Lenders if such expenses are not recoverable from the \nConstruction Receiver, such counsel, auditors and other experts as the \nAdministrative Agent may select, in its sole discretion, acting reasonably, and is \nentitled to rely upon the advice of such counsel, auditors and other experts in the \nperformance of its duties hereunder. \n(2) \nExcept in its own right as a Lender, the Administrative Agent will not be required \nto advance its own funds for any purpose hereunder. \n10.05 Representations, Acknowledgements and Covenants of Lenders \n(1) \nEach of the Lenders acknowledges that in the event that the Administrative \nAgent does not receive payment in accordance with this Agreement, it will not be \nthe obligation of the Administrative Agent to maintain the Credit Facility in good \nstanding nor will any Lender have recourse to the Administrative Agent in respect \nof any amounts owing to such Lender under this Agreement. \n(2) \nEach Lender acknowledges that its obligation to advance its Applicable \nPercentage of Loans in accordance with the terms of this Agreement is \nindependent and in no way related to the obligation of any other Lender \nhereunder. \n(3) \nEach Lender agrees that it will notify the Administrative Agent of any Default or \nEvent of Default of which it becomes aware. \n(4) \nEach Lender hereby acknowledges receipt of a copy of this Agreement and the \nLoan Documents and acknowledges that it is satisfied with the form and content \nof such documents. \n(5) \nEach Lender will respond promptly to each request by the Administrative Agent \nfor the consent of such Lender required hereunder. \n10.06 Provisions Operative Between Lenders and Administrative Agent Only \nExcept for the provisions of Sections 10.03(2), (3) and (4), Sections 10.05(2) and (5) and \nitem (3) of 10.08 and the first sentence of Section 10.01(1), the provisions of this Article 10 \nrelating to the rights and obligations of the Lenders and the Administrative Agent inter se will be \noperative as between the Lenders and the Administrative Agent only, and the Construction \nReceiver will not have any rights or obligations under or be entitled to rely for any purpose upon \nsuch provisions. \n10.07 Maintenance of Security \nThe Security shall be granted in favour of and held by the Administrative Agent for and \non behalf of the Lenders in accordance with the provisions of this Agreement. The \nAdministrative Agent shall, in accordance with its usual practices in effect from time to time, take \nall steps customarily required to perfect and maintain the Security of type provided under this \nAgreement; and ensuring that the name of the Administrative Agent is noted on all property \n",
      "43": "- 40 - \ninsurance policies covering the Leslieville Project to the extent required herein. If the \nAdministrative Agent becomes aware of any matter concerning the Security which it considers \nto be material, it shall promptly inform the Lenders. The Administrative Agent shall comply with \nall instructions provided by the Lenders in connection with the enforcement or release of the \nSecurity which it holds. The Administrative Agent agrees to permit each Lender to review and \nmake photocopies of the original documents comprising the Security from time to time upon \nreasonable notice. \n10.08 Application of Proceeds for Distribution \nNotwithstanding any other provision of this Agreement, any and all Proceeds for \nDistribution or any portion thereof shall be distributed in the following order: (1) firstly, in \npayment of all costs and expenses incurred by the Administrative Agent and the Lenders in \nconnection with this Agreement, the Security or any distribution by the Construction Receiver, \nincluding legal, accounting and receivers’ fees and disbursements; (2) secondly, against the \noutstanding Obligations, each Lender being entitled to receive its pro rata share thereof; and (3) \nthirdly, if all Obligations have been paid and satisfied in full, then, subject to Applicable Law and \nthe provisions of the Settlement Approval Order, to the Construction Receiver. \n10.09 No Partnership \nThe obligations of each Lender under this Agreement are several. The failure of any \nLender to carry out its obligations hereunder shall not relieve the other Lenders of any of their \nrespective obligations hereunder. No Lender shall be responsible for the obligations, acts or \nomissions of any other Lender hereunder. Neither the entering into of this Agreement nor the \ncompletion of any transactions contemplated herein shall constitute the Lenders a partnership. \nEach Lender may lend money to and have business dealings with the Construction Receiver \noutside the scope of this Agreement. \n10.10 Sharing of Information \nThe Administrative Agent and the Lenders may share among themselves any \ninformation they may have from time to time concerning the Construction Receiver whether or \nnot such information is confidential; but shall have no obligation to do so (except for any \nobligations of the Administrative Agent to provide information to the extent required in this \nAgreement). \nARTICLE 11 \nGENERAL \n11.01 Addresses, Etc. for Notices \nThe mailing addresses and addresses for electronic communications for the purposes of \nnotices and other communications to the Construction Receiver, the Lenders and the \nAdministrative Agent are set out on the signature pages of this Agreement. \n11.02 Governing Law and Submission to Jurisdiction \nOntario is the Province for the purposes of Sections 11(a) and (b) of Schedule A. \n",
      "44": "- 41 - \n11.03 Effect of Assignment \nFor greater certainty, an assignment by any Lender of its rights hereunder will not \nconstitute a repayment, discharge, rescission, extinguishment or novation of any extension of \ncredit by such Lender under this Agreement or interest therein, and the obligations so assigned \nwill continue to be the same obligations and not new obligations. \n11.04 Survival \nThe provisions of Section 9 of Schedule A will survive the repayment of all Loans and all \nobligations with respect to Letters of Credit, whether on account of principal, interest or fees, \nand the termination of this Agreement, unless a specific release of such provisions by the \nAdministrative Agent, on behalf of the Lenders, is delivered to the Construction Receiver. \n11.05 Severability \nIf any provision of this Agreement is determined by any court of competent jurisdiction to \nbe illegal or unenforceable, that provision will be severed from this Agreement and the \nremaining provisions will continue in full force and effect so long as the economic or legal \nsubstance of the transactions contemplated hereby is not affected in any manner materially \nadverse to any of the parties. \n11.06 Further Assurances \nThe Construction Receiver, each Lender and the Administrative Agent will promptly cure \nany default by it in the execution and delivery of this Agreement, the Loan Documents or of any \nof the agreements provided for hereunder to which it is a party. Prior to its discharge as \nConstruction Receiver under the UC Receivership Proceedings and during the term of this \nCredit Agreement, the Construction Receiver will promptly execute and deliver to the \nAdministrative Agent, upon request by the Administrative Agent, all such other and further \ndocuments, agreements, opinions, certificates and instruments in compliance with, or for the \naccomplishment of the covenants and agreements of the Construction Receiver hereunder or \nmore fully to state the obligations of the Construction Receiver as set forth herein or to make \nany recording, file any notice or obtain any consent, all as may be reasonably necessary or \nappropriate in connection therewith. \n11.07 Amendments and Waivers \nNo amendment to this Agreement will be valid or binding unless set forth in writing and \nduly executed by the Construction Receiver and the Administrative Agent for and on behalf of \nthe Lenders or the Required Lenders, as the case may be. No waiver of any breach of any \nprovision of this Agreement and no consent required hereunder will be effective or binding \nunless made in writing and signed by the party purporting to give the same. Unless otherwise \nprovided, any waiver or consent given hereunder will be limited to the specific breach waived or \nmatter consented to, as the case may be, and may be subject to such conditions as the party \ngiving such waiver or consent considers appropriate. \n11.08 Reasonableness \nUntil the occurrence of an Event of Default, unless specifically specified otherwise \nherein, in respect of the exercise of any discretion or the giving of any consents or approval \n",
      "45": "- 42 - \nunder this Agreement, the Administrative Agent and the Lenders shall act in a reasonable and \ntimely manner consistent with prudent lending practices bearing in mind the scope, magnitude \nand complexity of the Leslieville Project and the financial and development expertise of the \nConstruction Receiver. \n11.09 Time of the Essence \nTime is of the essence of this Agreement. \n[Signature pages follow] \n",
      "46": "",
      "47": "",
      "48": "",
      "49": "",
      "50": "",
      "51": "SCHEDULE A \nMODEL CREDIT AGREEMENT PROVISIONS \nAs Attached \n",
      "52": "- 2 - \nSCHEDULE A TO CREDIT AGREEMENT \n(CBA Amended “Stapled-on” Version of LSTA Model Credit Agreement Provisions \n dated November 1, 2004) \nThe attached model credit agreement provisions, which have been revised under the direction of the \nCanadian Bankers' Association Secondary Loan Market Specialist Group from provisions prepared by \nThe Loan Syndications and Trading Association, Inc., form part of this Agreement, except for the \nfootnotes to the model credit agreement provisions and subject to the following variations:  \nVariations \n1.\nThe definition of “Default” is amended by deleting the words “that constitutes an Event of Default \nor”. \n2. \nThe term “Borrower” where used in this Schedule A shall mean the Construction Receiver as \ndefined in this Agreement. \n3. \nThe definition of “Loan” as set out in this Schedule A shall be amended to delete the words \n“banker’s acceptance or LIBO Rate Loan, except for any Letter of Credit or participation in a \nLetter of Credit” and substitute the following therefor “Prime Rate Loan, Letter of Credit, Bankers’ \nAcceptance or BA Equivalent Advance outstanding under the Credit Facility”.\n3. \nAny reference to a “Permitted Lien” shall mean a Permitted Encumbrance. \n4. \nSection 3.2(f) of this Schedule A is deleted. \n5. \nSection 3 of this Schedule A is amended by adding the following Section 3.6. \n“3.6 Overriding Payment Qualification. \nWithout limiting the generality of Section 5.01 of this Agreement, the Borrower shall not be \nrequired to make any payment under Section 3.1 to 3.5 or under Section 9 except out of and from \nProceeds for Distribution as and when such Proceeds for Distribution become available for \ndistribution by the Borrower to the Lenders in the UC Receivership Proceedings.” \n6.  \nSection 7.3(1)(c) of this Schedule A is amended to replace “person” with “Person”. \n7. \nSection 10(b)(i) of this Schedule A is amended to replace the number “$5,000,000” therein, by the \nnumber “$1,000,000”. \n8. \nSection 10(b)(iv)(z) of this Schedule A is amended by adding at the end thereof, the words “or \nany successor thereto”. \n9.  \nSection 10(b)(v) of this Schedule A shall be deleted in its entirety and the following substituted \ntherefor: \n“(v) any assignment of an interest in excess of $1,000,000 must be approved by the \nBorrower (such approval not to be unreasonably withheld or delayed) unless: (A) the \nproposed assignee is itself already a Lender; (B) the proposed assignee is an Affiliate of \nany of the Lenders or an Approved Fund; or (C) an Event of Default has occurred and is \ncontinuing; and” \n10. \nFor the purposes of Section 10(b)(vi) of this Schedule A, the processing and recordation fee \nreferred to therein shall be $3,000. \n",
      "53": "- 3 - \n11. \nFor the purposes of Sections 11(a) and 11(b) of this Schedule A, the specified Province shall be \nthe Province of Ontario. \n12. \nCapitalized words, terms or phrases used in this Schedule A and not defined in this Schedule A \nshall have the meaning given to such words, terms or phrases in Section 1.01 of this Agreement \n(or if not defined therein, as defined elsewhere in this Agreement) to the extent therein defined. If \nnot defined in this Schedule or in Section 1.01 or elsewhere in this Agreement, the relevant \ncapitalized words, terms or phrases shall be given a usual and reasonable interpretation \naccording to Canadian banking practice.1\n13. \nIf there is any inconsistency or conflict between the terms of this Schedule A and the terms of the \nmain body of this Agreement, the terms of the main body of this Agreement shall prevail.\n1  Note that phrases such as “Letter of Credit” are neither defined in this Schedule A, nor otherwise in this Agreement.  The defined \nterms have been retained so as to result in minimal interference with the LSTA Model Credit Agreement Provisions, and on the \nunderstanding that the failure to include relevant definitions in this Agreement (solely for reasons of brevity) does not affect the \ninterpretation of this Agreement, including this Schedule A. \n",
      "54": "TOR_LAW\\ 9034402\\25 \nMODEL CREDIT AGREEMENT PROVISIONS \n1. \nDefinitions \n“Administrative Questionnaire” means an Administrative Questionnaire in a form supplied by the \nAdministrative Agent. \n“Affiliate” means, with respect to a specified Person, another Person that directly, or indirectly \nthrough one or more intermediaries, Controls or is Controlled by or is under common Control with the \nPerson specified. \n\"Agreement\" means the credit agreement of which these Provisions form part. \n“Applicable Law” means (a) any domestic or foreign statute, law (including common and civil law), \ntreaty, code, ordinance, rule, regulation, restriction or by-law (zoning or otherwise); (b) any judgement, \norder, writ, injunction, decision, ruling, decree or award; (c) any regulatory policy, practice, guideline or \ndirective; or (d) any franchise, licence, qualification, authorization, consent, exemption, waiver, right, \npermit or other approval of any Governmental Authority, binding on or affecting the Person referred to in \nthe context in which the term is used or binding on or affecting the property of such Person, in each case \nwhether or not having the force of law.\n“Applicable Percentage” means with respect to any Lender, the percentage of the total \nCommitments represented by such Lender’s Commitment.  If the Commitments have terminated or \nexpired, the Applicable Percentages shall be the percentage of the total outstanding Loans and \nparticipations in respect of Letters of Credit represented by such Lender’s outstanding Loans and \nparticipations in respect of Letters of Credit. \n“Approved Fund” means any Fund that is administered or managed by (a) a Lender, (b) an \nAffiliate of a Lender or (c) an entity or an Affiliate of an entity that administers or manages a Lender. \n“Assignment and Assumption” means an assignment and assumption entered into by a Lender \nand an Eligible Assignee and accepted by the Administrative Agent, in substantially the form of Exhibit A \nor any other form approved by the Administrative Agent. \n“Change in Law” means the occurrence, after the date of this Agreement, of any of the following: \n(a) the adoption or taking effect of any Applicable Law, (b) any change in any Applicable Law or in the \nadministration, interpretation or application thereof by any Governmental Authority or (c) the making or \nissuance of any Applicable Law by any Governmental Authority. \n“Control” means the possession, directly or indirectly, of the power to direct or cause the direction \nof the management or policies of a Person, whether through the ability to exercise voting power, by \ncontract or otherwise. “Controlling” and “Controlled” have corresponding meanings. \n“Default” means any event or condition that constitutes an Event of Default or that would \nconstitute an Event of Default except for satisfaction of any condition subsequent required to make the \nevent or condition an Event of Default, including giving of any notice, passage of time, or both. \n“Eligible Assignee” means any Person (other than a natural person, any Obligor or any Affiliate of \nan Obligor), in respect of which any consent that is required by Section 10(b) has been obtained.\n“Excluded Taxes” means, with respect to the Administrative Agent, any Lender, the Issuing Bank \nor any other recipient of any payment to be made by or on account of any obligation of an Obligor \n",
      "55": "- 2 - \nhereunder, (a) taxes imposed on or measured by its net income, and franchise taxes imposed on it (in \nlieu of net income taxes), by the jurisdiction (or any political subdivision thereof) under the laws of which \nsuch recipient is organized or in which its principal office is located or, in the case of any Lender, in which \nits applicable lending office is located, (b) any branch profits taxes or any similar tax imposed by any \njurisdiction in which the Lender is located and (c) in the case of a Foreign Lender (other than (i) an \nassignee pursuant to a request by the Borrower under Section 3.3(b), (ii) an assignee pursuant to an \nAssignment and Assumption made when an Event of Default has occurred and is continuing or (iii) any \nother assignee to the extent that the Borrower has expressly agreed that any withholding tax shall be an \nIndemnified Tax), any withholding tax that (A) is not imposed or assessed in respect of a Loan that was \nmade on the premise that an exemption from such withholding tax would be available where the \nexemption is subsequently determined, or alleged by a taxing authority, not to be available and (B) is \nrequired by Applicable Law to be withheld or paid in respect of any amount payable hereunder or under \nany Loan Document to such Foreign Lender at the time such Foreign Lender becomes a party hereto (or \ndesignates a new lending office) or is attributable to such Foreign Lender’s failure or inability (other than \nas a result of a Change in Law) to comply with Section 3.2(e), except to the extent that such Foreign \nLender (or its assignor, if any) was entitled, at the time of designation of a new lending office (or \nassignment), to receive additional amounts from an Obligor with respect to such withholding tax pursuant \nto Section 3.2(a).  For greater certainty, for purposes of item (c) above, a withholding tax includes any \nTax that a Foreign Lender is required to pay pursuant to Part XIII of the Income Tax Act (Canada) or any \nsuccessor provision thereto.1\n“Foreign Lender” means any Lender that is not organized under the laws of the jurisdiction in \nwhich the Borrower is resident for tax purposes and that is not otherwise considered or deemed in \nrespect of any amount payable to it hereunder or under any Loan Document to be resident for income tax \nor withholding tax purposes in the jurisdiction in which the Borrower is resident for tax purposes by \napplication of the laws of that jurisdiction. For purposes of this definition Canada and each Province and \nTerritory thereof shall be deemed to constitute a single jurisdiction and the United States of America, \neach State thereof and the District of Columbia shall be deemed to constitute a single jurisdiction. \n“Fund” means any Person (other than a natural person) that is (or will be) engaged in making, \npurchasing, holding or otherwise investing in commercial loans and similar extensions of credit in the \nordinary course of its business.\n“Governmental Authority” means the government of Canada or any other nation, or of any \npolitical subdivision thereof, whether state or local, and any agency, authority, instrumentality, regulatory \nbody, court, central bank or other entity exercising executive, legislative, judicial, taxing, regulatory or \nadministrative powers or functions of or pertaining to government, including any supra-national bodies \nsuch as the European Union or the European Central Bank and including a Minister of the Crown, \nSuperintendent of Financial Institutions or other comparable authority or agency. \n“Indemnified Taxes” means Taxes other than Excluded Taxes. \n\"Issuing Bank\" means the Person named elsewhere in this Agreement2 as the issuer of Letters of \nCredit on the basis that it is \"fronting\" for other Lenders and not on the basis that it is the attorney of other \nLenders to sign Letters of Credit on their behalf, or any successor issuer of Letters of Credit.  For greater \ncertainty, where the context requires, references to \"Lenders\" in these Provisions include the Issuing \nBank.\n1 Please note that this definition of “Excluded Taxes” will result in Foreign Lenders not being grossed up for withholding taxes that \nexist at the time of execution and delivery of the Credit Agreement, except in the circumstances specified.  Accepted. \n2 Ensure that the Credit Agreement identifies the Issuing Bank or indicates that there is none. In this case, the Credit Agreement \nindicates that there is none. \n",
      "56": "- 3 - \n“Loan” means any extension of credit by a Lender under this Agreement, including by way of \nbankers' acceptance or LIBO Rate Loan, except for any Letter of Credit or participation in a Letter of \nCredit. \n\"Obligors\" means, collectively, the Borrower and each of the guarantors of the Borrower's \nobligations that are identified elsewhere in this Agreement. \n“Other Taxes” means all present or future stamp or documentary taxes or any other excise or \nproperty taxes, charges or similar levies arising from any payment made hereunder or under any other \nLoan Document or from the execution, delivery or enforcement of, or otherwise with respect to, this \nAgreement or any other Loan Document. \n“Participant” has the meaning assigned to such term in Section 10(d). \n“Person” means any natural person, corporation, limited liability company, trust, joint venture, \nassociation, company, partnership, Governmental Authority or other entity. \n\"Provisions\" means these model credit agreement provisions. \n“Related Parties” means, with respect to any Person, such Person’s Affiliates and the directors, \nofficers, employees, agents and advisors of such Person and of such Person’s Affiliates. \n“Taxes” means all present or future taxes, levies, imposts, duties, deductions, withholdings, \nassessments, fees or other charges imposed by any Governmental Authority, including any interest, \nadditions to tax or penalties applicable thereto. \n2. \nTerms Generally \n(1) \nThe definitions of terms herein shall apply equally to the singular and plural forms of the terms \ndefined. Whenever the context may require, any pronoun shall include the corresponding masculine, \nfeminine and neuter forms. The words “include”, “includes” and “including” shall be deemed to be followed \nby the phrase “without limitation”. The word “will” shall be construed to have the same meaning and effect \nas the word “shall”. Unless the context requires otherwise (a) any definition of or reference to any \nagreement, instrument or other document herein (including this Agreement) shall be construed as \nreferring to such agreement, instrument or other document as from time to time amended, supplemented, \nrestated or otherwise modified (subject to any restrictions on such amendments, supplements, \nrestatements or modifications set forth herein), (b) any reference herein to any Person shall be construed \nto include such Person’s successors and permitted assigns, (c) the words “herein”, “hereof\" and \n“hereunder”, and words of similar import, shall be construed to refer to this Agreement in its entirety and \nnot to any particular provision hereof, (d) unless otherwise expressly stated, all references in these \nProvisions to Articles, Sections, Exhibits and Schedules shall be construed to refer to Articles and \nSections of, and Exhibits and Schedules to, these Provisions, but all such references elsewhere in this \nAgreement shall be construed to refer to this Agreement apart from these Provisions, (e) any reference to \nany law or regulation herein shall, unless otherwise specified, refer to such law or regulation as amended, \nmodified or supplemented from time to time and (f) the words “asset” and “property” shall be construed to \nhave the same meaning and effect and to refer to any and all tangible and intangible assets and \nproperties, including cash, securities, accounts and contract rights. \n(2) \nIf there is any conflict or inconsistency between these Provisions and the other terms of this \nAgreement, the other terms of this Agreement shall govern to the extent necessary to resolve the conflict \nor inconsistency. \n3. \nYield Protection \n",
      "57": "- 4 - \n3.1 \nIncreased Costs. \n(a) \nIncreased Costs Generally. If any Change in Law shall: \n(i) \nimpose, modify or deem applicable any reserve, special deposit, compulsory \nloan, insurance charge or similar requirement against assets of, deposits with or for the account \nof, or credit extended or participated in by, any Lender; \n(ii) \nsubject any Lender to any Tax of any kind whatsoever with respect to this \nAgreement, any Letter of Credit, any participation in a Letter of Credit or any Loan made by it, or \nchange the basis of taxation of payments to such Lender in respect thereof, except for \nIndemnified Taxes or Other Taxes covered by Section 3.2 and the imposition, or any change in \nthe rate, of any Excluded Tax payable by such Lender; or \n(iii) \nimpose on any Lender or any applicable interbank market any other condition, \ncost or expense affecting this Agreement or Loans made by such Lender or any Letter of Credit \nor participation therein; \nand the result of any of the foregoing shall be to increase the cost to such Lender of making or \nmaintaining any Loan (or of maintaining its obligation to make any such Loan), or to increase the cost to \nsuch Lender or the Issuing Bank of participating in, issuing or maintaining any Letter of Credit (or of \nmaintaining its obligation to participate in or to issue any Letter of Credit), or to reduce the amount of any \nsum received or receivable by such Lender or the Issuing Bank hereunder (whether of principal, interest \nor any other amount), then, upon request of such Lender and subject to the provisions of Section 3.6, the \nBorrower will pay to such Lender such additional amount or amounts as will compensate such Lender for \nsuch additional costs incurred or reduction suffered.\n(b) \nCapital Requirements. If any Lender determines that any Change in Law affecting such \nLender or any lending office of such Lender or such Lender’s holding company, if any, regarding capital \nrequirements has or would have the effect of reducing the rate of return on such Lender’s capital or on \nthe capital of such Lender’s holding company, if any, as a consequence of this Agreement, the \nCommitments of such Lender or the Loans made by, or the Letters of Credit issued or participated in by \nsuch Lender, to a level below that which such Lender or its holding company could have achieved but for \nsuch Change in Law (taking into consideration such Lender’s policies and the policies of its holding \ncompany with respect to capital adequacy), then from time to time the Borrower will, subject to the \nprovisions of Section 3.6, pay to such Lender such additional amount or amounts as will compensate \nsuch Lender or its holding company for any such reduction suffered. \n(c) \nCertificates for Reimbursement. A certificate of a Lender setting forth the amount or \namounts necessary to compensate such Lender or its holding company, as the case may be, as specified \nin paragraph (a) or (b) of this Section, including reasonable detail of the basis of calculation of the amount \nor amounts, and delivered to the Borrower shall be conclusive absent manifest error. The Borrower shall \npay such Lender the amount shown as due on any such certificate within 10 days after receipt thereof. \n(d) \nDelay in Requests. Failure or delay on the part of any Lender to demand compensation \npursuant to this Section shall not constitute a waiver of such Lender’s right to demand such \ncompensation, except that the Borrower shall not be required to compensate a Lender pursuant to this \nSection for any increased costs incurred or reductions suffered more than nine months prior to the date \nthat such Lender notifies the Borrower of the Change in Law giving rise to such increased costs or \nreductions and of such Lender’s intention to claim compensation therefor, unless the Change in Law \ngiving rise to such increased costs or reductions is retroactive, in which case the nine-month period \nreferred to above shall be extended to include the period of retroactive effect thereof. \n3.2  \nTaxes. \n",
      "58": "- 5 - \n(a) \nPayments Subject to Taxes. If any Obligor, the Administrative Agent, or any Lender is \nrequired by Applicable Law to deduct or pay any Indemnified Taxes (including any Other Taxes) in \nrespect of any payment by or on account of any obligation of an Obligor hereunder or under any other \nLoan Document, then (i) the sum payable shall be increased by that Obligor when payable as necessary \nand subject to the provisions of Section 3.6 so that after making or allowing for all required deductions \nand payments (including deductions and payments applicable to additional sums payable under this \nSection) the Administrative Agent or Lender, as the case may be, receives an amount equal to the sum it \nwould have received had no such deductions or payments been required, (ii) the Obligor shall make any \nsuch deductions required to be made by it under Applicable Law and (iii) the Obligor shall timely pay the \nfull amount required to be deducted to the relevant Governmental Authority in accordance with Applicable \nLaw. \n(b) \nPayment of Other Taxes by the Borrower. Without limiting the provisions of paragraph (a) \nabove, the Borrower shall, subject to the provisions of Section 3.6, timely pay any Other Taxes to the \nrelevant Governmental Authority in accordance with Applicable Law. \n(c) \nIndemnification by the Borrower. The Borrower shall, subject to the provisions of Section \n3.6, indemnify the Administrative Agent and each Lender, within 10 days after demand therefor, for the \nfull amount of any Indemnified Taxes or Other Taxes (including Indemnified Taxes or Other Taxes \nimposed or asserted on or attributable to amounts payable under this Section) paid by the Administrative \nAgent or such Lender and any penalties, interest and reasonable expenses arising therefrom or with \nrespect thereto, whether or not such Indemnified Taxes or Other Taxes were correctly or legally imposed \nor asserted by the relevant Governmental Authority. A certificate as to the amount of such payment or \nliability delivered to the Borrower by a Lender (with a copy to the Administrative Agent), or by the \nAdministrative Agent on its own behalf or on behalf of a Lender, shall be conclusive absent manifest \nerror. \n(d) \nEvidence of Payments. As soon as practicable after any payment of Indemnified Taxes or \nOther Taxes by an Obligor to a Governmental Authority, the Obligor shall deliver to the Administrative \nAgent the original or a certified copy of a receipt issued by such Governmental Authority evidencing such \npayment, a copy of the return reporting such payment or other evidence of such payment reasonably \nsatisfactory to the Administrative Agent. \n(e) \nStatus of Lenders. Any Foreign Lender that is entitled to an exemption from or reduction \nof withholding tax under the law of the jurisdiction in which the Borrower is resident for tax purposes, or \nany treaty to which such jurisdiction is a party, with respect to payments hereunder or under any other \nLoan Document shall, at the request of the Borrower, deliver to the Borrower (with a copy to the \nAdministrative Agent), at the time or times prescribed by Applicable Law or reasonably requested by the \nBorrower or the Administrative Agent, such properly completed and executed documentation prescribed \nby Applicable Law as will permit such payments to be made without withholding or at a reduced rate of \nwithholding. In addition, (a) any Lender, if requested by the Borrower or the Administrative Agent, shall \ndeliver such other documentation prescribed by Applicable Law or reasonably requested by the Borrower \nor the Administrative Agent as will enable the Borrower or the Administrative Agent to determine whether \nor not such Lender is subject to withholding or information reporting requirements, and (b) any Lender \nthat ceases to be, or to be deemed to be, resident in Canada for purposes of Part XIII of the Income Tax \nAct (Canada) or any successor provision thereto shall within five days thereof notify the Borrower and the \nAdministrative Agent in writing. \n(f) \nTreatment of Certain Refunds and Tax Reductions. If the Administrative Agent or a \nLender determines, in its sole discretion, that it has received a refund of any Taxes or Other Taxes as to \nwhich it has been indemnified by the Borrower or with respect to which an Obligor has paid additional \namounts pursuant to this Section or that, because of the payment of such Taxes or Other Taxes, it has \nbenefited from a reduction in Excluded Taxes otherwise payable by it, it shall pay to the Borrower or \nObligor, as applicable, an amount equal to such refund or reduction (but only to the extent of indemnity \n",
      "59": "- 6 - \npayments made, or additional amounts paid, by the Borrower or Obligor under this Section with respect to \nthe Taxes or Other Taxes giving rise to such refund or reduction), net of all out-of-pocket expenses of the \nAdministrative Agent or such Lender, as the case may be, and without interest (other than any net after-\nTax interest paid by the relevant Governmental Authority with respect to such refund).  The Borrower or \nObligor as applicable, upon the request of the Administrative Agent or such Lender, agrees to repay the \namount paid over to the Borrower or Obligor (plus any penalties, interest or other charges imposed by the \nrelevant Governmental Authority) to the Administrative Agent or such Lender if the Administrative Agent \nor such Lender is required to repay such refund or reduction to such Governmental Authority. This \nparagraph shall not be construed to require the Administrative Agent or any Lender to make available its \ntax returns (or any other information relating to its taxes that it deems confidential) to the Borrower or any \nother Person, to arrange its affairs in any particular manner or to claim any available refund or reduction.   \n3.3 \nMitigation Obligations: Replacement of Lenders. \n(a) \nDesignation of a Different Lending Office. If any Lender requests compensation under \nSection3.1, or requires the Borrower to pay any additional amount to any Lender or any Governmental \nAuthority for the account of any Lender pursuant to Section 3.2 , then such Lender shall use reasonable \nefforts to designate a different lending office for funding or booking its Loans hereunder or to assign its \nrights and obligations hereunder to another of its offices, branches or affiliates, if, in the judgment of such \nLender, such designation or assignment (i) would eliminate or reduce amounts payable pursuant to \nSection 3.1 or 3.2, as the case may be, in the future and (ii) would not subject such Lender to any \nunreimbursed cost or expense and would not otherwise be disadvantageous to such Lender. The \nBorrower hereby agrees to pay all reasonable costs and expenses incurred by any Lender in connection \nwith any such designation or assignment. \n(b) \nReplacement of Lenders.3 If any Lender requests compensation under Section3.1, if the \nBorrower is required to pay any additional amount to any Lender or any Governmental Authority for the \naccount of any Lender pursuant to Section 3.2, if any Lender's obligations are suspended pursuant to \nSection 3.4 or if any Lender defaults in its obligation to fund Loans hereunder, then the Borrower may, at \nits sole expense and effort, upon 10 days’ notice to such Lender and the Administrative Agent, require \nsuch Lender to assign and delegate, without recourse (in accordance with and subject to the restrictions \ncontained in, and consents required by, Section 10), all of its interests, rights and obligations under this \nAgreement and the related Loan Documents to an assignee that shall assume such obligations (which \nassignee may be another Lender, if a Lender accepts such assignment), provided that: \n(i) \nthe Borrower pays the Administrative Agent the assignment fee specified in \nSection10(b)(vi); \n(ii) \nthe assigning Lender receives payment of an amount equal to the outstanding \nprincipal of its Loans and participations in disbursements under Letters of Credit, accrued interest \nthereon, accrued fees and all other amounts payable to it hereunder and under the other Loan \nDocuments (including any breakage costs and amounts required to be paid under this Agreement \nas a result of prepayment to a Lender) from the assignee (to the extent of such outstanding \nprincipal and accrued interest and fees) or the Borrower (in the case of all other amounts); \n(iii) \nin the case of any such assignment resulting from a claim for compensation \nunder Section 3.1 or payments required to be made pursuant to Section 3.2, such assignment will \nresult in a reduction in such compensation or payments thereafter; and \n(iv) \nsuch assignment does not conflict with Applicable Law. \n3 Please note that the Breakfunding section in the Credit Agreement should expressly include any amounts payable as a result of \nan assignment required by this Section. As Loans are restricted to Prime Rate Loans, this issue does not arise.\n",
      "60": "- 7 - \nA Lender shall not be required to make any such assignment or delegation if, prior thereto, as a result of \na waiver by such Lender or otherwise, the circumstances entitling the Borrower to require such \nassignment and delegation cease to apply. \n3.4 \nIllegality. \nIf any Lender determines that any Applicable Law has made it unlawful, or that any Governmental \nAuthority has asserted that it is unlawful, for any Lender or its applicable Lending Office to make or \nmaintain any Loan (or to maintain its obligation to make any Loan), or to participate in, issue or maintain \nany Letter of Credit (or to maintain its obligation to participate in or to issue any Letter of Credit), or to \ndetermine or charge interest rates based upon any particular rate, then, on notice thereof by such Lender \nto the Borrower through the Administrative Agent, any obligation of such Lender with respect to the \nactivity that is unlawful shall be suspended until such Lender notifies the Administrative Agent and the \nBorrower that the circumstances giving rise to such determination no longer exist.  Upon receipt of such \nnotice, the Borrower shall, upon demand from such Lender (with a copy to the Administrative Agent) and \nsubject to the provisions of Section 3.6, prepay or, if conversion would avoid the activity that is unlawful, \nconvert any Loans, or take any necessary steps with respect to any Letter of Credit in order to avoid the \nactivity that is unlawful.  Upon any such prepayment or conversion, the Borrower shall, subject to the \nprovisions of Section 3.6, also pay accrued interest on the amount so prepaid or converted.  Each Lender \nagrees to designate a different Lending Office if such designation will avoid the need for such notice and \nwill not, in the good faith judgment of such Lender, otherwise be materially disadvantageous to such \nLender. \n3.5 \nInability to Determine Rates Etc. \nIf the Required Lenders determine that for any reason a market for bankers' acceptances does not exist \nat any time or the Lenders cannot for other reasons, after reasonable efforts, readily sell bankers' \nacceptances or perform their other obligations under this Agreement with respect to bankers' \nacceptances, the Administrative Agent will promptly so notify the Borrower and each Lender.  Thereafter, \nthe Borrower's right to request the acceptance of bankers' acceptances shall be and remain suspended \nuntil the Required Lenders determine and the Agent notifies the Borrower and each Lender that the \ncondition causing such determination no longer exists.  If the Required Lenders determine that for any \nreason adequate and reasonable means do not exist for determining the LIBO Rate for any requested \nInterest Period with respect to a proposed LIBO Rate Loan, or that the LIBO Rate for any requested \nInterest Period with respect to a proposed LIBO Rate Loan does not adequately and fairly reflect the cost \nto such Lenders of funding such Loan, the Administrative Agent will promptly so notify the Borrower and \neach Lender.  Thereafter, the obligation of the Lenders to make or maintain LIBO Rate Loans shall be \nsuspended until the Administrative Agent (upon the instruction of the Required Lenders) revokes such \nnotice.  Upon receipt of such notice, the Borrower may revoke any pending request for a borrowing, \nconversion or continuation of LIBO Rate Loans or, failing that, will be deemed to have converted such \nrequest into a request for a borrowing of Base Rate Loans in the amount specified therein. \n3.6 \nOverriding Payment Qualification. \nWithout limiting the generality of Section 5.01 of this Agreement, the Borrower shall not be required to \nmake any payment under Section 3.1 to 3.5 or under Section 9 except out of and from Proceeds for \nDistribution as and when such Proceeds for Distribution become available for distribution by the Borrower\nto the Lenders in the UC Receivership Proceedings. \n4. \nRight of Setoff. \nIf an Event of Default has occurred and is continuing, each of the Lenders and each of their respective \nAffiliates is hereby authorized at any time and from time to time to set off and apply any and all deposits \n(general or special, time or demand, provisional or final, in whatever currency) at any time held and other \n",
      "61": "- 8 - \nobligations (in whatever currency) at any time owing by such Lender or any such Affiliate to or for the \ncredit or the account of any Obligor against any and all of the obligations of the Borrower now or hereafter \nexisting under this Agreement or any other Loan Document to such Lender, irrespective of whether or not \nsuch Lender has made any demand under this Agreement or any other Loan Document and although \nsuch obligations of the Obligor may be contingent or unmatured or are owed to a branch or office of such \nLender different from the branch or office holding such deposit or obligated on such indebtedness. The \nrights of each the Lenders and their respective Affiliates under this Section are in addition to other rights \nand remedies (including other rights of setoff, consolidation of accounts and bankers' lien) that the \nLenders or their respective Affiliates may have. Each Lender agrees to promptly notify the Borrower and \nthe Administrative Agent after any such setoff and application, but the failure to give such notice shall not \naffect the validity of such setoff and application.  If any Affiliate of a Lender exercises any rights under this \nSection 4, it shall share the benefit received in accordance with Section 5 as if the benefit had been \nreceived by the Lender of which it is an Affiliate.\n5. \nSharing of Payments by Lenders. \nIf any Lender, by exercising any right of setoff or counterclaim or otherwise, obtains any payment or other \nreduction that might result in such Lender receiving payment or other reduction of a proportion of the \naggregate amount of its Loans and accrued interest thereon or other obligations hereunder greater than \nits pro rata share thereof as provided herein, then the Lender receiving such payment or other reduction \nshall (a) notify the Administrative Agent of such fact, and (b) purchase (for cash at face value) \nparticipations in the Loans and such other obligations of the other Lenders, or make such other \nadjustments as shall be equitable, so that the benefit of all such payments shall be shared by the Lenders \nrateably in accordance with the aggregate amount of principal of and accrued interest on their respective \nLoans and other amounts owing them, provided that \n(i) \nif any such participations are purchased and all or any portion of the payment \ngiving rise thereto is recovered, such participations shall be rescinded and the purchase price \nrestored to the extent of such recovery, without interest,  \n(ii) \nthe provisions of this Section shall not be construed to apply to (x) any payment \nmade by any Obligor pursuant to and in accordance with the express terms of this Agreement or \n(y) any payment obtained by a Lender as consideration for the assignment of or sale of a \nparticipation in any of its Loans or participations in disbursements under Letters of Credit to any \nassignee or participant, other than to any Obligor or any Affiliate of an Obligor (as to which the \nprovisions of this Section shall apply); and \n(iii) \nthe provisions of this Section shall not be construed to apply to (w) any payment \nmade while no Event of Default has occurred and is continuing in respect of obligations of the \nBorrower to such Lender that do not arise under or in connection with the Loan Documents, (x) \nany payment made in respect of an obligation that is secured by a Permitted Lien or that is \notherwise entitled to priority over the Borrower's obligations under or in connection with the Loan \nDocuments, (y) any reduction arising from an amount owing to an Obligor upon the termination of \nderivatives entered into between the Obligor and such Lender4, or (z) any payment to which such \nLender is entitled as a result of any form of credit protection obtained by such Lender. \nThe Obligors consent to the foregoing and agree, to the extent they may effectively do so under \nApplicable Law, that any Lender acquiring a participation pursuant to the foregoing arrangements may \n4 Those preparing Credit Agreements should consider whether this exclusion of proceeds of derivatives is appropriate in the \nparticular circumstances of the Credit Agreement.  It may be appropriate to provide for sharing of, for example, any net amount \navailable after the termination of all derivatives entered into between the Obligors and a Lender and the setoff of resulting amounts \nowing by the Obligors and to the Obligors if there is more than one such derivative.  This issue is not relevant here where the is no \nhedging. \n",
      "62": "- 9 - \nexercise against each Obligor rights of setoff and counterclaim and similar rights of Lenders with respect \nto such participation as fully as if such Lender were a direct creditor of each Obligor in the amount of such \nparticipation. \n6. \nAdministrative Agent’s Clawback \n(a) \nFunding by Lenders; Presumption by Administrative Agent. Unless the Administrative \nAgent shall have received notice from a Lender prior to the proposed date of any advance of funds that \nsuch Lender will not make available to the Administrative Agent such Lender’s share of such advance, \nthe Administrative Agent may assume that such Lender has made such share available on such date in \naccordance with the provisions of this Agreement concerning funding by Lenders and may, in reliance \nupon such assumption, make available to the Borrower a corresponding amount. In such event, if a \nLender has not in fact made its share of the applicable advance available to the Administrative Agent, \nthen the applicable Lender shall pay to the Administrative Agent forthwith on demand such corresponding \namount with interest thereon, for each day from and including the date such amount is made available to \nthe Borrower to but excluding the date of payment to the Administrative Agent, at a rate determined by \nthe Administrative Agent in accordance with prevailing banking industry practice on interbank \ncompensation.  If such Lender pays such amount to the Administrative Agent, then such amount shall \nconstitute such Lender’s Loan included in such advance. If the Lender does not do so forthwith, the \nBorrower shall pay to the Administrative Agent forthwith on demand such corresponding amount with \ninterest thereon at the interest rate applicable to the advance in question. Any payment by the Borrower \nshall be without prejudice to any claim the Borrower may have against a Lender that has failed to make \nsuch payment to the Administrative Agent. \n(b) \nPayments by Borrower; Presumptions by Administrative Agent. Unless the Administrative \nAgent shall have received notice from the Borrower prior to the date on which any payment is due to the \nAdministrative Agent for the account of any Lender hereunder that the Borrower will not make such \npayment, the Administrative Agent may assume that the Borrower has made such payment on such date \nin accordance herewith and may, in reliance upon such assumption, distribute the amount due to the \nLenders. In such event, if the Borrower has not in fact made such payment, then each of the Lenders \nseverally agrees to repay to the Administrative Agent forthwith on demand the amount so distributed to \nsuch Lender with interest thereon, for each day from and including the date such amount is distributed to \nit to but excluding the date of payment to the Administrative Agent, at a rate determined by the \nAdministrative Agent in accordance with prevailing banking industry practice on interbank compensation. \n7. \nAgency. \n7.1 \nAppointment and Authority. Each of the Lenders and the Issuing Bank hereby irrevocably \nappoints the Person identified elsewhere in this Agreement as the Administrative Agent5 to act on its \nbehalf as the Administrative Agent hereunder and under the other Loan Documents and authorizes the \nAdministrative Agent to take such actions on its behalf and to exercise such powers as are delegated to \nthe Administrative Agent by the terms hereof or thereof, together with such actions and powers as are \nreasonably incidental thereto. The provisions of this Article are solely for the benefit of the Administrative \nAgent, the Lenders and the Issuing Bank, and no Obligor shall have rights as a third party beneficiary of \nany of such provisions. \n7.2 \nRights as a Lender. The Person serving as the Administrative Agent hereunder shall have the \nsame rights and powers in its capacity as a Lender as any other Lender and may exercise the same as \nthough it were not the Administrative Agent and the term “Lender” or “Lenders” shall, unless otherwise \nexpressly indicated or unless the context otherwise requires, include the Person serving as the \n5 Ensure that the Credit Agreement identifies the Administrative Agent for the purpose of this reference. The Credit Agreement does \nso. \n",
      "63": "- 10 - \nAdministrative Agent hereunder in its individual capacity. Such Person and its Affiliates may accept \ndeposits from, lend money to, act as the financial advisor or in any other advisory capacity for and \ngenerally engage in any kind of business with any Obligor or any Affiliate thereof as if such Person were \nnot the Administrative Agent and without any duty to account to the Lenders. \n7.3 \nExculpatory Provisions.  \n(1) \nThe Administrative Agent shall not have any duties or obligations except those expressly set forth \nherein and in the other Loan Documents.6 Without limiting the generality of the foregoing, the \nAdministrative Agent: \n(a) \nshall not be subject to any fiduciary or other implied duties, regardless of whether a \nDefault has occurred and is continuing; \n(b) \nshall not have any duty to take any discretionary action or exercise any discretionary \npowers, except discretionary rights and powers expressly contemplated hereby or by the other \nLoan Documents that the Administrative Agent is required to exercise as directed in writing by the \nRequired Lenders (or such other number or percentage of the Lenders as shall be expressly \nprovided for in the Loan Documents), but the Administrative Agent shall not be required to take \nany action that, in its opinion or the opinion of its counsel, may expose the Administrative Agent \nto liability or that is contrary to any Loan Document or Applicable Law; and \n(c) \nshall not, except as expressly set forth herein and in the other Loan Documents, have \nany duty to disclose, and shall not be liable for the failure to disclose, any information relating to \nthe Borrower or any of its Affiliates that is communicated to or obtained by the person serving as \nthe Administrative Agent or any of its Affiliates in any capacity. \n(2) \nThe Administrative Agent shall not be liable for any action taken or not taken by it (i) with the \nconsent or at the request of the Required Lenders (or such other number or percentage of the Lenders as \nis necessary, or as the Administrative Agent believes in good faith is necessary, under the provisions of \nthe Loan Documents) or (ii) in the absence of its own gross negligence or wilful misconduct. The \nAdministrative Agent shall be deemed not to have knowledge of any Default unless and until notice \ndescribing the Default is given to the Administrative Agent by the Borrower or a Lender. \n(3) \nExcept as otherwise expressly specified in this Agreement, the Administrative Agent shall not be \nresponsible for or have any duty to ascertain or inquire into (i) any statement, warranty or representation \nmade in or in connection with this Agreement or any other Loan Document, (ii) the contents of any \ncertificate, report or other document delivered hereunder or thereunder or in connection herewith or \ntherewith, (iii) the performance or observance of any of the covenants, agreements or other terms or \nconditions set forth herein or therein or the occurrence of any Default, (iv) the validity, enforceability, \neffectiveness or genuineness of this Agreement, any other Loan Document or any other agreement, \ninstrument or document or (v) the satisfaction of any condition specified in this Agreement, other than to \nconfirm receipt of items expressly required to be delivered to the Administrative Agent.\n7.4 \nReliance by Administrative Agent. The Administrative Agent shall be entitled to rely upon, and \nshall not incur any liability for relying upon, any notice, request, certificate, consent, statement, \ninstrument, document or other writing (including any electronic message, Internet or intranet posting or \nother distribution) believed by it to be genuine and to have been signed, sent or otherwise authenticated \nby the proper Person. The Administrative Agent also may rely upon any statement made to it orally or by \ntelephone and believed by it to have been made by the proper Person, and shall not incur any liability for \n6 It is anticipated that the Credit Agreement will require the Borrower to be responsible for compliance with all requirements to \nmaintain perfection of security.  This will not be the case in this transaction as the security will take the form of a court-ordered \ncharge. \n",
      "64": "- 11 - \nrelying thereon. In determining compliance with any condition hereunder to the making of a Loan, or the \nissuance of a Letter of Credit, that by its terms must be fulfilled to the satisfaction of a Lender or the \nIssuing Bank, the Administrative Agent may presume that such condition is satisfactory to such Lender or \nthe Issuing Bank unless the Administrative Agent shall have received notice to the contrary from such \nLender or the Issuing Bank prior to the making of such Loan or the issuance of such Letter of Credit. The \nAdministrative Agent may consult with legal counsel (who may be counsel for the Borrower), independent \naccountants and other experts selected by it, and shall not be liable for any action taken or not taken by it \nin accordance with the advice of any such counsel, accountants or experts. \n7.5 \nIndemnification of Administrative Agent. Each Lender agrees to indemnify the Administrative \nAgent and hold it harmless (to the extent not reimbursed by the Borrower), rateably according to its \nApplicable Percentage (and not jointly or jointly and severally) from and against any and all losses, \nclaims, damages, liabilities and related expenses, including the fees, charges and disbursements of any \ncounsel, which may be incurred by or asserted against the Administrative Agent in any way relating to or \narising out of the Loan Documents or the transactions therein contemplated.  However, no Lender shall \nbe liable for any portion of such losses, claims, damages, liabilities and related expenses resulting from \nthe Administrative Agent’s gross negligence or wilful misconduct. \n7.6 \nDelegation of Duties. The Administrative Agent may perform any and all of its duties and exercise \nits rights and powers hereunder or under any other Loan Document by or through any one or more sub-\nagents appointed by the Administrative Agent from among the Lenders (including the Person serving as \nAdministrative Agent) and their respective Affiliates. The Administrative Agent and any such sub-agent \nmay perform any and all of its duties and exercise its rights and powers by or through their respective \nRelated Parties. The provisions of this Article and other provisions of this Agreement for the benefit of the \nAdministrative Agent shall apply to any such sub-agent and to the Related Parties of the Administrative \nAgent and any such sub-agent, and shall apply to their respective activities in connection with the \nsyndication of the credit facilities provided for herein as well as activities as Administrative Agent. \n7.7 \nReplacement of Administrative Agent.  \n(1) \nThe Administrative Agent may at any time give notice of its resignation to the Lenders, the Issuing \nBank and the Borrower. Upon receipt of any such notice of resignation, the Required Lenders shall have \nthe right, in consultation with the Borrower, to appoint a successor, which shall be a Lender having a \nCommitment to a revolving credit if one or more is established in this Agreement and having an office in \nToronto, Ontario or Montréal, Québec, or an Affiliate of any such Lender with an office in Toronto or \nMontréal. The Administrative Agent may also be removed at any time by the Required Lenders upon 30 \ndays' notice to the Administrative Agent and the Borrower as long as the Required Lenders, in \nconsultation with the Borrower, appoint and obtain the acceptance of a successor within such 30 days, \nwhich shall be a Lender having a Commitment to a revolving credit if one or more is established in this \nAgreement and having an office in Toronto or Montréal, or an Affiliate of any such Lender with an office in \nToronto or Montréal. \n(2) \nIf no such successor shall have been so appointed by the Required Lenders and shall have \naccepted such appointment within 30 days after the retiring Administrative Agent gives notice of its \nresignation, then the retiring Administrative Agent may on behalf of the Lenders, appoint a successor \nAdministrative Agent meeting the qualifications specified in Section 7.7(1), provided that if the \nAdministrative Agent shall notify the Borrower and the Lenders that no qualifying Person has accepted \nsuch appointment, then such resignation shall nonetheless become effective in accordance with such \nnotice and (1) the retiring Administrative Agent shall be discharged from its duties and obligations \nhereunder and under the other Loan Documents (except that in the case of any collateral security held by \nthe Administrative Agent on behalf of the Lenders under any of the Loan Documents, the retiring \nAdministrative Agent shall continue to hold such collateral security until such time as a successor \nAdministrative Agent is appointed) and (2) all payments, communications and determinations provided to \nbe made by, to or through the Administrative Agent shall instead be made by or to each Lender directly, \n",
      "65": "- 12 - \nuntil such time as the Required Lenders appoint a successor Administrative Agent as provided for above \nin the preceding paragraph.  \n(3) \nUpon a successor’s appointment as Administrative Agent hereunder, such successor shall \nsucceed to and become vested with all of the rights, powers, privileges and duties of the former \nAdministrative Agent, and the former Administrative Agent shall be discharged from all of its duties and \nobligations hereunder or under the other Loan Documents (if not already discharged therefrom as \nprovided in the preceding paragraph). The fees payable by the Borrower to a successor Administrative \nAgent shall be the same as those payable to its predecessor unless otherwise agreed between the \nBorrower and such successor. After the termination of the service of the former Administrative Agent, the \nprovisions of this Section 7 and of Section 9 shall continue in effect for the benefit of such former \nAdministrative Agent, its sub-agents and their respective Related Parties in respect of any actions taken \nor omitted to be taken by any of them while the former Administrative Agent was acting as Administrative \nAgent. \n7.8  \nNon-Reliance on Administrative Agent and Other Lenders. Each Lender and the Issuing Bank \nacknowledges that it has, independently and without reliance upon the Administrative Agent or any other \nLender or any of their Related Parties and based on such documents and information as it has deemed \nappropriate, made its own credit analysis and decision to enter into this Agreement. Each Lender and the \nIssuing Bank also acknowledges that it will, independently and without reliance upon the Administrative \nAgent or any other Lender or any of their Related Parties and based on such documents and information \nas it shall from time to time deem appropriate, continue to make its own decisions in taking or not taking \naction under or based upon this Agreement, any other Loan Document or any related agreement or any \ndocument furnished hereunder or thereunder. \n7.9 \nCollective Action of the Lenders. Each of the Lenders hereby acknowledges that to the extent \npermitted by Applicable Law, any collateral security and the remedies provided under the Loan \nDocuments to the Lenders are for the benefit of the Lenders collectively and acting together and not \nseverally and further acknowledges that its rights hereunder and under any collateral security are to be \nexercised not severally, but by the Administrative Agent upon the decision of the Required Lenders (or \nsuch other number or percentage of the Lenders as shall be expressly provided for in the Loan \nDocuments).  Accordingly, notwithstanding any of the provisions contained herein or in any collateral \nsecurity, each of the Lenders hereby covenants and agrees that it shall not be entitled to take any action \nhereunder or thereunder including, without limitation, any declaration of default hereunder or thereunder \nbut that any such action shall be taken only by the Administrative Agent with the prior written agreement \nof the Required Lenders (or such other number or percentage of the Lenders as shall be expressly \nprovided for in the Loan Documents).  Each of the Lenders hereby further covenants and agrees that \nupon any such written agreement being given, it shall co-operate fully with the Administrative Agent to the \nextent requested by the Administrative Agent. Notwithstanding the foregoing, in the absence of \ninstructions from the Lenders and where in the sole opinion of the Administrative Agent, acting \nreasonably and in good faith, the exigencies of the situation warrant such action, the Administrative Agent \nmay without notice to or consent of the Lenders take such action on behalf of the Lenders as it deems \nappropriate or desirable in the interest of the Lenders. \n7.10 \nNo Other Duties. etc. Anything herein to the contrary notwithstanding, none of the Bookrunners, \nArrangers or holders of similar titles, if any, specified in this Agreement shall have any powers, duties or \nresponsibilities under this Agreement or any of the other Loan Documents, except in its capacity, as \napplicable, as the Administrative Agent or a Lender hereunder. \n8. \nNotices: Effectiveness; Electronic Communication \n(a) \nNotices Generally. Except in the case of notices and other communications expressly \npermitted to be given by telephone (and except as provided in paragraph (b) below), all notices and other \ncommunications provided for herein shall be in writing and shall be delivered by hand or overnight courier \n",
      "66": "- 13 - \nservice, mailed by certified or registered mail or sent by telecopier to the addresses or telecopier numbers \nspecified elsewhere in this Agreement7 or, if to a Lender, to it at its address or telecopier number \nspecified in the Register or, if to an Obligor other than the Borrower, in care of the Borrower. \nNotices sent by hand or overnight courier service, or mailed by certified or registered mail, shall \nbe deemed to have been given when received; notices sent by telecopier shall be deemed to have been \ngiven when sent (except that, if not given on a business day between 9:00 a.m. and 5:00 p.m. local time \nwhere the recipient is located, shall be deemed to have been given at 9:00 a.m. on the next business day \nfor the recipient). Notices delivered through electronic communications to the extent provided in \nparagraph (b) below, shall be effective as provided in said paragraph (b). \n(b) \nElectronic Communications. Notices and other communications to the Lenders and the \nIssuing Bank hereunder may be delivered or furnished by electronic communication (including e-mail and \nInternet or intranet websites) pursuant to procedures approved by the Administrative Agent,8 provided \nthat the foregoing shall not apply to notices to any Lender of Loans to be made or Letters of Credit to be \nissued if such Lender has notified the Administrative Agent that it is incapable of receiving notices under \nsuch Article by electronic communication. The Administrative Agent or the Borrower may, in its discretion, \nagree to accept notices and other communications to it hereunder by electronic communications pursuant \nto procedures approved by it, provided that approval of such procedures may be limited to particular \nnotices or communications. \nUnless the Administrative Agent otherwise prescribes, (i) notices and other communications sent \nto an e-mail address shall be deemed received upon the sender’s receipt of an acknowledgement from \nthe intended recipient (such as by the “return receipt requested” function, as available, return e-mail or \nother written acknowledgement), provided that if such notice or other communication is not sent during \nthe normal business hours of the recipient, such notice or communication shall be deemed to have been \nsent at the opening of business on the next business day for the recipient, and (ii) notices or \ncommunications posted to an Internet or intranet website shall be deemed received upon the deemed \nreceipt by the intended recipient at its e-mail address as described in the foregoing clause (i) of \nnotification that such notice or communication is available and identifying the website address therefor.\n(c) \nChange of Address. Etc. Any party hereto may change its address or telecopier number \nfor notices and other communications hereunder by notice to the other parties hereto.   \n9. \nExpenses; Indemnity: Damage Waiver 9\n(a) \nCosts and Expenses. The Borrower shall, subject to the provisions of Section 3.6, pay (i) \nall reasonable out-of-pocket expenses incurred by the Administrative Agent and its Affiliates, including the \nreasonable fees, charges and disbursements of counsel for the Administrative Agent, in connection with \nthe syndication of the credit facilities provided for herein, the preparation, negotiation, execution, delivery \nand administration of this Agreement and the other Loan Documents or any amendments, modifications \nor waivers of the provisions hereof or thereof (whether or not the transactions contemplated hereby or \nthereby shall be consummated), (ii) all reasonable out-of-pocket expenses incurred by the Issuing Bank in \nconnection with the issuance, amendment, renewal or extension of any Letter of Credit or any demand for \npayment thereunder and (iii) all reasonable out-of-pocket expenses incurred by the Administrative Agent, \nany Lender or the Issuing Bank, including the reasonable fees, charges and disbursements of counsel, in \nconnection with the enforcement or protection of its rights in connection with this Agreement and the other \nLoan Documents, including its rights under this Section, or in connection with the Loans made or Letters \n7  Ensure that the Credit Agreement contains the contact information referred to.  Confirmed. \n8 Administrative Agents may wish to prescribe procedures for electronic communications and to disseminate those procedures to \nLenders. Not required in this instance. \n9  A reference to this Section should be included in the Survival Section, if any, of the Credit Agreement. Confirmed. \n",
      "67": "- 14 - \nof Credit issued hereunder, including all such out-of-pocket expenses incurred during any workout, \nrestructuring or negotiations in respect of such Loans or Letters of Credit.\n(b) \nIndemnification by the Borrower. The Borrower shall, subject to the provisions of Section \n3.6, indemnify the Administrative Agent (and any sub-agent thereof), each Lender and the Issuing Bank, \nand each Related Party of any of the foregoing Persons (each such Person being called an \n“Indemnitee”) against, and hold each Indemnitee harmless from, any and all losses, claims, damages, \nliabilities and related expenses, including the fees, charges and disbursements of any counsel for any \nIndemnitee, incurred by any Indemnitee or asserted against any Indemnitee by any third party or by any \nObligor arising out of, in connection with, or as a result of (i) the execution or delivery of this Agreement, \nany other Loan Document or any agreement or instrument contemplated hereby or thereby, the \nperformance or non-performance by the parties hereto of their respective obligations hereunder or \nthereunder or the consummation or non-consummation of the transactions contemplated hereby or \nthereby, (ii) any Loan or Letter of Credit or the use or proposed use of the proceeds therefrom (including \nany refusal by the Issuing Bank to honor a demand for payment under a Letter of Credit if the documents \npresented in connection with such demand do not strictly comply with the terms of such Letter of Credit), \n(iii) any actual or alleged presence or Release of Hazardous Materials on or from any property owned or \noperated by any Obligor, or any Environmental Liability related in any way to any Obligor, or (iv) any \nactual or prospective claim, litigation, investigation or proceeding relating to any of the foregoing, whether \nbased on contract, tort or any other theory, whether brought by a third party or by an Obligor and \nregardless of whether any Indemnitee is a party thereto, provided that such indemnity shall not, as to any \nIndemnitee, be available to the extent that such losses, claims, damages, liabilities or related expenses \n(x) are determined by a court of competent jurisdiction by final and nonappealable judgment to have \nresulted from the gross negligence or wilful misconduct of such Indemnitee or (y) result from a claim \nbrought by the Borrower or any other Obligor against an Indemnitee for breach in bad faith of such \nIndemnitee's obligations hereunder or under any other Loan Document, if the Obligor has obtained a final \nand nonappealable judgment in its favour on such claim as determined by a court of competent \njurisdiction, nor shall it be available in respect of matters specifically addressed in Sections 3.1, 3.2 and \n9(a). \n(c) \nReimbursement by Lenders. To the extent that the Borrower for any reason fails to \nindefeasibly pay any amount required under paragraph (a) or (b) of this Section to be paid by it to the \nAdministrative Agent (or any sub-agent thereof), the Issuing Bank or any Related Party of any of the \nforegoing, each Lender severally agrees to pay to the Administrative Agent (or any such sub-agent), the \nIssuing Bank or such Related Party, as the case may be, such Lender’s Applicable Percentage \n(determined as of the time that the applicable unreimbursed expense or indemnity payment is sought) of \nsuch unpaid amount, provided that the unreimbursed expense or indemnified loss, claim, damage, liability \nor related expense, as the case may be, was incurred by or asserted against the Administrative Agent (or \nany such sub-agent) or the Issuing Bank in its capacity as such, or against any Related Party of any of \nthe foregoing acting for the Administrative Agent (or any such sub-agent) or Issuing Bank in connection \nwith such capacity. The obligations of the Lenders under this paragraph (c) are subject to the other \nprovisions of this Agreement concerning several liability of the Lenders. \n(d) \nWaiver of Consequential Damages. Etc. To the fullest extent permitted by Applicable \nLaw, the Obligors shall not assert, and hereby waive, any claim against any Indemnitee, on any theory of \nliability, for indirect, consequential, punitive, aggravated or exemplary damages (as opposed to direct \ndamages) arising out of, in connection with, or as a result of, this Agreement, any other Loan Document \nor any agreement or instrument contemplated hereby (or any breach thereof), the transactions \ncontemplated hereby or thereby, any Loan or Letter of Credit or the use of the proceeds thereof. No \nIndemnitee shall be liable for any damages arising from the use by unintended recipients of any \ninformation or other materials distributed by it through telecommunications, electronic or other information \ntransmission systems in connection with this Agreement or the other Loan Documents or the transactions \ncontemplated hereby or thereby. \n",
      "68": "- 15 - \n(e) \nPayments. All amounts due under this Section shall, subject to the provisions of Section \n3.6, be payable promptly after demand therefor.  A certificate of the Administrative Agent or a Lender \nsetting forth the amount or amounts owing to the Administrative Agent, Lender or a sub-agent or Related \nParty, as the case may be, as specified in this Section, including reasonable detail of the basis of \ncalculation of the amount or amounts, and delivered to the Borrower shall be conclusive absent manifest \nerror. \n10 \nSuccessors and Assigns \n(a) \nSuccessors and Assigns Generally. The provisions of this Agreement shall be binding \nupon and inure to the benefit of the parties hereto and their respective successors and assigns permitted \nhereby, except that no Obligor may assign or otherwise transfer any of its rights or obligations hereunder \nwithout the prior written consent of the Administrative Agent and each Lender and no Lender may assign \nor otherwise transfer any of its rights or obligations hereunder except (i) to an Eligible Assignee in \naccordance with the provisions of paragraph (b) of this Section, (ii) by way of participation in accordance \nwith the provisions of paragraph (d) of this Section, or (iii) by way of pledge or assignment of a security \ninterest subject to the restrictions of paragraph (f) of this Section (and any other attempted assignment or \ntransfer by any party hereto shall be null and void). Nothing in this Agreement, expressed or implied, shall \nbe construed to confer upon any Person (other than the parties hereto, their respective successors and \nassigns permitted hereby, Participants to the extent provided in paragraph (d) of this Section and, to the \nextent expressly contemplated hereby, the Related Parties of each of the Administrative Agent and the \nLenders) any legal or equitable right, remedy or claim under or by reason of this Agreement. \n(b) \nAssignments by Lenders. Any Lender may at any time assign to one or more Eligible \nAssignees all or a portion of its rights and obligations under this Agreement (including all or a portion of its \nCommitment and the Loans at the time owing to it); provided that: \n(i) \nexcept if an Event of Default has occurred and is continuing or in the case of an \nassignment of the entire remaining amount of the assigning Lender’s Commitment and the Loans \nat the time owing to it or in the case of an assignment to a Lender or an Affiliate of a Lender or an \nApproved Fund with respect to a Lender, the aggregate amount of the Commitment being \nassigned (which for this purpose includes Loans outstanding thereunder) or, if the applicable \nCommitment is not then in effect, the principal outstanding balance of the Loan of the assigning \nLender subject to each such assignment (determined as of the date the Assignment and \nAssumption with respect to such assignment is delivered to the Administrative Agent or, if “Trade \nDate” is specified in the Assignment and Assumption, as of the Trade Date) shall not be less than \n$5,000,000, in the case of any assignment in respect of a revolving facility, or $1,000,000, in the \ncase of any assignment in respect of a term facility, unless each of the Administrative Agent and, \nso long as no Default has occurred and is continuing, the Borrower otherwise consent to a lower \namount (each such consent not to be unreasonably withheld or delayed); \n(ii) \neach partial assignment shall be made as an assignment of a proportionate part \nof all the assigning Lender’s rights and obligations under this Agreement with respect to the Loan \nor the Commitment assigned, except that this clause (ii) shall not prohibit any Lender from \nassigning all or a portion of its rights and obligations among separate credits on a non-pro rata\nbasis; \n(iii) \nany assignment of a Commitment relating to a credit under which Letters of \nCredit may be issued must be approved by any Issuing Bank (such approval not to be \nunreasonably withheld or delayed) unless the Person that is the proposed assignee is itself \nalready a Lender with a Commitment under that credit; \n(iv) \nany assignment must be approved by the Administrative Agent (such approval \nnot to be unreasonably withheld or delayed) unless:  \n",
      "69": "- 16 - \n(x)  \nin the case of an assignment of a Commitment relating to a revolving \ncredit, the proposed assignee is itself already a Lender with the same type of \nCommitment,  \n(y)  \nno Event of Default has occurred and is continuing, and the assignment \nis of a Commitment relating to a non-revolving credit that is fully advanced, or  \n(z)  \nthe proposed assignee is a bank whose senior, unsecured, non-credit \nenhanced, long term debt is rated at least A3, A- or A low by at least two of Moody's \nInvestor Services Inc., Standard & Poor's, a division of The McGraw-Hill Companies, Inc. \nand Dominion Bond Rating Service Limited, respectively;  \n(v) \nany assignment must be approved by the Borrower (such approval not to be \nunreasonably withheld or delayed) unless the proposed assignee is itself already a Lender with \nthe same type of Commitment or a Default has occurred and is continuing; and  \n(vi) \nthe parties to each assignment shall execute and deliver to the Administrative \nAgent an Assignment and Assumption, together with a processing and recordation fee in an \namount specified elsewhere in this Agreement10 and the Eligible Assignee, if it shall not be a \nLender, shall deliver to the Administrative Agent an Administrative Questionnaire. \nSubject to acceptance and recording thereof by the Administrative Agent pursuant to paragraph (c) of this \nSection, from and after the effective date specified in each Assignment and Assumption, the Eligible \nAssignee thereunder shall be a party to this Agreement and, to the extent of the interest assigned by such \nAssignment and Assumption, have the rights and obligations of a Lender under this Agreement and the \nother Loan Documents, including any collateral security, and the assigning Lender thereunder shall, to \nthe extent of the interest assigned by such Assignment and Assumption, be released from its obligations \nunder this Agreement (and, in the case of an Assignment and Assumption covering all of the assigning \nLender’s rights and obligations under this Agreement, such Lender shall cease to be a party hereto) but \nshall continue to be entitled to the benefits of Sections 3 and 9, and shall continue to be liable for any \nbreach of this Agreement by such Lender, with respect to facts and circumstances occurring prior to the \neffective date of such assignment.  Any assignment or transfer by a Lender of rights or obligations under \nthis Agreement that does not comply with this paragraph shall be treated for purposes of this Agreement \nas a sale by such Lender of a participation in such rights and obligations in accordance with paragraph \n(d) of this Section.  Any payment by an assignee to an assigning Lender in connection with an \nassignment or transfer shall not be or be deemed to be a repayment by the Borrower or a new Loan to \nthe Borrower. \n(c) \nRegister. The Administrative Agent shall maintain at one of its offices in Toronto, Ontario \nor Montréal, Québec a copy of each Assignment and Assumption delivered to it and a register for the \nrecordation of the names and addresses of the Lenders, and the Commitments of, and principal amounts \nof the Loans owing to, each Lender pursuant to the terms hereof from time to time (the “Register”). The \nentries in the Register shall be conclusive, absent manifest error, and the Borrower, the Administrative \nAgent and the Lenders may treat each Person whose name is recorded in the Register pursuant to the \nterms hereof as a Lender hereunder for all purposes of this Agreement, notwithstanding notice to the \ncontrary. The Register shall be available for inspection by the Borrower and any Lender, at any \nreasonable time and from time to time upon reasonable prior notice. \n(d) \nParticipations. Any Lender may at any time, without the consent of, or notice to, the \nBorrower or the Administrative Agent, sell participations to any Person (other than a natural person, an \n10 Ensure that the Credit Agreement specifies the amount of this fee. \n",
      "70": "- 17 - \nObligor or any Affiliate of an Obligor11) (each, a “Participant”) in all or a portion of such Lender’s rights \nand/or obligations under this Agreement (including all or a portion of its Commitment and/or the Loans \nowing to it); provided that (i) such Lender’s obligations under this Agreement shall remain unchanged, (ii) \nsuch Lender shall remain solely responsible to the other parties hereto for the performance of such \nobligations and (iii) the Borrower, the Administrative Agent and the other Lenders shall continue to deal \nsolely and directly with such Lender in connection with such Lender’s rights and obligations under this \nAgreement.  Any payment by a Participant to a Lender in connection with a sale of a participation shall \nnot be or be deemed to be a repayment by the Borrower or a new Loan to the Borrower. \nSubject to paragraph (e) of this Section, the Borrower agrees that each Participant shall be \nentitled to the benefits of Section 3 to the same extent as if it were a Lender and had acquired its interest \nby assignment pursuant to paragraph (b) of this Section. To the extent permitted by law, each Participant \nalso shall be entitled to the benefits of Section 4 as though it were a Lender, provided such Participant \nagrees to be subject to Section 5 as though it were a Lender. \n(e) \nLimitations upon Participant Rights. A Participant shall not be entitled to receive any \ngreater payment under Section 3.1 and 3.2 than the applicable Lender would have been entitled to \nreceive with respect to the participation sold to such Participant, unless the sale of the participation to \nsuch Participant is made with the Borrower’s prior written consent. A Participant that would be a Foreign \nLender if it were a Lender shall not be entitled to the benefits of Section 3.2 unless the Borrower is \nnotified of the participation sold to such Participant and such Participant agrees, for the benefit of the \nBorrower, to comply with Section 3.2(e) as though it were a Lender. \n(f) \nCertain Pledges.  Any Lender may at any time pledge or assign a security interest in all \nor any portion of its rights under this Agreement to secure obligations of such Lender, but no such pledge \nor assignment shall release such Lender from any of its obligations hereunder or substitute any such \npledgee or assignee for such Lender as a party hereto. \n11. \nGoverning Law: Jurisdiction: Etc. \n(a) \nGoverning Law. This Agreement shall be governed by, and construed in accordance with, \nthe laws of the Province specified elsewhere in this Agreement12 and the laws of Canada applicable in \nthat Province. \n(b) \nSubmission to Jurisdiction. Each Obligor irrevocably and unconditionally submits, for \nitself and its property, to the nonexclusive jurisdiction of the courts of the Province specified elsewhere in \nthis Agreement, and any appellate court from any thereof, in any action or proceeding arising out of or \nrelating to this Agreement or any other Loan Document, or for recognition or enforcement of any \njudgment, and each of the parties hereto irrevocably and unconditionally agrees that all claims in respect \nof any such action or proceeding may be heard and determined in such court.  Each of the parties hereto \nagrees that a final judgment in any such action or proceeding shall be conclusive and may be enforced in \nother jurisdictions by suit on the judgment or in any other manner provided by law. Nothing in this \nAgreement or in any other Loan Document shall affect any right that the Administrative Agent or any \nLender may otherwise have to bring any action or proceeding relating to this Agreement or any other \nLoan Document against any Obligor or its properties in the courts of any jurisdiction. \n(c) \nWaiver of Venue. Each Obligor irrevocably and unconditionally waives, to the fullest \nextent permitted by Applicable Law, any objection that it may now or hereafter have to the laying of venue \nof any action or proceeding arising out of or relating to this Agreement or any other Loan Document in \n11  Consideration should be given to the percentage of Lenders required to permit the sale of a participation to an Obligor or any \nAffiliate or Subsidiary of an Obligor. Not required in this instance. \n12  Ensure that the Credit Agreement identifies the Province referred to here and in paragraph (b) immediately below.  Confirmed. \n",
      "71": "- 18 - \nany court referred to in paragraph (b) of this Section. Each of the parties hereto hereby irrevocably \nwaives, to the fullest extent permitted by Applicable Law, the defense of an inconvenient forum to the \nmaintenance of such action or proceeding in any such court. \n12. \nWAIVER OF JURY TRIAL \nEACH PARTY HERETO HEREBY IRREVOCABLY WAIVES, TO THE FULLEST \nEXTENT PERMITTED BY APPLICABLE LAW, ANY RIGHT IT MAY HAVE TO A TRIAL BY JURY IN \nANY LEGAL PROCEEDING DIRECTLY OR INDIRECTLY ARISING OUT OF OR RELATING TO THIS \nAGREEMENT OR ANY OTHER LOAN DOCUMENT OR THE TRANSACTIONS CONTEMPLATED \nHEREBY OR THEREBY (WHETHER BASED ON CONTRACT, TORT OR ANY OTHER THEORY). \nEACH PARTY HERETO (A) CERTIFIES THAT NO REPRESENTATIVE, AGENT OR ATTORNEY OF \nANY OTHER PERSON HAS REPRESENTED, EXPRESSLY OR OTHERWISE, THAT SUCH OTHER \nPERSON WOULD NOT, IN THE EVENT OF LITIGATION, SEEK TO ENFORCE THE FOREGOING \nWAIVER AND (B) ACKNOWLEDGES THAT IT AND THE OTHER PARTIES HERETO HAVE BEEN \nINDUCED TO ENTER INTO THIS AGREEMENT AND THE OTHER LOAN DOCUMENTS BY, AMONG \nOTHER THINGS, THE MUTUAL WAIVERS AND CERTIFICATIONS IN THIS SECTION. \n13. \nCounterparts: Integration: Effectiveness: Electronic Execution \n(a) \nCounterparts: Integration: Effectiveness. This Agreement may be executed in \ncounterparts (and by different parties hereto in different counterparts), each of which shall constitute an \noriginal, but all of which when taken together shall constitute a single contract. This Agreement and the \nother Loan Documents and any separate letter agreements with respect to fees payable to the \nAdministrative Agent constitute the entire contract among the parties relating to the subject matter hereof \nand supersede any and all previous agreements and understandings, oral or written, relating to the \nsubject matter hereof. Except as provided in the conditions precedent Section(s) of this Agreement, this \nAgreement shall become effective when it has been executed by the Administrative Agent and when the \nAdministrative Agent has received counterparts hereof that, when taken together, bear the signatures of \neach of the other parties hereto. Delivery of an executed counterpart of a signature page of this \nAgreement by telecopy or by sending a scanned copy by electronic mail shall be effective as delivery of a \nmanually executed counterpart of this Agreement.\n(b) \nElectronic Execution of Assignments. The words “execution,” “signed,” “signature,” and \nwords of like import in any Assignment and Assumption shall be deemed to include electronic signatures \nor the keeping of records in electronic form, each of which shall be of the same legal effect, validity or \nenforceability as a manually executed signature or the use of a paper-based recordkeeping system, as \nthe case may be, to the extent and as provided for in any Applicable Law, including Parts 2 and 3 of the \nPersonal Information Protection and Electronic Documents Act (Canada), the Electronic Commerce Act, \n2000 (Ontario) and other similar federal or provincial laws based on the Uniform Electronic Commerce Act \nof the Uniform Law Conference of Canada or its Uniform Electronic Evidence Act, as the case may be. \n14. \nTreatment of Certain Information: Confidentiality \n(1) \nEach of the Administrative Agent and the Lenders agrees to maintain the confidentiality of the \nInformation (as defined below), except that Information may be disclosed (a) to it, its Affiliates and its and \nits Affiliates' respective partners, directors, officers, employees, agents, advisors and representatives (it \nbeing understood that the Persons to whom such disclosure is made will be informed of the confidential \nnature of such Information and instructed to keep such Information confidential), (b) to the extent \nrequested by any regulatory authority purporting to have jurisdiction over it (including any self-regulatory \nauthority), (c) to the extent required by Applicable Laws or regulations or by any subpoena or similar legal \nprocess, (d) to any other party hereto, (e) in connection with the exercise of any remedies hereunder or \nunder any other Loan Document or any action or proceeding relating to this Agreement or any other Loan \nDocument or the enforcement of rights hereunder or thereunder, (f) subject to an agreement containing \n",
      "72": "- 19 - \nprovisions substantially the same as those of this Section, to (i) any assignee of or Participant in, or any \nprospective assignee of or Participant in, any of its rights or obligations under this Agreement or (ii) any \nactual or prospective counterparty (or its advisors) to any swap, derivative, credit-linked note or similar \ntransaction relating to the Borrower and its obligations, (g) with the consent of the Borrower or (h) to the \nextent such Information (x) becomes publicly available other than as a result of a breach of this Section or \n(y) becomes available to the Administrative Agent or any Lender on a non-confidential basis from a \nsource other than an Obligor. \n(2) \nFor purposes of this Section, “Information” means all information received in connection with this \nAgreement from any Obligor relating to any Obligor or any of its Subsidiaries or any of their respective \nbusinesses, other than any such information that is available to the Administrative Agent or any Lender \non a non-confidential basis prior to such receipt. Any Person required to maintain the confidentiality of \nInformation as provided in this Section shall be considered to have complied with its obligation to do so if \nsuch Person has exercised the same degree of care to maintain the confidentiality of such Information as \nsuch Person would accord to its own confidential information.  In addition, the Administrative Agent may \ndisclose to any agency or organization that assigns standard identification numbers to loan facilities such \nbasic information describing the facilities provided hereunder as is necessary to assign unique identifiers \n(and, if requested, supply a copy of this Agreement), it being understood that the Person to whom such \ndisclosure is made will be informed of the confidential nature of such Information and instructed to make \navailable to the public only such Information as such person normally makes available in the course of its \nbusiness of assigning identification numbers \n(3) \nIn addition, and notwithstanding anything herein to the contrary, the Administrative Agent may \nprovide the information described on Exhibit B concerning the Borrower and the credit facilities \nestablished herein to Loan Pricing Corporation and/or other recognized trade publishers of information for \ngeneral circulation in the loan market. \n",
      "73": "TOR_LAW\\ 9034402\\25 \nEXHIBIT A \nASSIGNMENT AND ASSUMPTION \nThis Assignment and Assumption (the “Assignment and Assumption”) is dated as of the Effective \nDate set forth below and is entered into by and between [Insert name of Assignor] (the “Assignor”) and \n[Insert name of Assignee] (the “Assignee”). Capitalized terms used but not defined herein shall have the \nmeanings given to them in the Credit Agreement identified below (as amended, the “Credit Agreement”), \nreceipt of a copy of which is hereby acknowledged by the Assignee. The Standard Terms and Conditions \nset forth in Annex 1 attached hereto are hereby agreed to and incorporated herein by reference and \nmade a part of this Assignment and Assumption as if set forth herein in full. \nFor an agreed consideration, the Assignor hereby irrevocably sells and assigns to the Assignee, \nand the Assignee hereby irrevocably purchases and assumes from the Assignor, subject to and in \naccordance with the Standard Terms and Conditions and the Credit Agreement, as of the Effective Date \ninserted by the Administrative Agent as contemplated below (i) all of the Assignor’s rights and obligations \nin its capacity as a Lender under the Credit Agreement and any other documents or instruments delivered \npursuant thereto to the extent related to the amount and percentage interest identified below of all of such \noutstanding rights and obligations of the Assignor under the respective facilities identified below (including \nwithout limitation any letters of credit, guarantees, and swingline loans included in such facilities) and (ii) \nto the extent permitted to be assigned under Applicable Law, all claims, suits, causes of action and any \nother right of the Assignor (in its capacity as a Lender) against any Person, whether known or unknown, \narising under or in connection with the Credit Agreement, any other documents or instruments delivered \npursuant thereto or the loan-transactions governed thereby or in any way based on or related to any of \nthe foregoing, including, but not limited to, contract claims, tort claims, malpractice claims, statutory \nclaims and all other claims at law or in equity related to the rights and obligations sold and assigned \npursuant to clause (i) above (the rights and obligations sold and assigned pursuant to clauses (i) and (ii) \nabove being referred to herein collectively as, the “Assigned Interest”). Such sale and assignment is \nwithout recourse to the Assignor and, except as expressly provided in this Assignment and Assumption, \nwithout representation or warranty by the Assignor. \n1. \nAssignor: \n2. \nAssignee: \n[and is an Affiliate/Approved Fund of [identify Lender]1] \n3. \nBorrower(s): \n \n4. \nAdministrative Agent: _______________________, as the administrative agent under the Credit \nAgreement \n5. \nCredit Agreement:  \n[The [amount] Credit Agreement dated as of _______ among [name of \nBorrower(s)], the Lenders parties thereto, [name of Administrative Agent], as Administrative \nAgent, and the other agents parties thereto] \n1  Select as applicable. \n",
      "74": "- 2 - \nAssigned Interest: \nFacility Assigned2 \nAggregate Amount of \nCommitment/Loans \nfor all Lenders3\nAmount of \nCommitment/Loans \nAssigned3\nPercentage Assigned \nof Commitment/Loans4\nCUSIP Number \n$ \n$ \n% \n$ \n$ \n% \n$ \n$ \n% \n[ \nTrade Date: \n \n]5\n2  Fill in the appropriate terminology for the types of facilities under the Credit Agreement that are being assigned under this \nAssignment (e.g. “Revolving Credit Commitment,” “Term Loan Commitment,” etc.) \n3  Amount to be adjusted by the counterparties to take into account any payments or prepayments made between the Trade Date \nand the Effective Date. \n4  Set forth, to at least 9 decimals, as a percentage of the Commitment/Loans of all Lenders thereunder. \n5  To be completed if the Assignor and the Assignee intend that the minimum assignment amount is to be determined as of the \nTrade Date. \n",
      "75": "- 3 - \nEffective Date: ___________, 20___ [TO BE INSERTED BY ADMINISTRATIVE AGENT AND WHICH \nSHALL BE THE EFFECTIVE DATE OF RECORDATION OF TRANSFER IN THE REGISTER \nTHEREFOR.] \nThe terms set forth in this Assignment and Assumption are hereby agreed to: \nASSIGNOR \n[NAME OF ASSIGNOR] \nBy:  \nTitle: \nASSIGNEE \n[NAME OF ASSIGNEE] \nBy:  \nTitle: \n[Consented to and]6 Accepted: \n[NAME OF ADMINISTRATIVE AGENT], as \nAdministrative Agent \nBy \n \nTitle: \n[Consented to:]7\n[NAME OF RELEVANT PARTY] \nBy \n \nTitle: \n6  To be added only if the consent of the Administrative Agent is required by the terms of the Credit Agreement. \n7  To be added only if the consent of the Borrower and/or other parties (e.g. Swingline Lender, L/C Issuer) is required by the terms \nof the Credit Agreement. \n",
      "76": "TOR_LAW\\ 9034402\\25 \nANNEX 1 to Assignment and Assumption \n[                                   ]1\nSTANDARD TERMS AND CONDITIONS FOR \nASSIGNMENT AND ASSUMPTION \n1. Representations and Warranties. \n1.1 \nAssignor. The Assignor (a) represents and warrants that (i) it is the legal and beneficial owner of \nthe Assigned Interest, (ii) the Assigned Interest is free and clear of any lien, encumbrance or other \nadverse claim and (iii) it has full power and authority, and has taken all action necessary, to execute and \ndeliver this Assignment and Assumption and to consummate the transactions contemplated hereby; and \n(b) assumes no responsibility with respect to (i) any statements, warranties or representations made in or \nin connection with the Credit Agreement or any other Loan Document2, (ii) the execution, legality, validity, \nenforceability, genuineness, sufficiency or value of the Loan Documents or any collateral thereunder, (iii) \nthe financial condition of the Borrower, any of its Subsidiaries or Affiliates or any other Person obligated in \nrespect of any Loan Document or (iv) the performance or observance by the Borrower, any of its \nSubsidiaries or Affiliates or any other Person of any of their respective obligations under any Loan \nDocument. \n1.2 \nAssignee. The Assignee (a) represents and warrants that (i) it has full power and authority, and \nhas taken all action necessary, to execute and deliver this Assignment and Assumption and to \nconsummate the transactions contemplated hereby and to become a Lender under the Credit Agreement, \n(ii) it meets all requirements of an Eligible Assignee under the Credit Agreement (subject to receipt of \nsuch consents as may be required under the Credit Agreement), (iii) from and after the Effective Date, it \nshall be bound by the provisions of the Credit Agreement as a Lender thereunder and, to the extent of the \nAssigned Interest, shall have the obligations of a Lender thereunder, (iv) it has received a copy of the \nCredit Agreement, together with copies of the most recent financial statements delivered pursuant to \nSection ___ thereof, as applicable, and such other documents and information as it has deemed \nappropriate to make its own credit analysis and decision to enter into this Assignment and Assumption \nand to purchase the Assigned Interest on the basis of which it has made such analysis and decision \nindependently and without reliance on the Administrative Agent or any other Lender, and (v) if it is a \nForeign Lender3, attached to the Assignment and Assumption is any documentation required to be \ndelivered by it pursuant to the terms of the Credit Agreement, duly completed and executed by the \nAssignee; and (b) agrees that (i) it will, independently and without reliance on the Administrative Agent, \nthe Assignor or any other Lender, and based on such documents and information as it shall deem \nappropriate at the time, continue to make its own credit decisions in taking or not taking action under the \nLoan Documents, and (ii) it will perform in accordance with their terms all of the obligations which by the \nterms of the Loan Documents are required to be performed by it as a Lender. \n2. \nPayments. From and after the Effective Date, the Administrative Agent shall make all payments in \nrespect of the Assigned Interest (including payments of principal, interest, fees and other amounts) to the \nAssignee whether such amounts have accrued prior to, on or after the Effective Date. The Assignor and \nthe Assignee shall make all appropriate adjustments in payments by the Administrative Agent for periods \nprior to the Effective Date or with respect to the making of this assignment directly between themselves.   \n3. \nGeneral Provisions. This Assignment and Assumption shall be binding upon, and inure to the \nbenefit of, the parties hereto and their respective successors and permitted assigns. This Assignment and \n1  Describe Credit Agreement at option of Administrative Agent. \n2  The term “Loan Document” should be conformed to the term used in the Credit Agreement. Conformed. \n3  The concept of “Foreign Lender” should be conformed to the section in the Credit Agreement governing withholding taxes and \ngross-up. \n",
      "77": "- 2 - \nAssumption may be executed in any number of counterparts, which together shall constitute one \ninstrument. Delivery of an executed counterpart of a signature page of this Assignment and Assumption \nby telecopy or by sending a scanned copy by electronic mail shall be effective as delivery of a manually \nexecuted counterpart of this Assignment and Assumption. This Assignment and Assumption shall be \ngoverned by, and construed in accordance with, the law governing the Credit Agreement. \n",
      "78": "TOR_LAW\\ 9034402\\25 \nEXHIBIT B \nLOAN MARKET DATA TEMPLATE \nRecommended Data Fields – At Close  \nThe items highlighted in bold are those that Loan Pricing Corporation (LPC) deem essential.  The \nremaining items are those that LPC has seen become more prominent over time as transparency has \nincreased in the U.S. Loan Market.    \nCompany Level \nDeal Specific \nFacility Specific \nIssuer Name \nCurrency/Amount \nCurrency/Amount \nLocation \nDate \nType\nSIC (Cdn) \nPurpose \nPurpose \nIdentification Number(s) \nSponsor\nTenor \nRevenue\nFinancial Covenants\nTerm Out Option\nExpiration Date \nTarget Company \nFacility Signing Date \n*Measurement of Risk\nAssignment Language\nPricing \nS&P Sr. Debt\nLaw Firms \nBase Rate(s)/Spread(s)/BA/LIBOR \nS&P Issuer\nMAC Clause \nInitial Pricing Level \nMoody’s Sr. Debt\nSpringing lien \nPricing Grid (tied to, levels) \nMoody’s Issuer\nCash Dominion \nGrid Effective Date\nFitch Sr. Debt\nMandatory Prepays \nFees\nFitch Issuer\nRestrct’d Payments (Neg Covs)  \nParticipation Fee (tiered also)\n \nS&P Implied  \n      (internal assessment)  \nOther Restrictions \nCommitment Fee \nDBRS\nOther Ratings \nAnnual Fee \n*Industry Classification \nUtilization Fee \nMoody’s Industry\n \nLC Fee(s) \n \nS&P Industry\n \nBA Fee \nParent \n \nPrepayment Fee \nFinancial Ratios \nOther Fees to Market\n \nSecurity \nSecured/Unsecured\n \nCollateral and Seniority of Claim \n \nCollateral Value \nGuarantors\nLenders Names/Titles \nLender Commitment ($) \nCommitted/Uncommitted \nDistribution method \nAmortization Schedule \nBorrowing Base/Advance Rates\nNew Money Amount \nCountry of Syndication \nFacility Rating (Loss given default) \n \nS&P Bank Loan \nMoody’s Bank Loan \nFitch Bank Loan \n \nDBRS  \nOther Ratings \n",
      "79": "TOR_LAW\\ 9034402\\25 \nSCHEDULE B \nLENDERS AND COMMITMENTS \nLender and Lending \nOffice \nFP Tranche \n(To be completed \nonce Total \nCommitment is \nallocated) \nDevelopment \nTranche \n(To be completed \nonce Total \nCommitment is \nallocated) \nITC Tranche \nTotal Commitment \nCanadian Imperial \nBank of Commerce\n25 King Street West \nCommerce Court North \n– 16th Floor \nToronto, Ontario M5L \n1A2 \nAttention:  \nPaul Montgomery and \nMauricio Echeverri \nFacsimile No.: (416) \n214-8749 \nEmail:   \npaul.montgomery \n@cibc.com \nmauricio.echeverri \n@cibc.com \nCdn. $n\n(50%) \nCdn. $n\n(50%) \nCdn. $0.00 \n(50%) \nCdn. $2,250,000 \n(50%) \nCanadian Western \nBank \n3000, 10303 Jasper \nAvenue \nEdmonton AB T5J 3X6 \nAttention: Mykhaylo \nHotsaliuk \nFacsimile: 780-421-\n0379 \nCdn. $n\n(25%) \nCdn. $n\n(25%) \nCdn. $0.00 \n(25%) \nCdn. $$1,125,000 \n(25%) \nLaurentian Bank of \nCanada\n8500 Leslie Street Suite \n100 Thornhill On. L3T \n7M8 \nAttention: Jeff Weller \nFacsimile: (905) 886-\n5851 \nCdn. $n\n(25%) \nCdn. $n\n(25%) \nCdn. $0.00 \n(25%) \nCdn. $1,125,000 \n(25%) \nTotal \nCdn. $n\nCdn. $n\nCdn. $0.00 \nCdn. $4.500,000 \n",
      "80": "TOR_LAW\\ 9034402\\25 \nSCHEDULE C \nLEGAL DESCRIPTION OF PROJECT LANDS \nLeslieville Project Lands - 50 Curzon Street, Toronto, Ontario \nPIN 21051-0408 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc.  \nFirstly: Part Lot 11, Plan 61E Toronto; Part Lot 11, Concession 1 FTB, designated as Part 2, \nPlan 66R-25636; Secondly: Part Lot 11, Concession 1 FTB designated as Part 1, Plan 66R-\n25636; Thirdly: Part Lot 11, Concession 1 FTB commencing at an iron bar in the western limit of \nCurzon Street, distant 595.81 feet measured northerly therealong from the northern limit of \nQueen Street East; Thence north 16 degrees 00 minutes west along the said western limit of \nCurzon Street a distance of 65.70 feet to an iron bar; thence south 74 degrees 22 minutes 20 \nseconds west a distance of 252.43 feet to an iron pipe in the eastern limit of Lot 8, according to \na Plan filed in the said Registry Office as number 61E; thence south 17 degrees 06 minutes \neast along the eastern limits of Lots 8 and 9 according to said Plan 61E a distance of 66.00 feet \nto a spike in a stump; Thence north 74 degrees 18 minutes 20 seconds east a distance of \n251.17 feet to the point of commencement; subject to an easement as in AT2958528; subject to \nan easement as in AT3708202, subject to an easement as in AT3728135, City of Toronto \n",
      "81": "TOR_LAW\\ 9034402\\25 \nSCHEDULE D \nLEGAL DESCRIPTION OF BEACH REMAINING LANDS \nBeach Remaining Lands - 42 Edgewood Avenue, Toronto, Ontario \nFormerly PIN 21024-0422 (LT) \nLots 5, 6, 7, 8 and 9, Plan 504 (Midway); Lots 66, 67, 68 and 69, Plan 481E, designated as \nParts 1 and 2, Plan 66R-25512; s/t an easement over Part Lot 69, Plan 481E, designated as \nPart 2, Plan 66R-25512 in favour of Part Lot 70, Plan 481E as in ET127629; t/w an easement \nover Part Lot 70, Plan 481E, designated as Parts 3, Plan 66R-25512 as in ET127629; City of \nToronto \nNow  \n(1) PIN 21024−0455 (LT)  \nOwner: Urbancorp (Leslieville) Developments Inc.  \nPART OF LOT 66 & 67 PLAN 481E DESIGNATED AS PART 1 PLAN 66R27603; TOGETHER \nWITH AN EASEMENT OVER PART OF LOTS 7 AND 8 PL 504 (MIDWAY) AND PART OF \nLOTS 67 AND 68, PLAN 481E, TORONTO DESIGNATED AS PART 3 ON PLAN 66R26973 \nUNTIL SUCH TIME AS SAID PART 3 IS DEDICATED AS PUBLIC HIGHWAY AS IN \nAT3535638; CITY OF TORONTO \n(2) PIN 21024−0456 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc.  \nPART OF LOTS 8 & 9 PLAN 504 (MIDWAY) DESIGNATED AS PART 2 PLAN 66R27603; \nTOGETHER WITH AN EASEMENT OVER PART OF LOTS 7 AND 8 PL 504 (MIDWAY) AND \nPART OF LOTS 67 AND 68, PLAN 481E, TORONTO DESIGNATED AS PART 3 ON PLAN \n66R26973 UNTIL SUCH TIME AS SAID PART 3 IS DEDICATED AS PUBLIC HIGHWAY AS IN \nAT3535638; CITY OF TORONTO \n(3) PIN 21024−0457 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc. and Urbancorp (The Beach) \nDevelopments Inc. \nPART OF LOTS 8 & 9 PLAN 504 (MIDWAY) DESIGNATED AS PART 3 PLAN 66R27603 \nTOGETHER WITH AN EASEMENT OVER PART OF LOTS 7 AND 8 PL 504 (MIDWAY) AND \nPART OF LOTS 67 AND 68, PLAN 481E, TORONTO, DESIGNATED AS PART 3 ON PLAN \n66R26973 UNTIL SUCH TIME AS SAID PART 3 IS DEDICATED AS PUBLIC HIGHWAY AS IN \nAT3535638; CITY OF TORONTO \n(4) PIN 21024−0469 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc. and Urbancorp (The Beach) \nDevelopments Inc. \n",
      "82": "- 2 - \nPART OF LOT 66 PLAN 481E DESIGNATED AS PART 15 PLAN 66R27603; TOGETHER \nWITH AN EASEMENT OVER PART OF LOTS 7 AND 8 PL 504 (MIDWAY) AND PART OF \nLOTS 67 AND 68, PLAN 481E, TORONTO, DESIGNATED AS PART 3 ON PLAN 66R26973 \nUNTIL SUCH TIME AS SAID PART 3 IS DEDICATED AS PUBLIC HIGHWAY AS IN \nAT3535638; CITY OF TORONTO \n(5) PIN 21024−0491 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc. and Urbancorp (The Beach) \nDevelopments Inc. \nPT LTS 5, 6 & 7 PLAN 504 BEING PT 36 PL 66R27603 AND PT LT 5 PLAN 504 BEING PT 1 \nPL 66R27625; TOGETHER WITH AN EASEMENT OVER PT LTS 7 & 8 PL 504 & PT \nLT 67 & 68 PL 481E PT 3 PL 66R26973 AS IN AT3535638; TOGETHER WITH AN EASEMENT \nOVER PT LT 70 PL 481E PT 3 PL 66R25512 AS IN ET127629; SUBJECT TO AN \nEASEMENT OVER PT 1 PL 66R27625 IN FAVOUR OF PT LT 4 PL 504 AS IN AT3690147; \nCITY OF TORONTO \n(6) PIN 21024−0492 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc.  \nPT LTS 5, 6 & 7 PLAN 504 BEING PT 35 PL 66R27603 AND PT LT 5 PL 504 BEING PT 2 PL \n66R27625; TOGETHER WITH AN EASEMENT OVER PT LTS 7 & 8 PL 504 & PT LT \n67 & 68 PL 481E PT 3 PL 66R26973 AS IN AT3535638; TOGETHER WITH AN EASEMENT \nOVER PT LT 70 PL 481E PT 3 PL 66R25512 AS IN ET127629; SUBJECT TO AN \nEASEMENT OVER PT 2 PL 66R27625 IN FAVOUR OF PT LT 4 PL 504 AS IN AT3690147; \nCITY OF TORONTO \n(7) PIN 21024−0493 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc. and Urbancorp (The Beach) \nDevelopments Inc. \nPT LTS 68 & 69 PL 481E BEING PT 17 PL 66R27603; TOGETHER WITH AN EASEMENT \nOVER PT LTS 7 & 8 PL 504, PT LTS 67 & 68 PL 481E PT 3 PL 66R26973 AS IN \nAT3535638; TOGETHER WITH AN EASEMENT OVER PT LT 70 PL 481E PT 3 PL 66R25512 \nAS IN ET127629; CITY OF TORONTO \n(8) PIN 21024−0494 (LT) \nOwner: Urbancorp (Leslieville) Developments Inc.  \nPT LT 69 PL 481E BEING PTS 16 & 18 PL 66R27603; TOGETHER WITH AN EASEMENT \nOVER PT LTS 7 & 8 PL 504, PT LTS 67 & 68 PL 481E PT 3 PL 66R26973 AS IN \nAT3535638; TOGETHER WITH AN EASEMENT OVER PT LT 70 PL 481E PT 3 PL 66R25512 \nAS IN ET127629; SUBJECT TO AN EASEMENT OVER PT 18 PL 66R27603 IN FAVOUR OF \nPT LT 70 PL 481E AS IN ET127629; CITY OF TORONTO \n",
      "83": "TOR_LAW\\ 9034402\\25 \nSCHEDULE 1.01(A) \nDRAWDOWN NOTICE \nTO: \nCANADIAN IMPERIAL BANK OF COMMERCE, as Administrative Agent \nFROM: \nALVAREZ & MARSAL CANADA INC., solely in its capacity as Court Appointed \nReceiver and Manager and Construction Lien Trustee of URBANCORP \n(LESLIEVILLE) DEVELOPMENTS INC., URBANCORP (RIVERDALE) \nDEVELOPMENTS INC. and URBANCORP (THE BEACH) DEVELOPMENTS \nINC., as Construction Receiver (the “Construction Receiver”) and not in its \npersonal or corporate capacity \nDATE: \nn, 201n\n1. \nThis Drawdown Notice is delivered to you, as Administrative Agent, pursuant to Section \n2.03 of the Credit Agreement made as of April 18, 2017 between, inter alia, the Construction \nReceiver, as Construction Receiver, you, as Administrative Agent, and the financial institutions \nfrom time to time parties thereto as lenders, as amended to the date hereof (the “Credit \nAgreement”). All terms used in this Drawdown Notice that are defined in the Credit Agreement \nhave the same meanings herein. \n2. \nThe Construction Receiver hereby requests the following Loan(s): \n(a) \nDrawdown Date: \n___________________________________________________ \n(b) \nType(s) of Tranche requested under the Credit Facility (If draws are being made \nunder more than one Tranche, check multiple boxes below, as applicable): \n[ ]  FP Tranche \nor \n[ ]  Development Tranche \nor \n[ ]  ITC Tranche \n(c) \nAmount of Loan requested (If draws are being made under more than one \nTranche, complete both lines):  \nTranche \nAmount \n__________________\nPrime Rate \nLoan: \nCdn. $ \n________________________ \n__________________\nPrime Rate \nLoan: \nCdn. $ \n________________________ \n",
      "84": "- 2 - \n3. \nAll of the conditions precedent to the Loan(s) requested hereby that have not been \nproperly waived in writing by or on behalf of the Lenders have, to the best of the knowledge of \nthe Construction Receiver (without any independent investigation), been satisfied. \n4. \nTo the best of the knowledge of the Construction Receiver (based solely on information \nobtained from the Independent Cost Consultant, Consultants and Craft and without any \nindependent investigation), no Default or Event of Default has occurred and is continuing or will \nhave occurred and be continuing on the Drawdown Date, or will result from the Loan(s) \nrequested hereby. \n5. \nAccompanying this Drawdown Notice are the following documents: \n• \nCopy of completed Application for Payment (or Application for Final Payment as \napplicable) signed by Craft under the Construction Contract and relating to the Craft \npayment to be funded by the requested Drawdown, together with copies of all related \nstatutory declarations and certificates provided by Craft to the Independent Cost \nConsultant in connection with such Application.   \n• \nCopy of completed Consultant’s Payment Certificate (or Consultant’s Final Payment \nCertificate as applicable) issued under the Construction Contract and relating to the \nCraft payment to be made, signed by Kasian Architecture Ontario Inc.  \n• \nCopy of completed application for payment of Development Costs under the Craft \nDevelopment Contract. \n• \nCopy of the Project Monitor’s Payment Verification (or Project Monitor’s Final \nPayment Verification as applicable) signed by the Independent Cost Consultant\nunder the Construction Contract which includes the Independent Cost Consultant’s \nrecommendation for payment of the Development Costs requested.  \n• \nCompleted Project Status Certificate signed by the Construction Receiver. \n• \nCompleted Independent Cost Consultant’s Certificate signed by the Independent \nCost Consultant. \nALVAREZ & MARSAL CANADA INC., solely in \nits capacity as Court Appointed Receiver and \nManager and Construction Lien Trustee of \nURBANCORP (LESLIEVILLE) \nDEVELOPMENTS INC., URBANCORP \n(RIVERDALE) DEVELOPMENTS INC. and \nURBANCORP (THE BEACH) DEVELOPMENTS \nINC., as Construction Receiver and not in its \npersonal or corporate capacity \nBy: \n \nName: \nTitle: \n",
      "85": "TOR_LAW\\ 9034402\\25 \nSCHEDULE 1.01(B) \nINITIAL DEVELOPMENT BUDGET \n[SEE ATTACHED] \n",
      "86": "TOR_LAW\\ 9034402\\25 \n",
      "87": "TOR_LAW\\ 9034402\\25 \nSCHEDULE 1.01(1)(C)\nPROJECT STATUS CERTIFICATE \nTO: \nCanadian Imperial Bank of \nCommerce, as Administrative \nAgent (the “Administrative \nAgent”) \nCONSTRUCTION RECEIVER:  \nALVAREZ & MARSAL CANADA INC., in its \ncapacity as Court Appointed Receiver and Manager \nand Construction Lien Trustee of URBANCORP \n(LESLIEVILLE) DEVELOPMENTS INC., \nURBANCORP (RIVERDALE) DEVELOPMENTS \nINC. and URBANCORP (THE BEACH) \nDEVELOPMENTS INC., as Construction Receiver \n(the “Construction Receiver”) \nADVANCE: Relating to Drawdown \nNotice dated _____________, 201___ \nPROJECT:  Leslieville Project  (the “Project”) \nCERTIFICATE DATE: [Date] \nCONSTRUCTION CONTRACT: Dated April 18, \n2017 between the Construction Receiver and \nC.R.A.F.T. Development Corporation (“Craft”) \nI, ____________________________, the ________________________________ (insert title) \nof the Construction Receiver, hereby certify for and on behalf of the Construction Receiver and \nnot in my personal capacity and without personal liability, that as of _____________________ \n(insert date): \n1. \nI am familiar with and have examined the provisions of the Credit Agreement dated as of \nApril 18, 2017, between, inter alia, the Construction Receiver, the Administrative Agent and the \nlenders named therein (the “Credit Agreement”) and have made reasonable investigations of \nthe books and records of the Construction Receiver in respect of the Project and inquiries of \nother officers and senior personnel of the Construction Receiver and with the Independent Cost \nConsultant, except as where stated herein.  Terms defined in the Credit Agreement have the \nsame meanings when used in this certificate. \n2. \nI confirm that the Construction Receiver has complied with all holdback requirements \nunder the Construction Lien Act (Ontario) (the “Act”) applicable in respect of the Project, except \nfor any holdback requirements in connection with payments to Consultants.  \n3. \nI confirm that any and all funds heretofore received by the Construction Receiver from \nthe Lenders as advances under the Credit Agreement have been paid to Craft pursuant to and \nin accordance with the payment terms of the Craft Construction Contract or the Craft \nDevelopment Contract. \n4. \nI confirm that the Construction Receiver has not received written notice of any lien or \nother claim of lien in respect of the Project. \n5. \nBased solely on the information provided to me by the Independent Cost Consultant and \nwithout any independent investigation, I confirm that no part of the requested advance is being \nrequested in order to pay for Cost Overruns and that all Cost Overruns incurred in connection \n",
      "88": "- 2 - \nwith the Leslieville Project prior to the date hereof have been fully pre-funded by Terra Firma \nand/or Craft in accordance with the TF Cost Overrun Guarantee and that no Cost Overruns are \ncurrently unfunded except for the following “Dispute Work” (as defined in the TF Cost Overrun \nGuarantee) which is being paid by Craft as required under the applicable Craft C&D Contract:  \n___________________________________________________ (Add schedule as necessary). \n6. \nBased solely on the information provided to me by the Independent Cost Consultant and \nwithout any independent investigation, I am not aware of any Minor Construction Breaches, \nMinor Development Breaches or Major Events of Default (each as defined in the Craft \nConstruction Contract) under either of the Craft C&D Contracts, except for:  \n___________________________________________________ (Add schedule as necessary). \n7. \nAll of the statements contained in this certificate are, to the best of my knowledge (after \ndue inquiry as noted above including with the Independent Cost Consultant) and belief as of the \ndate hereof, true, complete and accurate in all material respects.  \nDated this ______ day of _______, 20___. \nURBANCORP (LESLIEVILLE) DEVELOPMENTS INC.,  \nby Alvarez & Marsal Canada Inc., solely in its capacity as Court  \nAppointed Receiver and Manager and Construction Lien  \nTrustee of Urbancorp (Leslieville) Developments Inc. and \nnot in its personal or corporate capacity\nPer:   _______________________________ \nName: ______________________________ \nTitle:  _______________________________ \n",
      "89": "TOR_LAW\\ 9034402\\25 \nSCHEDULE 1.01(1)(D)  \nINDEPENDENT COST CONSULTANT’S CERTIFICATE \nTO: \nCanadian Imperial Bank of \nCommerce, as Administrative Agent\n(the “Administrative Agent”) \nCONSTRUCTION RECEIVER:  \nALVAREZ & MARSAL CANADA INC., solely in its \ncapacity as Court Appointed Receiver and Manager \nand Construction Lien Trustee of URBANCORP \n(LESLIEVILLE) DEVELOPMENTS INC., \nURBANCORP (RIVERDALE) DEVELOPMENTS INC. \nand URBANCORP (THE BEACH) DEVELOPMENTS \nINC. \n(the “Construction Receiver”) \nADVANCE: Relating to Drawdown \nNotice dated _____________, 201___\nPROJECT: The Leslieville Project (“Project”) \nCERTIFICATE DATE: [Date] \nCONSTRUCTION CONTRACT: Dated April 18, 2017 \nbetween the Construction Receiver and C.R.A.F.T. \nDevelopment Corporation (“Craft”) \nBased on my/our professional experience and qualifications and after making such reasonable \nenquiries as I/we have deemed necessary in the circumstances, I/we hereby certify to the \nAdministrative Agent as follows: \n1. \nUnless otherwise defined herein, all initially capitalized terms have the meanings set \nforth in the Craft Development Contract (as defined in the below-mentioned Credit \nAgreement), as amended from time to time, and if not defined therein, then in the Credit \nAgreement dated as of April 18, 2017, between, inter alia, the Construction Receiver, the \nAdministrative Agent and the lenders named therein, as amended from time to time (the \n“Credit Agreement”). \n2. \nI/we have periodically inspected construction since the commencement of construction \nand last inspected the Project on _____________________ (insert date) (the \n“Inspection Date”). \n3. \nAll required permits, licenses and other authorizations have been obtained and are being \nmaintained. \n4. \nThe Project has not been damaged by fire or other casualty.  \n5. \nConstruction and development of the Project up to and including the Inspection Date has \nbeen performed in a good and workmanlike manner (subject to the qualification in Note \n1). \n6. \nConstruction and development of the Project up to and including the Inspection Date has \nbeen performed substantially in accordance with (i) the plans and specifications, (ii) the \nConstruction Schedule, (iii) all applicable building codes, municipal bylaws and \nregulations, (iv) all required permits, licenses and other authorizations, and (v) all \napplicable laws, rules and regulations including, without limitation, environmental laws \n(subject to the qualification in Note 1belowi).  \n",
      "90": "- 2 - \n7. \nThe statutory declarations and/or other evidence provided by Craft and any and all \nrelevant sub-contractors on the Project confirm that, as of the date hereof: (i) no claims \nfor lien have been registered against the Project by Craft, the Builder or such sub-\ncontractors, (ii) Craft, the Builder and each such sub-contractor is not aware of any \ngrounds supporting any claim for lien against the Project, and (iii) Craft is not aware of \nany breach or non-compliance under the Construction Contract that would constitute a \nConstruction Breach. \n8. \nThere is no “Dispute Work” (as defined under either of the Craft C&D Contracts) that has \nnot been pre-funded by Craft or Terra Firma except for:  \n___________________________________________________ (Add schedule as \nnecessary). \n9. \nWe are not aware of any Minor Construction Breaches, Minor Development Breaches or \nMajor Events of Default (as each term is defined under either of the Craft C&D \nContracts) except for:  ___________________________________________________ \n(Add schedule as necessary). \n10. \nIn my/our opinion, as of the date hereof, the figures set forth below accurately reflect the \nProject costs or work completed on the Project and the costs of the remaining work \nrequired to complete the Project in accordance with the plans and specifications and the \nConstruction Schedule. A report setting out in greater detail those elements comprising \nthe figures set out below is attached hereto and forms part of this Certificate. \n(a) \nProject costs of work completed to date: \n $____________ \n(b) \nProject costs of remaining work: \n $____________ \n(c) \nEstimated total Project costs (a+b): \n $____________ \n(d) \nOriginal estimate of total Project costs: \n $____________ \n(e) \nAmount of additional costs, if any (c-d):          $____________ \n11. \nI/we confirm that the Cost Overruns associated with the Project to date are as follows: \n(a) \nTotal Cost Overruns to date: \n  $____________ \n(b) \nCost Overruns not currently pre-funded  \nby Craft or Terra Firma Capital Corporation:   $____________ \nDetails to any new Cost Overruns are set forth in greater detail in the accompanying \nreport.  \n12. \nAfter giving effect to the requested advance, the Cost to Complete the Project (excluding \nDevelopment Costs to be funded under the Development Tranche) does not exceed (a) \nthe undrawn Credit Facility Commitment allocated to the FP Tranche, (b) the funding \npreviously received and then currently held by the Construction Receiver for Cost \nOverruns under the Craft Construction Contract provided by Terra Firma, Craft or the \nLenders under the TF Cost Overrun Guarantee; and (c) if the Geo-thermal System Costs \n",
      "91": "- 3 - \nare being funded through a Craft Loan, the amount of Craft Loans received and then \ncurrently held by the Construction Receiver to fund Geo-thermal System Costs. \n13. \nIn the case of a Drawdown under the Development Tranche, the Costs of Craft to be \npaid with the proceeds of such Drawdown are within the current Development Budget. \n14. \nAfter giving effect to the requested Drawdown, the remaining Budgeted Development \nCosts do not exceed (a) the undrawn Credit Facility Commitment allocated to the \nDevelopment Tranche and (b) the funding previously received and then currently held by \nthe Construction Receiver for Cost Overruns under the Craft Development Contract \nprovided by Terra Firma, Craft or the Lenders under the TF Cost Overrun Guarantee. \n15. \nI/we confirm, in respect of any Application for Payment (or Application for Final Payment \nas applicable) under the Construction Contract pending as of the date hereof, that the \nrequisite holdback amounts for the payments thereunder and consistent with that portion \nof the Project Costs for which payment is being sought, are properly shown in such \nApplication, i.e., as deductions from the net payment to be made thereunder. \n16. \nIn my/our opinion, as of the date hereof, Substantial Performance of the Work is \nprojected to occur on or before: \n[  ]  \nthe original Scheduled Substantial Performance Date set forth in the \nConstruction Contract, namely n, 201n, and in any event, by no later than the Outside \nDate, namely [June 15, 2018].  \nor \n[  ]   \n___________, 201n. \nReasons for delay, if applicable, are outlined in the attached schedule. \n",
      "92": "- 4 - \nThis certificate is given in connection with the abovementioned Advance to be made to the \nConstruction Receiver under the Credit Agreement, and you may rely upon it in making such \nadvance. \nDated this ______ day of _______, 20___. \nALTUS GROUP LIMITED \nPer:   _______________________________ \nName: ______________________________ \nTitle:  _______________________________ \nT1006349\\TOR_LAW\\ 9034402\\26\ni Note 1: It should be noted that cost consultants are not qualified to confirm that construction work has \nbeen completed in accordance with plans and specifications. In this regard, we will forward certificates \nprovided by the design consultants as available to confirm that the Project is being constructed in \naccordance with the approved plans and specifications, and the provincial building code. The experience, \nexpressed herein with the respect to environmental issues, is limited to the anticipated impact on budget \nand schedule based on the experts reports provided. \n"
    }
  }
}